{"id": "high7211.txt", "source_text": "A recent study of ancient and modern elephants has come up with the unexpected conclusion that the African elephant is divided into two distinct  species.\nThe discovery was made by researchers at York and Harvard Universities when they were examining the genetic relationship between the ancient woolly mammoth and mastodon to modern elephants -- the Asian elephant, African forest elephant, and African savanna elephant.\nOnce they obtained DNA sequences  from two fossils , mammoths,and mastodons the team compared them with DNA from modern elephants. They found to their amazement that modern forest and savanna elephants are as distinct from each other as Asian elephants and mammoths.\nThe scientists used detailed genetic analysis to prove that the African savanna elephant and the African forest elephant have been distinct species for several million years. The divergence of the two species took place around the time of the divergence of Asian elephants and woolly mammoths. This result amazed all the scientists. There has long been debate in the scientific community that the two might be separate species, but this is the most convincing scientific evidence so far that they are indeed different species.\nPreviously, many naturalists believed that African savanna elephants and African forest elephants were two populations of the same species, despite the elephants' significant size differences. The savanna elephant has an average shoulder height of 3.5 metres while the forest elephant has an average shoulder height of 2.5 metres. The savanna elephant weighs between six and seven tons, roughly double the weight of the forest elephant. But the fact that they look so different does not necessarily mean they are different species. However the proof lay in the analysis of the DNA.\nAlfred Roca, assistant professor in the Department of Animal Sciences at the University of Illinois, said, \"We now have to treat the forest and savanna elephants as two different units for conservation purposes. Since 1950,all African elephants have been conserved as one species. Now that we know the forest and savanna elephants are two very distinctive animals, the forest elephant should become a bigger priority  for conservation purposes.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high20453.txt", "source_text": "When he was driving home one evening on a country road,he saw an old lady,stranded on the side of the road.He stopped in front of her car and got out.Even with the smile on his face,she was worried.He looked poor and hungry.He knew how she felt.He said,\"I am here to help you,madam.Why\ndon't you wait in the car where it's warm? By the way, my name is Joe.\"\nShe had a flat tire.Joe crawled under the car,changed the tire.But he got dirty and his hands hurt.She could not thank him enough and asked him how much she owed him.He told her that if she really wanted to pay him back,the next time she saw someone who needed help,she could give that person the  assistance they needed,and Joe added,\"And think of me.\"\nShe drove off.A few miles down the road the lady saw a small restaurant.She went in.The waitress had a sweet smile,and was nearly eight months pregnant .The old lady wondered how someone like her who seemed poor could be so kind to a stranger.Then she remembered Joe.After the lady finished her meal,the waitress went to get her change from a hundred--dollar bill.But she stepped right out the door.\nWhen the waitress came back,she noticed something written on a napkin,\"I am helping you because someone once helped me.If you really want to pay me back,here's what you do---Do not let the chain of love end with you.\"\nThat night when she got home,she was thinking about the money and what the lady had written.She and her husband needed money with the baby due next month.She knew how worried her husband was,and as he lay sleeping next to her,she whispered,\"Everything's going to be all right.I love you,Joe.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high16165.txt", "source_text": "I recently turned fifty, which is young for a tree, midlife for an elephant, and ancient for a sportsman. Fifty is a nice number for the states in the US or for a national speed limit but it is not a number that I was prepared to have hung on me. Fifty is supposed to be my father's age, but now I am stuck with this number and everything it means.\nA few days ago, a friend tried to cheer me up by saying, \" Fifty is what forty used to be.\" He had made an inspirational point, Am I over the hill?People keep telling me that the hill has been moved, and I keep telling them that he high-jump bar has dropped from the six feet I once easily cleared to the four feet that is impossible for me now.\n\" Your are not getting older, you are getting better.\" says Dr. Joyce Brothers. This, however, is the kind of doctor who inspires a second opinion.\nAnd so. as I approach the day when I cannot even jump over the tennis net. I am moves to share some thoughts on aging with you. I am moved to show how aging feels to me physically and mentally. Getting older. of course, is obviously a better change than the one that brings you eulogies . In fact, a poet named Robert Browning considered it the best change of all:\nGrow old along with me!\nThe best is yet to me.\nWhether or not Browning was right, most of my first fifty years have been golden ones, so I will settle for what is ahead being as good as what has gone by. I find myself moving toward what is ahead with a curious blend   of both fighting and accepting my aging, hoping that the philosopher   was right when he said.\" Old is always fifteen years from now.\"", "split": "test", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high19035.txt", "source_text": "With little rain, ancient Egyptians relied mostly on the Nile River to water their crops, so they could only grow certain kinds of food. They mainly grew wheat and barley  .\nThe Egyptians made the wheat into bread, soup and porridge, and they also added hops   to make the barley into beer. In fact, some people think that the Egyptians would not have begun growing grain if they hadn't liked beer so much. Many Egyptian models of beer jars have been found, which the Egyptians put into graves of dead people so that they would have beer in the next world.\nThe Egyptians also ate meat. They went to a butcher shop and bought meat there, just as people do today. But because it rarely rains in Egypt, they could have the meat outside in the yard of the store instead of inside. Click on the left and you will see a model of a butcher shop, which was also found in somebody's grave. Can you see the different cuts of meat all laid out? There is a whole leg of mutton at the very bottom. However, Egyptians thought pigs carried infectious disease. They ate beef, mutton, duck and goose. \nFor dessert, the Egyptians had a great interest in dates. Here is a picture of some real Egyptian dates which were put into people's graves for them to eat in the next world, and which were kept in the dry climate for three thousand years until archaeologists dug them up.\nArchaeologists have also found seeds which show that the Egyptians grew watermelon and other kinds of melon.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high18773.txt", "source_text": "There was a rich merchant who had 4 wives. He loved the 4th wife the most and adorned her with rich robes and treated her to delicacies. He took great care of her and gave her nothing but the best. \nHe also loved the 3rd wife very much. He's very proud of her and always wanted to show her off to his friends. However, the merchant is always in great fear that she might run away with some other men. \nHe too, loved his 2nd wife. She is a very considerate person, always patient and in fact is the merchant's confidante. When the merchant faced some problems, he always turned to his 2nd wife and she would always help him out and tide him through difficult times. \nNow, the merchant's 1st wife is a very loyal partner and has made great contributions in maintaining his wealth and business as well as taking care of the household. However, the merchant did not love the first wife and although she loved him deeply, he hardly took notice of her. \nOne day, the merchant fell ill. Before long, he knew that he was going to die soon. He thought of his luxurious life and told himself, \"Now I have 4 wives with me. But when I die, I'll be alone. How lonely I'll be!\" \nThus, he asked the 4th wife, \"I loved you most, endowed you with the finest clothing and showered great care over you. Now that I'm dying, will you follow me and keep me company?\" \n\"No way!\" replied the 4th wife and she turned away without another word. \nThe answer cut like a sharp knife right into the merchant's heart. The sad merchant then asked the 3rd wife, \"I have loved you so much for all my life. Now that I'm dying, will you follow me and keep me company?\"\n\"No!\" replied the 3rd wife. \"Life is so good over here! I'm going to remarry when you die!\" The merchant's heart sank and turned cold. \nHe then asked the 2nd wife, \"I've always turned to you for help and you've always helped me out. Now I need your help again. When I die, will you follow me and keep me company?\" \n\"I'm sorry, I can't help you out this time!\" replied the 2nd wife. \"At the very most, I can only send you to your grave.\" The answer came like a bolt of thunder and the merchant was devastated. \nThen a voice called out: \"I'll leave with you. I'll follow you no matter where you go.\" The merchant looked up and there was his first wife. She was so skinny, almost like she suffered from malnutrition. Greatly grieved, the merchant said, \"I should have taken much better care of you while I could have!\" \nActually, we all have 4 wives in our lives.\nThe 4th wife is our body. No matter how much time and effort we lavish in making it look good, it'll leave us when we die. \nOur 3rd wife is our possessions, status and wealth. When we die, they all go to others. \nThe 2nd wife is our family and friends. No matter how close they had been there for us when we're alive, the furthest they can stay by us is up to the grave. \nThe 1st wife is in fact our soul, often neglected in our pursuit of material, wealth and sensual pleasure. \nGuess what? It is actually the only thing that follows us wherever we go. Perhaps it's a good idea to cultivate and strengthen it now rather than to wait until we're on our deathbed to lament.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high17451.txt", "source_text": "Mr. and Mrs. Martin live in New York. Mr. Martin is a doctor and his office is in New York. Mrs. Martin teaches music at a school in New York.\n    They have two sons. Their sons' names are Ted and Roy. Ted is twenty years old. He is now in Taiwan. He is studying Chinese. He went to Taiwan last month and is going to stay there for two years.\nRoy is thirteen years old. He goes to high school. He likes sports very much. He likes swimming best. He can swim faster than his father. He wants to be the best swimmer in his school.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high16133.txt", "source_text": "Sheffield\nLincoln College of English\nClasses for foreign students at all levels 3 months, 6 months, 9 months and one course open all year.\nSmall class (maximum 12 students), library, language lab and listening center,\naccommodations with selected families 25 minutes from London.\nCourse fees for English for one year are $1380 with reduction for shorter periods of study.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle8209.txt", "source_text": "Tommy and his mother go shopping  today. Tommy's father likes apples very much. They buy some red apples for him. Tommy's mother likes yellow bananas, but the bananas are green. \"Look! The strawberries are very nice, Mom. Do you like them?\" Tommy says to his mother. \"Yes, I like strawberries very much.\" Tommy's mother buys some for herself  . The oranges are very nice. Tommy's mother buys some for Tommy. He likes oranges very much.\nThey need some vegetables. The vegetables in the supermarket are very good. They buy some tomatoes, cabbages and carrots. Tommy doesn't like carrots, but his parents like it. They like carrots very much. They buy lots of carrots.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high827.txt", "source_text": "Have you ever wondered why the roots of the plants always know which way to grow--into the soil but not above it? Some British scientists have recently solved this mystery.\nIt turns out that roots have special hairs that tie them into the soil and help them grow their way past obstacles, a team at the John Inners Center in Norwich reports in the February 29 issue of Journal Science.\n\"The key is in the fuzzy coat of hairs on the roots of plants,\" says professor Liam Dolan. \"We have found a growth control system that enables these hairs to find their way and to become longer when their path is clear.\"\nRoot hairs explore the soil in much the same way a person would feel their way in the dark. If they come across an obstacle, they make their way around until they can continue growing in an opening. In the meantime, the plant is held in place as the hairs grip the soil.\nThe hairs are guided by a clever chemical trick. A protein  at the tip of the root hairs called RHD2 helps them to take calcium  from the soil. Calcium makes the hairs grow, and produce more RHD2, and take more calcium.\nBut when an obstacle blocks the hair's path, or the hair reaches the surface of the soil, the cycle is broken and growth starts in another direction.\nThis system gives plants the flexibility to explore a complex environment and to live in even the most unpromising soils, says Dolan.\nIn poor soils such as in parts of Australia and Africa, native plants have adapted by producing enormous numbers of root hairs. A better understanding of this adaptation will allow scientists to develop hairy rooted crops that can grow in unfriendly environments.\nAccording to Dolan, \"Research in the John Inners Center is taking a breeding approach to increase hair length in wheat but it will be some time before new cultivars  are developed.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle67.txt", "source_text": "Mike  and  his  father  are  sitting   at   the  table . They are having their lunch. \" I  don't  like  this  soup  .  I  don't  want  to  have  it\" ,  says  Mike .  After  lunch ,  Mike  and  his  father  work  on  the  farm .  They work hard. In  the  evening ,  Mike's  father  gives  him  a  bowl  of  soup . \"Oh, this soup is nice \", says Mike.  His mother says: \"It's the same soup.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high18853.txt", "source_text": "All you have is what you bring with you\nI've always felt a need to be prepared for whatever situation I've found myself in.\nMy mother once took me to a store when I was seven years old. She and I got to the checkout counter, and she realized she had forgotten a couple of things on her shopping list. She left me with the cart and ran off to get what she needed.\n\"I'll be right back.\" she said.\nShe was gone just a few minutes, but in that time, I had loaded all the things on the belt and everything was rung up. I was left staring at the cashier, who was staring at me.\" Do you have money for me, son?\" she said. \"I'll need to be paid.\" \nI didn't realize she was just trying to amuse herself. So I stood there, ashamed and embarrassed.\nBy the time my mom returned, I was angry. \"You left me here with no money! This lady asked me for the money, and I had nothing to give her!\"\nNow that I'm an adult, you'll never catch me with less than $200 in my wallet. I want to be prepared in case I need it.\nI've always admired people who are over-prepared. In college, I had a classmate named Norman. One day he was giving a presentation on an overhead projector   and in the middle of his talk, the light bulb on the projector blew out. We would have to wait ten minutes until someone found a new' projector.\n\"It's Okay.\" he announced. \"There's nothing to worry about.\"\nWe watched him walk over to his bag and pull something out. He had brought along a spare bulb for the Overhead projector. Who could even think of that?\nI often told my students, \"When you go into the wilderness, the only thing you can depend on is what you take with you.\" And essentially, the wilderness is anywhere but your home or office. So take money. Pack a light bulb. Be prepared.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high17496.txt", "source_text": "A new semester has just started and a number of parents are registering to change their children's names, in the hope that it will change their temper or help their children drop bad habits, like addiction to the Internet.\n    One mother surnamed Shi renamed her son, a primary school student, Hengfu, which means eternal happiness in Chinese. She decided to change the boy's name because he always did poorly in study. She has had him tutored after school, but he always earns low marks in school. So Shi turned to a name-giving master. \"I hope the special recipe could bring him good luck,\" the mother said. Teachers in the city say a few students in every school, most nearing graduation, change their names at the start of every new semester.\n    A naming agency said it has found names for nearly 1,000 students since setting up the shop in 1998. The store said its professionals analyzed the defects   of a person's original name, and suggested a new one based on the person's birthday and other fortune-telling skills.\n    Buying a new name costs between 800 yuan and 10,000 yuan. Parents also have to register the name at the local police department for a small fee. This will legally change their child's name on all documents, including ID cards and passports.\nHu Jie, a university student who changed her name in her final year of high school, said the new name confused her. \"I always had no idea who my classmates were calling when they used my new name,\" Hu said, adding that she wished she had kept her old name.\nBut parents may be ignoring one thing: name changes might encourage kids to believe that fate is more important than their own efforts.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "middle2893.txt", "source_text": "Once my father asked me to hold his hammer while he repaired something, so we could have some time to talk to each other.\nFor 22 years, after I left home for college, he called me every Sunday at 9 am. He was always interested in my life and how my family was doing, and I never once heard him complain about his own life.\nNine years ago when I bought my first house, my father, 67 years old, spent eight hours a day painting it for three days. He would not allow me to pay someone to have it done. All he asked for was a glass of iced tea and for me to hold a paint brush for him and talk to him. But I was too busy.\nFive years ago, at age 71, my father spent five hours putting together a swingset   for my daughter. Again, all he asked was that I get him a glass of iced tea and talk to him. But again, I was too busy.\nFour years ago, my father drove all the way from Denver to Topeka, with an eight-foot Colorado blue spruce   in his trunk, so that my husband and I could have a part of Colorado growing on our land. I was preparing for a trip that weekend and couldn't spend much time with him.\nThen, one day, my father telephoned me as usual, this time from my sister's home in Florida. We talked about the tree he had brought me, \"Fat Albert\", but that morning he called it \"Fat Oscar\", and he seemed to have forgotten some things. I had to get to church, so I cut the conversation short.\nThe call came at 4:40 pm that day: my father was in hospital in Florida with an aneurysm  . I got on a plane immediately, and on the way I thought of all the times I had not taken the time to talk to my father. I realized that I had no idea who he was or what his deepest thoughts were. I promised that when I arrived, I would make up for lost time.\nI arrived in Florida at 1 am. My father had passed away at 9:12 pm. This time it was he who did not have time to talk to me.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high7972.txt", "source_text": "Unlike chemists and physicists, who usually do their experiments using machines, biologists and medical researchers have to use living things like rats. But there are three Nobel prize-winning scientists who actually chose to experiment on themselves - all in the name of science, reported The Telegraph.\n1. Werner Forssmann (Nobel prize winner in 1956)\nForssmann was a German scientist. He studied how to put a pipe inside the heart to measure the pressure inside and decide whether a patient needs surgery.\nExperiments had been done on horses before, so he wanted to try with human patients. But it was not permitted because the experiment was considered too dangerous.\nNot giving up, Forssmann decided to experiment on himself. He anaesthetized   his own arm and made a cut, putting the pipe 30 centimeters into his vein. He then climbed two floors to the X-ray room before pushing the pipe all the way into his heart.\n2. Barry Marshall (Nobel prize winner in 2005)\nMost doctors in the mid-20th century believed that _ was down to stress, spicy food or an unusually large amount of stomach acid. But in 1979 an Australian scientist named Robin Warren found that the disease might be related to a bacteria called Helicobacter pylori.\nSo he teamed up with his colleague, Barry Marshall, to continue the study. When their request to experiment on patients was denied, Marshall bravely drank some of the bacteria. Five days later, he lost his appetite and soon was vomiting each morning - he indeed had gastritis.\n3. Ralph Steinman (Nobel prize winner in 2011)\nThis Canadian scientist discovered a new type of immune system cell called the dendritic cell. He believed that it had the ability to fight against cancer.\nSteinman knew he couldn't yet use his method to treat patients. So in 2007, when doctors told him that he had cancer and that it was unlikely for him to live longer than a year, he saw an opportunity.\nWith the help of his colleagues, he gave himself three different vaccines based on his research and a total of eight experimental therapies. Even though Steinman eventually died from his cancer, he lived four and a half years, much longer than doctors had said he would.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high13490.txt", "source_text": "Anne is six years older than me. Growing up, we were very poor, and my mother worked evenings at a factory in a small town. Not seeing my mother much, Anne looked after me and my younger sister.  During those hard years, Anne was always there for me, not only as a big sister, but as a mother and my best friend.\nWhen I was seventeen and had no money, I thought my only chance of going to college was if I could win a scholarship. I had an important interview for such an award. Anne at that time was struggling, surviving on a part-time job as she put herself through the local community college after serving in the army.  I told her of my interview.  I asked her advice on what to wear and showed her my best outfit   and how I planned to be careful, how I sat so that the hole in the bottom of my shoes would not be seen, but I wasn't sure what I would do if it rained.\nAnne suggested that we go shopping, and we took the bus to the JCPenney store. We found a beautiful pair of leather shoes on sale. She told me to try them on, but I thought it was just for fun as neither of us had ever owned anything that expensive before. But Anne handed me the boxed shoes and said, \"Here, I'll buy these for you.\"\n\"But . . .\" was all I could say.\n\"You deserve them,\" she replied. \"This interview is important. I want to see you get that scholarship.\"\nI was speechless as I knew this was a lot of money for her, and she would probably have to eat nothing but noodles for at least a month.\nI went to the interview and crossed my legs so that my beautiful new shoes shone with pride. I won the scholarship and became an engineer. Although they were nice leather everyday shoes, I didn't wear them much because they were so special.  Now, after 20 years have passed, I still have that pair of shoes with me, and I just wear them on those occasions when I need to feel special.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high11809.txt", "source_text": "I don't often lose things and I'm always careful with money, so I was quite surprised when I reached for my wallet and it wasn't there. At first, I thought it was possible that I could have left it at home. Then I remembered taking it out to pay the taxi, so I knew I had it with me just before I walked into the restaurant. I wondered if it was possible that it could have dropped out of my pocket while I was eating dinner. I turned and walked back to the table where I had been sitting. Unluckily, there were several people sitting at the table at that time, so I had the waiter go over to the table to see if my wallet was on the floor. While the waiter was looking for it, the head of the restaurant came up to me and asked me if anything was wrong. I told him what had happened. He asked me to report the missing wallet to the police. I told him I didn't want to do so; I was in a hurry because I had to reach my waiting room before two o'clock, where some people were waiting to see me. I also told him that my biggest worry at the moment was how I was going to pay for the meal. He told me not to worry about that. He asked me to write down my name and address, and he said he would send me a bill  .", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high4682.txt", "source_text": "Emilio and Michi spread the colorful tablecloth on the table. They made room for Drew, who was carrying a dish. \"Watch out,\" Drew warned. \"This is pretty hot.\"\nA moment later, Kent and Alyssa added another hot dish to the table. \"That smells so good!\" said Michi. \"Are most of the parents here yet? I'm hungry.\"\nKent looked through the doors that led into the hallway. \"I think Ms. Milano and Mr.Hasselbach just finished giving _ the garden touring. They should be heading into the cafeteria next.\"\nThe students of Jefferson Middle School in Saint Louis, US had spent all afternoon preparing for the evening meal. They did their best to transform the lunchroom into a beautiful dining area for their families.\nAs the families found their seats, Ms. Milano asked Drew, Emilio, and Michi to join her at the front of the room. She said, \"I just wanted to take a moment to congratulate Drew, Emilio and Michi for their wonderful idea. A year ago, they first came to me with the plan for starting a garden at Jefferson. I wondered whether it would work, but they had thought through everything. Any time I had a question about how we would make this work, they had an answer prepared. As you can see, they were absolutely correct. About three-quarters of the food you will be enjoying came from the school garden. The students prepared the entire meal themselves.\"\nMs. Milano handed Drew, Michi and Emilio a box each. They opened their box as Ms. Milano continued. \"As a thank-you to these students for their creative idea and hard work, they have each received a stepping stone for the garden. Their names and date appear on the stones.\"\nShe turned to them. \"Students for years to come will be enjoying the garden that you helped create,\" she said. \"We thought it would be appropriate for them to have a reminder of our garden's founders.\"\nThey held up their stepping stones and smiled as the crowd clapped. \"And now,\" said Ms Milano, \"please help yourself to some of the mouthwatering food our young chefs have prepared. Dinner is served!\"", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "middle470.txt", "source_text": "Mr. Evens works in Sydney. Last week he had a two weeks' holiday, but he didn't know where to go. He said to his friend Robert, \"I hate the hot weather here, but I can't find a cool place in Australia. How will I take my holiday?\"\n\"That's easy,\" said Robert. \"You'd better go to Moscow. Snow and ice are covering the ground now.\"\nMr. Evens agreed with his friend. He bought an air ticket and soon arrived in Moscow. He made a happy journey  there. But one day He got into trouble. After lunch he went to a park outside the city. He saw a dog following him while he was walking past a house. It was hungry and wished him to give it some food to eat. Bad luck! He had no piece of bread or cake in his pockets. He tried to send it away, but it began to bark at him. He wanted to look for a stick but couldn't find anything except snow and ice. Suddenly he saw a stone in the ground. He tried to pick it up but he failed.\n\"How strange Russians  are!\" Mr. Evens said to himself. \"They do not tie their dogs, but firmly  tie the ground!\"", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high14913.txt", "source_text": "As jewelry designers,my sister Jodie and I are always traveling for work.We need to go to a lot of shows,so we can't pack lightly and usually bring about four suitcases filled with our work.\nMost of our stuff is made from heavy materials and metals.So part of the routine for us when we fly is getting stopped by security.Our jewelry sets off the alarms,and we've become accustomed to arriving early to go through private screenings.Most of the time,it's not troublesome.\nHowever,on our recent trip to a Paris trade show,we were stopped at security and asked to empty our bags. One of the agents walked over to another agent and they started whispering to each other.Both gentlemen came back,and one of them then told us that it seemed that we were carrying a very dangerous object.\nMy sister and I just said,\"Huh?\"Of course,we were a little concerned,thinking that maybe someone put something dangerous in one of our bags when we weren't looking.\nOne of the agents then started to unpack our bags.I kept asking what he was 1ooking for and then the object in question finally appeared.It was our Cosima necklace.It's a piece of jewelry,with large,metal triangular spikes.\nMy sister and I 1ooked at each other and breathed a huge sigh of relief.We started laughing and explained to the two male agents that it was just a necklace from our collection.not a weapon of mass destruction.They thought we were lying,and one agent kept repeating that he believed it was a weapon.\nI tried to explain that we were jewelry designers going to a trade show,and this was simply a piece from our collection.But the agents didn't _ it.Then a few women guards came over to assist.One of the women guards was holding an earring up to her ear and another was trying on a ring.Apparently,they liked our stuff.\nIt was only at this point that the male guards gave up.And I think they also got tired of listening to a bunch of women talk about jewelry.They let us through.\nWe took the names of the women agents and sent them a piece of jewelry when we got back to say thanks.", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high8618.txt", "source_text": "One day Mrs. Perry said to her husband, Jack, there is a meeting of our ladies' club at Mrs. Young's house at lunch time today. And I want to go to it. I'll leave you some food for your lunch. Is that all right?\"\n\"Oh, yes,\" her husband answered, \"that's quite all right. What are you going to leave for my lunch?\"\n\"This tin of fish.\" Mrs. Perry said. \"And there are some cold boiled potatoes and some beans here, too.\"\n\"Good,\" Mr. Perry answered. \"I'll have a good lunch.\"\nSo Mrs. Perry went to her meeting. All the ladies had lunch at Mrs. Young's house , and at three o'clock she came home.\n\"Was your fish nice?\" asked she.\n\"Yes, but my feet are hurting,\" he answered.\n\"Why are they hurting?\"\n\"Well, the words on the tin were Open the tin and stand in hot water for five minutes.\"", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high12967.txt", "source_text": "On November 15th, 2014, children aged 8 to 12 got together in five cities around the world to participate in the first Global Children's Designation. The event that was organized by a Dutch company called Unexpect, challenged kids to come up with solutions for some of the world's most pressing problems in a day!\nThe day began with the kids listening to the various challenges that were related to their particular cities and towns. The teams were then asked to brainstorm about which problem they were going to handle and how. There were so many amazing ideas produced on that day.\nWhile some of the ideas were far from perfect, there were many that could be practical like the smart cars which can ease traffic pressure by telling traffic lights of its arrival and also guiding the drivers to the best possible route .\nEmer Beamer, the founder of Unexpect, says the purpose of the project is to introduce children to skills they probably never learn in class. She says that for most part, schools focus on teaching things that they will most likely never need to know again. She believes that for kids to be successful in the world, they should be learning how to be creative, handle new technologies and deal with unexpected situations.\nThough the first global design challenge was relatively small, involving only a few hundred of the two billion youngsters that are bursting with ideas, the next one will be much bigger. That's because in 2015, Unexpect plans to distribute free tool kits  to any school that is interested in hosting their own Children's Designation Challenge. We can't wait to see what ideas kids will come up with next.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high11670.txt", "source_text": "Many gardeners believe that \"talking\" to their plants helps them grow---it turns out that _ may not be crazy after all. According to the scientists from the University of Exeter, plants may keep communicating with each other through a secret \"unseen\" language.\nFor their experiment, the scientists picked a cabbage plant that is known to send out a gas when its surface is cut. In order to get video evidence of the communication, they changed the cabbage gene by adding the protein---luciderase , which is what makes fireflies  glow in the dark.\nWhen the changed cabbage plant was in full bloom, they cut a leaf off with a pair of scissors, and almost immediately, thanks to the luciderase, they could see the plant sending out \"methyl jasmonate \".\nWhile this was a known fact, what was surprising was the fact that the minute this gas began to give out, the nearby cabbage plants seemed to sense some kind of danger and started to send out a gas that they normally have to keep predators  like caterpillars  away.\nWhat the scientists are not sure is whether the plants are trying to warn the other leaves or the near plants about the danger---something that will require further research However, the team, which is led by Professor Nick Smirnoff, is quite excited about the findings because this is the first time it has been proved that plants do not live a passive life, but actually move, sense and even communicate with each other.\nHowever, before you get all concerned, they are quite sure that plants do not feel the pain when they are cut, since they do not have nerves---so go ahead and bite into that juicy carrot!", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high4557.txt", "source_text": "Dublin City Hall\nInside City Hall is an interesting exhibition about Dublin's history, with historical items from the old city and multimedia presentations. The building, which dates from 1779, once badly damaged, was recently _ . Guided tours are available. Open Monday to Saturday 10:00 a.m.~5:15 p.m., Sunday and holidays 2:00 p.m.~5:00 p.m. Admission is EUR6.50. Phone 672- 2204.\nDublin Castle\nThis is a joy for anyone interested in archaeology or history. Dublin Castle was built in the 13th century on top of the foundations of a Viking structure. The castle served as a military fortress, prison, court of law and the core   of British administration in Ireland until 1922. It's now used for state functions and government conferences. Guided tours are available. Open Monday to Friday 10:00 a.m.~4:50 p.m.; Saturday, Sunday and holidays 2:00 p.m.~4:50 p.m. Closed during state functions. Admission is EUR4.50. Phone 677- 7129 or 677- 7270.\nTrinity College\nThe sole college of the University of Dublin, Trinity was founded by Queen Elizabeth I in 1592. The reason most visitors venture to Trinity is to take a look at the Book of Kells, which is on display at the Old Library. The ticket price includes admission to the Long Room, a striking space that contains 200,000 of the college's oldest books. Open Monday to Saturday 9.30am~5pm, Sunday noon~4:30 p.m. (from 9:30 a.m. June to September). College Green. Phone 608 -1177.\nIrish Museum of Modern Art\nHoused in the beautifully restored   Royal Hospital Kilmainham (which was modelled   on Les Invalides in Paris), the museum exhibits contemporary art and has an impressive permanent collection that includes pieces representing the cutting edge of Irish and international art. Open Tuesday to Saturday 10:00 a.m.~5:30 p.m., Sunday and holidays noon~5:30 p.m. The museum has no admission charge. Military Road, Kilmainham. Phone 612- 9900.\nJames Joyce Centre\nJames Joyce is one of Dublin's most famous 20th century writers. Author of such works as Dubliners, Ulysses and his autobiographical novel A Portrait of the Artist as a Young Man, Joyce's name is forever linked to the city of Dublin. The James Joyce Centre is dedicated to promoting the life and works of James Joyce to novices and scholars alike. Open Tues.~Sat. 10:00 a.m.~5:00 p.m., Sun. 1: p.m.~5:00 p.m., admission costs EUR5.00 for adults. North Great George's Street. Phone 878- 8547.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high7274.txt", "source_text": "If you were walking around a supermarket and saw a woman with a shaved head, a ring through her nose, a tattoo design on her arm and she has a small child in her shopping _ , what would your opinion be? Do you think this kind of body decoration is attractive or ugly? Different people have different ideas. The following are some examples of body decoration from around the world.\nIn many parts of Africa, it is thought that an attractive girl should have really shinny skin.\nOn Bali, a little island in Indonesia, they believe that a beautiful woman or handsome man must have perfectly straight, flat teeth. The Balinese believe that teeth with pointed edges make you look like an ugly wild animal. So when a girl or boy becomes a teenager, he or she is taken to a special person in their village who will file off teeth points to make them smooth and flat. There is no anesthetic and this tooth filing is really painful. It is a kind of test. If you can stand it without screaming or crying too much, then you are thought ready to become an adult.\nIn Myanmar, there is a small group of people who are called the \"Papaung\". They believe that a woman can only be really beautiful if she has a long neck. I mean a VERY long neck. Now you might think that you are either born with a long or short neck and that there's nothing whatever you can do about it. But you would be wrong! At around the age of 5, a Papaung girl has heavy metal rings fitted around her neck, tightly between the chin and shoulders. Each year more rings are added and very, very slowly their weight pushes the shoulders down, in this way making the neck look longer. A Papaung woman will wear her neck rings all her life, never once taking them off.\nSo now I'm sure you will all agree that different people have different ideas about what is beautiful.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high19743.txt", "source_text": "The advantages of an international language in the modern world are obvious. Thanks to modern methods of transport, we can travel everywhere more easily and more quickly than ever before, but the language problem still remains. Without a common language, there may be misunderstandings between people of different countries. There are two possible solutions to this problem: either we choose one of the main living languages of the world, or we make up an artificial  one. But neither solution is simple because no living language will be acceptable to everyone and because an artificial language, such as Esperanto, has no culture and would be thought boring by many learners.\nIt is often said that English is quickly becoming a world language. It is certainly the most widely used language in the world, and second only to Chinese in its number or native speakers, but there are certain worries of choosing English as an international language.\nFirst of all, for political reasons and national pride, English is not acceptable to everyone as a world language. Many dislike its influence. English words enter their language and this often threats their own language. In France, a new word \"frangla is\" has been invented to describe the results. Although English is being taught in more and more schools abroad, the process is not always popular. Not every nation is prepared to accept the leading position of English in their education system", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "middle2980.txt", "source_text": "We always celebrated Dad's birthday on Thanksgiving Day, even after he entered a nursing home. When we knew it might be his last birthday, the whole family decided to get together for a huge birthday celebration at the nursing home.\nDad was a good storyteller and we were always his listeners. During a quiet moment, I announced it was now Dad's turn to listen to stories for a change. I wanted everyone to tell Dad what we loved about him. The room became quiet. Then one after another, people told stories from their hearts, while Dad listened with tears in eyes.\nEveryone seemed to have more than one story. Even the little grandchildren couldn't wait to tell Dad why they loved him. For a man who had been kind to so many hundreds of people in his life, here was our chance to tell him how much we love him. A few months later, at Dad's memorial service, we more fully realized what we had given to Dad that night. Those are the stories people normally tell at a funeral   after a loved one is no longer alive to hear the words. They tell stories, full of tears. But we had given those memories to Dad in his life, and we had told them through laughter, together with hugs and joy. He had them to hold and enjoyed them from time to time in his mind during his last days and months.\nWords do matter, and they are enough. We just need to say them or to speak them publicly the ones we love. That's the ways to give back love and that's our chance to celebrate a person in his or her life.", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high8443.txt", "source_text": "Good news for middle and high school students. When it comes to sleeping a little longer, physicians are on your side.\nOn Monday, the American Academy Pediatrics  announced its recommendation that middle and high schools start at 8:30 a.m.or later. \"Doing so will match school schedules to the biological sleep patterns of adolescents,\" the AAP writes in a press release regarding its new policy statement called \"School Start Times for Adolescents\" .\n\"Chronic  sleep loss in adolescents is one of the most common public health issues in the U.S.today,\" according to Judith Owens, director of Sleep Medicine at Children's National Health System.\n\"The research is clear that adolescents who get enough sleep have a reduced risk of being overweight or suffering depression, are less likely to be involved in automobile accidents, and have better grades, higher standardized test scores and an overall better quality of life,\" Owens said in the press release. \"Studies have shown that delaying early school start times is one key factor that can help adolescents get the sleep they need to grow and learn.\"\nEven before the AAP's announcement, school districts across the country have been rethinking start times. Earlier this year The New York Times wrote about Dos Santos, a student at Rock Bridge High School. When Dos Santos learned that school officials were considering starting school 30 minutes earlier than the existing time, she became worried.The student gathered others to her cause. In the end, school officials decided against the earlier start time.\nOne of the organizations that Dos Santos reached out to for help was Start School Later, a nonprofit organization that focuses on getting public schools to set \"healthy school hours.\"\n\"It's going to take collective action, perhaps on a national scale, to get many districts to take on this issue,\" Terra Ziporyn Snider, PhD, director and co-founder of Start School Later, told Yahoo Health.\n\"The science is clear, the will to change isn't,\" she explained. \"The reason for that is that community life goes around school schedules, and any suggestion of change - earlier, later, whatever - brings powerful opposition from everyone who fears a change in routine.\"", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high13041.txt", "source_text": "There is one holiday in the year which is completely American, Thanksgiving Day. It is the day when everyone goes back home to spend the day with his family, to have the traditional Thanksgiving dinner of roast turkey, to talk about old times.\nThis is a story of Thanksgiving Day and of one man's efforts, under rather special circumstances, to carry on these traditions.\nOld Pete took his seat this day on his usual bench in Union Square. Every Thanksgiving Day for nine years, Pete had taken this same seat exactly at one o'clock, and each time the same pleasant thing had happened. But this time Pete had come here more from habit than from hunger.\nCertainly today Pete was not hungry. He had just had a dinner so enormous that he could hardly breathe. The buttons on his ragged shirt and coat were about to burst. He was so full of soup, oysters, roast turkey, apple pie, ice cream, and a dozen other rich foods that the November breeze and the first light fall of snow felt cool and pleasant to his face.\nThe meal had been completely unexpected. He had been passing one of the large homes on Fifth Avenue, where there lived two rich old ladies. It seems that it was their custom each Thanksgiving to place a servant at the front entrance with orders to bring in the first hungry looking person that passed and then give him a Thanksgiving dinner of everything he could eat. On this particular Thanksgiving Day, Pete had passed, the servant had brought him in, and, before Pete knew it, he was being served like a king with more food than he could eat.\nPete sat on the bench now, hardly able to move. He happened to look to the left and there in the distance he saw the Old Gentleman coming toward him. He wanted to get up and run, but he was so full of food that he stayed right there. Every Thanksgiving Day for nine years, the Old Gentleman had come here, and found Pete on this same bench, and then taken him to a restaurant and bought him a Thanksgiving dinner. It was a kind of tradition which the Old Gentleman, who had no family and lived alone, had tried to continue. The old man was tall and thin and sixty years old. He was aristocratic looking and he always dressed in black. His hair was whiter and thinner than it had been the year before, and he leaned more heavily on his cane than he used to.\n\"How do you do!\" said the Old Gentleman. \"I am glad to see that the changes of another year have permitted you to move in health through this beautiful world.\"\nEach time the Old Gentleman had said exactly this same thing. It was part of the tradition. Old Pete, too, began to feel as though he himself was now a part of the tradition, and he therefore did not have the courage to tell the old man that he had already eaten. This dinner seemed to mean so much to the Old Gentleman.\n\"Thank you, sir,\" said Old Pete at last. \"I'll go with you gladly. I'm very hungry sir.\"\nTogether the Old Gentleman and Pete walked south to the same restaurant where each year Pete had his Thanksgiving dinner. They sat at the same table. The Old Gentleman seemed pleased and happy. When the waiter brought dish after dish of food to Pete, the Old Gentleman sat quietly and smiled. Under the circumstance, Pete had to eat. It was part of the tradition, and so he ate like a hero. Soup, oysters, roast turkey, pie, he ate everything, although when he entered the restaurant even the smell of more food almost made him sick. At last Pete leaned back with the battle won.\n\"Thank you sir,\" he said, with some effort, \" for a fine dinner.\"\nThey parted as they did each year at the door, the Old Gentleman going south, Pete north.\nAround the corner, Pete stopped for a moment, felt a terrible pain in his stomach, then fell to the sidewalk unconscious. A little later an ambulance came. In the hospital they discovered that he had had an attack of indigestion.\nAn hour later, another ambulance brought the Old Gentleman to the same hospital. At first they thought it was also indigestion but later one of the nurses said,\n\"That nice old gentleman over there-- you wouldn't think that it was a case of starvation. Proud old family, I suppose. He told me that he hadn't eaten a thing for three days.\"", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "middle3312.txt", "source_text": "My husband and I had just opened up a pet sitting business earlier that year. Our customers had slowly risen from three to thirty a month. We were busy through those hot summer months, driving between visits. Our work was strictly done at the pet owner's home. It was almost too busy for the two of us, but we were making good money!\nWe asked pet owners new to our business to phone two weeks ahead so we had enough time to meet the owners and pets at their homes and make any following meetings before the owner leaves.\nOne day, we decided to take on a new customer just two days before they would leave. We met the family, filled in a form, and spent some time with their dog, Hercules. He playfully jumped on us and touched our hands and arms using his tongue. The family laughed as he did this, showing us that he was very loving.\nTwo days later I appeared at the house, alone. I came up to Hercules and said hello happily. I filled up his water bowl and cleaned any messes he made. Meanwhile, he was so lovely sitting beside. I thought this would be the good picture to send to the owners as usual. After the light and \"click\" sound went off, Hercules rushed at me. I didn't know what had just happened until I noticed the drops of blood. I ran out and did the only thing--calling my husband.\nThen I went to neighbors for help. My husband arrived after ten minutes. The helpful neighbor and my husband led Hercules back into his pen . Then my husband and I took off to the hospital.\nI must have looked like I was shot when I walked into the hospital. The nurses quickly moved me to a room. I asked the doctor in a weak but playful manner, \"Am I going to die?\" He replied, \"Finally.\"", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high6989.txt", "source_text": "As researchers learn more about how children's intelligence develops, they are increasingly surprised by the power of parents.The power of the school has been replaced by the home.To begin with, all the factors which are part of intelligence--the child's understanding of language,learning patterns, curiosity--are established well before the child enters school at the age of six.Study after study has shown that even after school begins, children's achievements have been far more influenced by parents than by teachers.This is particularly true about learning that is languagerelated.The school rather than the home is given credit for variations in achievement in subjects such as science.\nIn view of their power, it's sad to see so many parents not making the most of their child's intelligence.Until recently parents had been warned by educators who asked them not to educate their children.Many teachers now realize that children cannot be educated only at school and parents are being asked to contribute both before and after the child enters school.\nParents have been particularly afraid to teach reading at home.Of course,children shouldn't be pushed to read by their parents, but educators have discovered that reading is best taught individually--and the easiest place to do this is at home.Many fourand fiveyearolds who have been shown a few letters and taught their sounds will compose single words of their own with them even before they have been taught to read.", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
