{"id": "high9792.txt", "source_text": "Lines around the eyes mean the aging process in the body. Though aging is considered as one of the most unavoidable occurrence in one's life, it is not entirely the thing. You just need to know that you can deal with it in your life. For example, if you are willing to spend a considerable amount of money to make yourself look young again, then you can try eye lifts. However, if you are more of the money-conscious type, then you should decide to go for eye creams which bring the same results but with lower prices.\nDespite of the advantages of using eye creams, however, there is a disadvantage in trying them. This is due to the hundreds of brands o eye creams being marketed at present. If you do not know how to choose the best eye cream in the countless brands available, then you might fall victim to eye creams that do not really fulfill their promised effects.\nWhat's good is that looking for the best eye cream does not involve too much effort. You just have to look for eye cream reviews to know how a product performs and if it lives up to its promises. If you have a dermatologist , then you can ask for advice. If you have none, however, then you can just browse on the net for the best cream for your needs.\nIn searching for eye cream reviews, look for those with reviews based on the results of product testing. Doing so can ensure you that you are not basing your decision on fake review sites that are only made to build up an image of a certain product. Follow these tips and guidelines and you are sure to finally spot the best eye cream that can solve your aging problem.", "split": "train", "level": "", "topic": "First Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high7274.txt", "source_text": "If you were walking around a supermarket and saw a woman with a shaved head, a ring through her nose, a tattoo design on her arm and she has a small child in her shopping _ , what would your opinion be? Do you think this kind of body decoration is attractive or ugly? Different people have different ideas. The following are some examples of body decoration from around the world.\nIn many parts of Africa, it is thought that an attractive girl should have really shinny skin.\nOn Bali, a little island in Indonesia, they believe that a beautiful woman or handsome man must have perfectly straight, flat teeth. The Balinese believe that teeth with pointed edges make you look like an ugly wild animal. So when a girl or boy becomes a teenager, he or she is taken to a special person in their village who will file off teeth points to make them smooth and flat. There is no anesthetic and this tooth filing is really painful. It is a kind of test. If you can stand it without screaming or crying too much, then you are thought ready to become an adult.\nIn Myanmar, there is a small group of people who are called the \"Papaung\". They believe that a woman can only be really beautiful if she has a long neck. I mean a VERY long neck. Now you might think that you are either born with a long or short neck and that there's nothing whatever you can do about it. But you would be wrong! At around the age of 5, a Papaung girl has heavy metal rings fitted around her neck, tightly between the chin and shoulders. Each year more rings are added and very, very slowly their weight pushes the shoulders down, in this way making the neck look longer. A Papaung woman will wear her neck rings all her life, never once taking them off.\nSo now I'm sure you will all agree that different people have different ideas about what is beautiful.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high7211.txt", "source_text": "A recent study of ancient and modern elephants has come up with the unexpected conclusion that the African elephant is divided into two distinct  species.\nThe discovery was made by researchers at York and Harvard Universities when they were examining the genetic relationship between the ancient woolly mammoth and mastodon to modern elephants -- the Asian elephant, African forest elephant, and African savanna elephant.\nOnce they obtained DNA sequences  from two fossils , mammoths,and mastodons the team compared them with DNA from modern elephants. They found to their amazement that modern forest and savanna elephants are as distinct from each other as Asian elephants and mammoths.\nThe scientists used detailed genetic analysis to prove that the African savanna elephant and the African forest elephant have been distinct species for several million years. The divergence of the two species took place around the time of the divergence of Asian elephants and woolly mammoths. This result amazed all the scientists. There has long been debate in the scientific community that the two might be separate species, but this is the most convincing scientific evidence so far that they are indeed different species.\nPreviously, many naturalists believed that African savanna elephants and African forest elephants were two populations of the same species, despite the elephants' significant size differences. The savanna elephant has an average shoulder height of 3.5 metres while the forest elephant has an average shoulder height of 2.5 metres. The savanna elephant weighs between six and seven tons, roughly double the weight of the forest elephant. But the fact that they look so different does not necessarily mean they are different species. However the proof lay in the analysis of the DNA.\nAlfred Roca, assistant professor in the Department of Animal Sciences at the University of Illinois, said, \"We now have to treat the forest and savanna elephants as two different units for conservation purposes. Since 1950,all African elephants have been conserved as one species. Now that we know the forest and savanna elephants are two very distinctive animals, the forest elephant should become a bigger priority  for conservation purposes.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high1514.txt", "source_text": "Dear Cary,\nI'm writing because I've understood you've struggled with alcoholism  .I've been fighting mine ever since I went through 9-11.After that, _ .I've taken some medicine and it has helped somewhat.I can manage about a month without drinking, but after that I end up having a crazy stage where nothing matters except drinking.After a week or so of heavy drinking,! start having nightmares of people jumping.After that, it's a week of not being able to get out of bed.\nI was supposed to travel to a conference but didn't make it because I got so drunk at the airport that I fell down on my face and spent the rest of the day in the emergency room.I have been hiding from my family since then.Fortunately they won't be expecting me to come back for a week or so.Otherwise, they would notice the bump on my forehead and two black eyes.\nI don't really know what I'm asking you.Cary, I need a way out that doesn't involve causing pain to my family.I'm taking medicine, but' I still have these attacks every few months.If there's alcohol in the house, I can't stay away from it.It seems that this will never end.I'm afraid of what will happen if something bad happens, like a family member dying, or getting fired again.\nThanks for reading.\nYours T", "split": "train", "level": "", "topic": "Present Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high5151.txt", "source_text": "A new report says African governments are ill prepared to handle the growing number of people over age 65. The population in Africa  as in other parts of the world, is getting older. Currently, there are 36 million people on the continent 65 years and above. which is 3.6 percent of the population. up from 3.3 percent 10 years ago. That could rise to 4.5 percent by 2030 and 10 percent by 2050. The African development Bank is raising concerns over the shortage of health insurance and pensions  .\nThe African Development Bank says. \"Aging is highly linked with long-term physical and mental  disability and a number of long-term chronic   conditions.\"\n\"Africa is not well prepared to care for its aging population right now. And it needs to prepare for this fact.\" said Professor Mthuli Ncube. the African Development Bank's chief economist. African nations spend far less on healthcare than developed nations do _  about $26per person per year. Not so many countries have well developed medical aid plans for the elderly, whether they are privately provided plans or indeed government plans. If you look at the pension plans, you will find the pension industries are not well developed in some of the countries.\nProfessor Mthuli Ncube said African governments failed to take action on health insurance\nand pensions because they were busy with economic reforms.\nAnother challenge for Africa is the worsening of informal systems of social protection. That is cash and support from both the extended family and community sources.\n. The African Development Bank recommends governments help carry out health insurance and pension plans. Ncube said African governments didn't have to handle the health insurance burden alone. \"It is not only a must but also an opportunity for private companies to add their bit in this regard\", he said. The report also recommends that African governments consider providing ways of free health services. medications and long-term health care facilities for the elderly.", "split": "train", "level": "", "topic": "Reporting verbs", "topic_category": "reported_speech"}
{"id": "high12630.txt", "source_text": "You surely want to take a good school yearbook photo, for you only get to do it once, and it's what people remember you by for the whole school year. Learn how to look good and look natural in your yearbook photo with these simple tips.\n1. Practice smiling in a mirror. It sounds crazy, but figuring out how to make a natural looking smile for the camera does need a little preparation. Don't be shy! Just imagine you are in front of a camera --hold your head high, look straight into the mirror and smile. Keep practicing until you find out your most attractive smiling face.\n2. Choose your color wisely. In yearbook photos, lots of people look good in darker colors because they draw attention to the face. Generally, white often isn't the best choice because it can make your skin look a bit gray, especially if you're pale. Besides, stay away from super -bright colors ( bright yellow, bright blue) unless you're really sure they make you look perfect.\n3. Avoid unnecessary details. Busy patterns draw attention to themselves in yearbook photos, not to your face and smile. Save them for your everyday fashion experiments. Besides, have your clothes prepared for the day when the yearbook photo is taken. The last thing you want to do is pick out the perfect thing to wear, only to find that it's in the laundry.\n4. Avoid big changes to your appearance. Big changes may not turn out the way you hope. Leave some time to do your hair, such as combing  it up right before the yearbook photo is taken. Don't overdo it, since you want your hair to stay in one place and your face to draw all the attention, but go for the \"less is more\" approach.", "split": "train", "level": "", "topic": "Verb patterns (advise sb to…, make/let + bare inf…)", "topic_category": "gerunds_infinitives"}
{"id": "high11021.txt", "source_text": "If you give something to someone for free, will that person value it and use it? Development experts have debated this question for decades. Some think the act of paying causes people to value something and use it more.\nSelling necessary health treatments, others argue, may deny them to the people who need them the most.\nConsider, for example, chemically treated bed nets, which kill mosquitoes anti protect people against malaria while they are sleeping. William Easterly, an economist at New York University, believes this is one example of development having gone wrong. In a recent book, Professor Easterly suggests bed nets given free in Africa are often used for the wrong purpose. Yet, the World Health Organization (WHO) recommends bed nets be given out free and used by whole communities. The success of a large free bed net campaign in Kenya led the WHO to announce this recommendation\nThis debate will likely influence social programs in the developing world. Many non-governmental organizations support the creation of self-supporting programs in poor countries. Goods and services are sold for a price to help these programs survive.\nAccording to Rachel Glenerster, who runs a research lab doing development and poverty studies at the Massachusetts Institute of Technology, her several studies have proven that small price changes have a big influence on the number of people who use a product. A price change will reduce the total amount of use of the product as well, she says. She has also found no evidence that the very act of paying for something changes how people use it.\nAs for a particular product among special populations, some development experts argue that pricing is useful. When it comes to bed nets, Miss Glenerster says research shows no evidence of this. People are just as likely to use a bed net whether they paid for it or not.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high9119.txt", "source_text": "China has now mapped out plans for its next four launches in the Shenzhou program on the next flight. But one conclusion seems to have escaped most reports in the aerospace media. The flight of Shenzhou 7 could be timed to coincide with the Beijing Olympics. Plans for the 2008 Summer Olympics call for the events to be held between the 8th and 24th of August. It's reasonable to expect that China will use the event to promote its achievements before the world, and human spaceflight is China's most significant recent breakthrough.\nShenzhou 7, China's next manned space mission, was originally advertised for 2007. This fit into the pattern of staging a two-year gap between crewed Shenzhou missions, which have previously launched in 2003 and 2005. But Chinese media statements have recently _ this to 2008. Chinese media have reported that while the overall program is going well, more time is needed to work on the spacesuit that will be used on this flight to stage China's first spacewalk. It's possible that Chinese engineers want to make best preparations for this complex mission.\nChina could intend to carry out the mission of Shenzhou 7 just as media attention is focused on the lead-up to the Olympics. The crew of the flight, and possibly China's other flown astronauts, could then take part in the opening ceremony. China has previously feted her space travellers in great celebrations, such as the Hong Kong event that saw Yang Liwei singing with actor Jacky Chan.\nChina has also suggested that the activity will be carried out by a single astronaut, and has indicated that half an hour is a rough estimate of the planned time for the spacewalk. China is apparently following suit, probably for the same reasons of conservative mission planning and safety.", "split": "train", "level": "", "topic": "can/could", "topic_category": "modals"}
{"id": "high10899.txt", "source_text": "American farmers are raising five percent more goats for meat these days.\nGoat meat is high in protein and lower in unhealthy fat than many other meats.Even so,the industry is small compared to chicken,beef and pork. But immigration has brought more of a taste for goat to America from all over the world.\nExperts from the University of Illinois offer some questions for people to consider if they are thinking about raising goats.\nFirst of all,do you understand that there always has to be someone to care for the goats?\n*How much land do you have available? And how good is it? Poor ground may support two to four goats on half a hectare.Better grassland can support six to eight. If goats and cattle share the land,two goats can be added for each cow. The goats will eat weeds and other plants that cattle do not like.\n*Do you have buildings for the number of female goats you plan to keep during winter? An open,cold,dry barn is better than a closed,warm barn where the air is wet.\n*Do you have the equipment to clean barns  and to harvest hay  to feed your goats? Or will you get someone else to do it,or buy the hay?\nThe experts say a profitable business in goat meat may take three to five years to establish.And, of course, there are no guarantees .", "split": "train", "level": "", "topic": "Direct vs Indirect questions", "topic_category": "questions_special"}
{"id": "high10449.txt", "source_text": "Young visitors to museums often complain about having museum feet,the\ntired feeling one gets after spending too much time in a museum.A case of museum feet\nmakes one feel like saying:\"This is boring.I could have done the painting myself.\nWhen can we sit down? What time is it?\nStudies of museum behavior show that the average visitor spends about four seconds looking at one object.For young visitors,the time call be even shorter.Children are more interested in smells,sounds,and the \"feel'' of a place than looking at a work of art.If they stay in a museum too long,they will feel tired and become impatient.\nTo avoid museum feet,try not to have children look at too many things in one visit.It is reported that young visitors get more out of a visit if they focus on no more than nine objects.One and a half hours is the ideal time to keep their eyes and minds sharp,and their feet happy.", "split": "validation", "level": "", "topic": "First Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high5587.txt", "source_text": "New research suggests that speaking more than one language may delay different kinds of dementia , that is the loss of mental ability. In fact, researchers say, speaking two languages appears to be more important than the level of education in defending against dementias.\nA study in India examined the effect of knowing more than one language in delaying the first signs of several dementias. Researchers studied nearly 650 people whose average age was 66. 240 of those studied suffered from Alzheimer's, the most common form of mental decline . 391 of the _ spoke two or more languages. Researchers found the dementias began about four-and-a-half years later in those who spoke two languages compared to those who spoke only one language. The level of education had no effect on the age at the first sign of dementia.\nThomas Bak, from the Center of Cognitive Aging at the University of Edinburgh in Scotland, who helped to organize the study, suggests that individuals who speak more than one language train their brains by moving back and forth between different words and expressions. He also believes this effort improves what scientists called executive  functioning, which often weakens in people with dementias. He states that researchers found there was no extra gain in speaking more than two languages.\nMr Bak says it does not appear important whether you learn another language at a young age or later in life. It's not something that \"you missed the boat when you do not do it as a baby.\" It is something that is still quite useful and powerful when you do it as an adult.", "split": "train", "level": "", "topic": "Reporting verbs", "topic_category": "reported_speech"}
{"id": "middle2531.txt", "source_text": "Do you like dogs? Do you know the following things about dogs?\nThe first pet dog\nDogs are meat-eating animals. They belonged to the family of wolves   a long time ago. About 15,000 years ago, people started keeping wolves for hunting  . Over the time, the wolves began to look like dogs and they became people's pets.\nWhat a dog looks like\nDogs come in different sizes, colors and shapes, but they're the same in some ways. All kinds of dogs have a set of forty-two strong teeth for eating. They have sharp claws   at the end of their feet for digging up soil   and holding onto the ground when they walk. They have very good eyesight. They also have high ability   to hear and smell.\nHow a dog grows\nA mother dog gives birth to one to twelve babies at a time. New-born baby dogs cannot see or hear until they are two weeks old. The mother dog gives the baby dogs milk. When they are four weeks old, they start eating soft food. When they're eight weeks, the baby dogs have very strong legs and they can go for long walks.\nHow to read a dog's feelings\nDogs act differently when they have different feelings. When a dog is angry, it opens its mouth and shows its teeth. When a dog is frightened, it lowers its ears and holds its tail   between its legs. A happy dog always wags   its tail.\n,. (10)", "split": "train", "level": "", "topic": "Zero Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high6304.txt", "source_text": "On Oct4,2011 , I phone 4s made its international appearance at the press conference claimed by the Iphone cooperation . Ever since then , Iphone4s has become _ and even made a fashion around the globe. Meanwhile , many new expressions come about in relationship with this type of high-tech products. \"Jailbreak\" is one of them.\n\" Jailbreak\" means to unlock the operating system of a mobile phone or other device so that it can run software which it is not normally authorized to use because of restrictions imposed  by the device's manufacturer.\nIf someone jailbreaks a smartphone, tablet computer or other device , they use a special piece of software in order to remove the restrictions imposed by the manufacturer on the kind of applications that can be downloaded and run on the device. The concept of jailbreaking is most often associated with products from Apple Inc, such as the iPhone, iPod and iPad, which routinely restrict the user to applications licensed exclusively  by Apple and purchased via its App Store. As well as wanting to lift the restriction  on what kinds of applications they can purchase, those who jailbreak often do so as a reaction against what they consider as a form of censorship  imposed by Apple Inc in only allowing the use of their 'approved' apps.\nThe concept of jailbreaking dates back to July 2007, when it was applied to the iPhone within a month of the device's first release. This first occurrence related to the adding of custom ringtones , but the idea quickly developed as a means to lift the restriction and equip the phone with games and other applications not licensed by Apple Inc.", "split": "train", "level": "", "topic": "Reduced relative clauses", "topic_category": "relatives_participles"}
{"id": "high827.txt", "source_text": "Have you ever wondered why the roots of the plants always know which way to grow--into the soil but not above it? Some British scientists have recently solved this mystery.\nIt turns out that roots have special hairs that tie them into the soil and help them grow their way past obstacles, a team at the John Inners Center in Norwich reports in the February 29 issue of Journal Science.\n\"The key is in the fuzzy coat of hairs on the roots of plants,\" says professor Liam Dolan. \"We have found a growth control system that enables these hairs to find their way and to become longer when their path is clear.\"\nRoot hairs explore the soil in much the same way a person would feel their way in the dark. If they come across an obstacle, they make their way around until they can continue growing in an opening. In the meantime, the plant is held in place as the hairs grip the soil.\nThe hairs are guided by a clever chemical trick. A protein  at the tip of the root hairs called RHD2 helps them to take calcium  from the soil. Calcium makes the hairs grow, and produce more RHD2, and take more calcium.\nBut when an obstacle blocks the hair's path, or the hair reaches the surface of the soil, the cycle is broken and growth starts in another direction.\nThis system gives plants the flexibility to explore a complex environment and to live in even the most unpromising soils, says Dolan.\nIn poor soils such as in parts of Australia and Africa, native plants have adapted by producing enormous numbers of root hairs. A better understanding of this adaptation will allow scientists to develop hairy rooted crops that can grow in unfriendly environments.\nAccording to Dolan, \"Research in the John Inners Center is taking a breeding approach to increase hair length in wheat but it will be some time before new cultivars  are developed.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle7915.txt", "source_text": "Today is fine. The sky is blue, Now it's nine o'clock in the morning. There's a sports meeting in the forest on the big mountain. Look,a horse, a panda and a cat are running. Over there a dog and two tigers are jumping. Two monkeys are climbing the trees. Four birds are flying around and singing. There are some other animals there, too. The elephants are standing. A monkey is sitting on an old elephant. The monkey has a flag in his hand. Polly is sitting in the tree. A fox, a baby panda and some small animals are sitting under the tree. They are all watching.", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "high8108.txt", "source_text": "Have you ever done something foolish that made you feel so embarrassed ?\nWell, that's exactly how I felt. On a Saturday morning last autumn.I had gone to town to do some shopping and as I was on my way home,it suddenly began to rain. I at once ran into a nearby phone box because I didn't have an umbrella.It was raining so heavily that I have to stay in the phone box until it stopped.\nA few moments later,I saw a young man walk up to the phone box,wearing a yellow raincoat and holding a box. I didn't want to go out into the rain,so I picked up the phone and pretended  I was talking to someone. I thought the man would go away,but he didn't. He just waited in the rain,watching me. I had to wave my hands about and acted as if I was deep in conversation.\nLuckily,it began to stop after about ten minutes.\"Okay,Mum,\" I said loudly into the phone,\"I'll see you later Bye!\" I put the phone down, picked up my shopping bag and walked out of the phone box \"I'm sorry I took so long,\"I said to the man.\n\"Oh, I don't want to use the phone,\"he replied, smiling.\"I've just come to repair it. It's out of order.you see.\" I felt myself go red in the face and I hurried away with my head down,feeling a complete fool. That was certainly one of the most embarrassing moments of my life!", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle7326.txt", "source_text": "Alice: Good morning, Bob.\nBob: Good morning, Alice.\nAlice: Bob, this is Grace.\nBob: Hi, Grace.\nGrace: Hi, Bob.\nAlice: Oh, what is that?\nBob: It's my green key.\nAlice: What's this?\nBob: It is a ruler.\nAlice: Is it your   ruler?\nBob: No. My ruler is red. This ruler is blue.\nAlice: Grace, is it your ruler?\nGrace: Oh no. It is Frank's ruler.\nAlice:40 .", "split": "train", "level": "", "topic": "this/that/these/those", "topic_category": "articles_determiners"}
{"id": "high11635.txt", "source_text": "Dad came in the midnight. We heard every sound, but we pretended to be asleep.\nNext morning he looked weak and thin, sitting in a chair by the kitchen fire. The light of the fire shone through his long empty sleeve. Everything went as usual. Grandma found something to do in the bedroom. Grandpa went out for some water. Mother, with her back to us, was getting the cakes ready for breakfast.\nBut nothing was right. When grandma came out of the bedroom, she walked on tiptoe. When grandpa came back, he said nothing about the weather. At breakfast Mother passed us the fruit and said something, but her voice was too high.\nAt last my sister, Lou, pushed back her chair. \"It's your turn to wash the dishes.\" But I had washed the dishes the night before. I said nothing because it was not right to quarrel in front of Dad just home with the empty sleeve.\n\"It is your turn,\" Lou said again. I looked at her in surprise.\n\"It is not,\" I said because I suddenly remembered Mother had told us to go on as usual.\n\"Children, children,\" Mother said in a quiet, glad kind of voice.\nAnd Dad was smiling because he felt at home at last.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high4296.txt", "source_text": "Loren Gladstone of Toronto is 58, but thinking over how to bequeath   his digital property . Doing the paperwork after his parents' death was a challenge. \"When my time comes, I wonder if my children will even know what paper is,\" he says. As a software developer, his virtual property is both valuable and vital to his business. That reflects a problem. Online lives have increasing economic and emotional value. But testamentary   laws offer confusing and incomplete ways of bequeathing and inheriting   them.\nDigital property may include software, websites, downloaded content, online gaming identities, social-media accounts and even e-mails. In Britain alone holdings of digital music may be worth over PS9 billion ($14 billion). A fifth of respondents to a Chinese local-newspaper survey said they had over 5,000 yuan($790) of digital property. And value does not lie only in money.\"Anyone with kids under 14 years old probably has two prints of them and the rest are in online galleries,\"says Nathan Lustig of Entrustet, a company that helps people manage digital property.\nService providers have different rules--and few state them clearly in their terms and conditions. Many give users a personal right to use an account, but nobody else, even after death. Facebook allows relatives to close an account or turn it into a memorial page. Gmail (run by Google) will provide copies of e-mails to an executor  . Music downloaded via iTunes is held under a license which can be abolished on death. Apple declined to comment on the record on this or other policies. All e-mail and data on its iCloud service are deleted on the death of the owner.\nThis has led to cases to court in America. In 2004 the family of Justin Ellsworth, an army man killed in Iraq, took Yahoo! to court in Michigan to get copies of his e-mails. This year, a court in Oregon ruled that another American mother whose son had died could use her dead son's password to enter his Facebook account for a short period. Now five American states have made laws giving executors control over the social-networking accounts of dead users.\nBut this raises the subject of privacy. Passing music on is one thing; not everyone may want their relatives to read their e-mails. Colin Pearson, a London-based lawyer, says access should come only with a clear provision in a will.\nBut laws, wills and password safes may be contrary to the providers' terms of service, especially when the executor is in one country and the data in another. Headaches for the living and lots of lovely work for lawyers.", "split": "train", "level": "", "topic": "Participle clauses (V-ing/V-ed)", "topic_category": "relatives_participles"}
{"id": "middle513.txt", "source_text": "John is my best friend. We live in the same building. We study in the same school but not in the same class. We often play football together after school. We have been good friends for two years.\nJohn is tall and strong with black hair. He has a round face, a small nose and big, brown eyes. I like his eyes because they are always bright and smiling.\nJohn is always friendly and helpful. When I feel bored or unhappy, he tells me funny jokes and makes me laugh. He'll give me help when I need.\nJohn is very smart. He reads a lot of books. He is good at singing and acts very well. He would like to make people happy with his songs and performance when he grows up. I believe that he can become as popular as Jackie Chan and travel around the world in the future.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high19743.txt", "source_text": "The advantages of an international language in the modern world are obvious. Thanks to modern methods of transport, we can travel everywhere more easily and more quickly than ever before, but the language problem still remains. Without a common language, there may be misunderstandings between people of different countries. There are two possible solutions to this problem: either we choose one of the main living languages of the world, or we make up an artificial  one. But neither solution is simple because no living language will be acceptable to everyone and because an artificial language, such as Esperanto, has no culture and would be thought boring by many learners.\nIt is often said that English is quickly becoming a world language. It is certainly the most widely used language in the world, and second only to Chinese in its number or native speakers, but there are certain worries of choosing English as an international language.\nFirst of all, for political reasons and national pride, English is not acceptable to everyone as a world language. Many dislike its influence. English words enter their language and this often threats their own language. In France, a new word \"frangla is\" has been invented to describe the results. Although English is being taught in more and more schools abroad, the process is not always popular. Not every nation is prepared to accept the leading position of English in their education system", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high2100.txt", "source_text": "Signs in Chinese will be set up in public areas such as airports, to benefit Chinese travelers, the Italian Government announced in late February. _ .\nDespite the different languages, travel across Europe has never been so simple. Just five years ago, if you wanted to visit Germany in the north and Spain in the south in one trip, you had to wait for weeks to apply for different visas from the two countries. You also needed a calculator because both countries had different money.\nToday, with a Schengen Visa issued by any member country, you can travel across 15 European countries without stopping. Since 2002, within most of the EU, there is now just one type of money called the Euro. The Euro was designed to be the only money in the EU, and already makes it easier to shop around. If you drive, your driving license and car insurance policy are valid in the other European countries. And you can use your mobile phone everywhere.\nAll the countries in the continent are melting into a united Europe under the EU. For Europeans and visitors, the result is that it is more convenient to travel back and forth between the different countries.", "split": "train", "level": "", "topic": "Used to", "topic_category": "tenses_aspects"}
{"id": "high16625.txt", "source_text": "One of the serious problems for today's society is who should be responsible for the old and how to improve their lives. It is not only a financial problem but also a question of the system we want for our society. I would like to suggest several possible solutions to this problem.\nFirst,employers should take the responsibility for their retired employees. To make this possible,a percentage of profits should be set aside for this purpose. But when a company must take lifelong responsibility for its employees,it may suffer from a commercial disadvantage due to higher employee costs.\nAnother way of solving the problem is to return the responsibility to the individual. This means each person must save during his working years to pay for his years of retirement. This does not seem a very fair model since some people have enough trouble paying for their daily life without trying to earn extra to cover their retirement years. This means the government might have to step in to care for the poor.\nIn addition,the government could take the responsibility for the care of the old. This could be financed through government taxes to increase the level of pensions. Furthermore,some institutions should be created for senior citizens,which can help provide a comfortable life for them. Unfortunately,as the present situation in our country shows,this is not a truly viable answer. The government can seldom afford to care for the old,particularly when it is busy trying to care for the young.\nOne further solution is that the government or social organizations establish some workplaces especially for the old where they are independent.\nTo sum up,all these options have advantages and disadvantages. Therefore,it is reasonable to expect that some combination of these options may be needed to provide the care we hope to give to the old generations.", "split": "train", "level": "", "topic": "should/ought to", "topic_category": "modals"}
{"id": "middle6291.txt", "source_text": "Although people everywhere seem to enjoy drinking coffee, they don't all have the same coffee culture. In Europe, for example, coffee shops are common places for people to meet friends and to talk while they drink coffee. On the other hand, places like this were not as common in North America in the past. Instead, people in North America liked to drink coffee in their homes with friends. The coffee culture in the USA changed when Starbucks  coffee shops spread across the country.\nThe first Starbucks coffee shop opened in 1971 in downtown Seattle, Washington, in the USA. It was a small coffee shop that cooked its own coffee beans. The coffee shop's business did well, and by 1981 there were three Starbucks stores in Seattle.\nThings really began to change for the company in 1981.That year, Howard Schultz met the three men who _ Starbucks. Schultz worked in New York for a company that made kitchen equipment. He noticed that Starbucks ordered a large number of special coffee makers, which caused his great interest. Schultz went to Seattle to see what Starbucks did. In 1982, the original Starbucks owners hired Schultz as the company's head of marketing .\nIn 1983, Schultz traveled to Italy. The special environment of the espresso( ) bars there caught his eyes. Back in the USA, Schultz created an environment for Starbucks coffee shops that was comfortable and casual, and customers everywhere seemed to like it. Starbucks began opening more stores across the USA. Then the company opened coffee shops in other countries as well. Today, there are more than 16,000 Starbucks coffee shops all over the world.\nHowever, that does not mean Starbucks has not had problems. In fact, many Starbucks stores have closed over the past few years. On the one hand, this is because there were too many coffee shops competing for business in one small area. On the other hand, stores in some countries closed because the coffee culture there did not match with the \"feel the same everywhere\" environment offered by Starbucks.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high10699.txt", "source_text": "Student Services\nStudents' Union\nEvery University has a Students' Union. If students are the lifeblood of a university, the Union is surely its beating heart.\nFor students, by students\nA Students' Union is run by students and acts independently. At the end of each academic year, it will find six students to hold a sabbatical  position managing the Union for the coming year. That the six successful sabbatical officers have only recently experienced issues affecting students ensures that your needs are very well understood.\nLetting your hair down\nAlthough the University is spread across a fairly wide area, the Union is centrally located and is only a short walk from any of the main buildings. This makes it very easy to catch up with friends who might be on a different course.\nAt night, the place really comes alive - we have three different bars to suit every occasion. The venues are student-only so you can be sure of meeting people with a similar outlook and we throw in a transport service to make sure you get home safely.\nThe Union also organizes various formal balls throughout the year, with the highlight being the end-of-year ball.\nSupporting you\nBeyond having fun, we also make sure some of the more serious issues are effectively dealt with. If you have a problem with your course, another sabbatical officer is trained to help you. Being independent from the University means we can represent and support you to the best of our ability, and once you reach university you may find that you become aware of more national or political issues.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "middle67.txt", "source_text": "Mike  and  his  father  are  sitting   at   the  table . They are having their lunch. \" I  don't  like  this  soup  .  I  don't  want  to  have  it\" ,  says  Mike .  After  lunch ,  Mike  and  his  father  work  on  the  farm .  They work hard. In  the  evening ,  Mike's  father  gives  him  a  bowl  of  soup . \"Oh, this soup is nice \", says Mike.  His mother says: \"It's the same soup.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle2893.txt", "source_text": "Once my father asked me to hold his hammer while he repaired something, so we could have some time to talk to each other.\nFor 22 years, after I left home for college, he called me every Sunday at 9 am. He was always interested in my life and how my family was doing, and I never once heard him complain about his own life.\nNine years ago when I bought my first house, my father, 67 years old, spent eight hours a day painting it for three days. He would not allow me to pay someone to have it done. All he asked for was a glass of iced tea and for me to hold a paint brush for him and talk to him. But I was too busy.\nFive years ago, at age 71, my father spent five hours putting together a swingset   for my daughter. Again, all he asked was that I get him a glass of iced tea and talk to him. But again, I was too busy.\nFour years ago, my father drove all the way from Denver to Topeka, with an eight-foot Colorado blue spruce   in his trunk, so that my husband and I could have a part of Colorado growing on our land. I was preparing for a trip that weekend and couldn't spend much time with him.\nThen, one day, my father telephoned me as usual, this time from my sister's home in Florida. We talked about the tree he had brought me, \"Fat Albert\", but that morning he called it \"Fat Oscar\", and he seemed to have forgotten some things. I had to get to church, so I cut the conversation short.\nThe call came at 4:40 pm that day: my father was in hospital in Florida with an aneurysm  . I got on a plane immediately, and on the way I thought of all the times I had not taken the time to talk to my father. I realized that I had no idea who he was or what his deepest thoughts were. I promised that when I arrived, I would make up for lost time.\nI arrived in Florida at 1 am. My father had passed away at 9:12 pm. This time it was he who did not have time to talk to me.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high11457.txt", "source_text": "Accidents happen, but when they destroy the delicate balance of nature and cause the whole world to suffer, they become disasters, and we  should do all we can to prevent them from happening again.\nBhopal chemical leak, December 1984, Bhopal, India\nAn explosion in the Union Carbide chemical plant in Bhopal, India, released a deadly gas called methyl   isocyanate , which is used to make pesticides. The gas formed a cloud that killed 2500 people; another 50000- 100000 people became ill. Trees and plants in the area became yellow and brittle. The explosion was caused by a mechanical failure that was not noticed in time to stop it.\nExxon Valdez oil spill, March 1989, Alaska, U.S.\nOn March 24, 1989, 11 million gallons of crude oil spilled into Prince William Sound from the tanker Exxon Valdez when its hull hit a reef and tore open. The oil, which is not yet cleaned up after billions of dollars have been spent and the millions of birds, fish, and other wildlife have died, was caused by human error and could have been avoided.\nChernobyl, April 1986, USSR\nAt 1:23 A.M. on Saturday, April 26, 1986, the reactor blew at nuclear power plant in Chernobyl, ripping open the core, blowing the roof off the building, starting more than 30 fires, and allowing radioactive material to leak into the air. Some 31 people were killed and 200 people were treated for radiation poisoning. Still at risk are 135000 people from the 179 villages within 20 miles, of the plant who were exposed to the radiation before being evacuated. Glaring violations of safety rules were at the bottom of this tragic event.\nLove Canal, 1953, New York, U.S.\nLove Canal, a small town in upstate New York near Niagara Falls, was destroyed by waste from chemical plants. Beginning in 1947, chemical companies could legally dump their waste products into the canal. The area developed a foul smell, trees lost their bark, and leaves fell throughout the year. A health survey found that the drinking water contained excessive levels of 82 industrial chemicals, 7 of which were thought to cause cancer. The people of Love Canal had an unusually high rate of cancer and birth defects. Eventually, many of the houses had to be abandoned. Today, the town has been partly cleaned up and some families have moved back to the area.\nThree Mile Island, 1979, Pennsylvania, U.S.\nOn March 28, 1979, the worst accident in U.S. nuclear reactor history occurred at the Three Mile Island power station, near Harrisburg, Pennsylvania. No one was killed, and very little radioactivity was released into the air when coolant (the fluid that keeps a machine cool) escaped from the reactor core due to a combination of mechanical failure and human error. After 10 years and $ 1 billion in cleanup costs, the lower extremes of the reactor are still so radioactive that workers must use remote - control equipment to remove the remaining fragment of fuel core.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high22119.txt", "source_text": "\"I've changed my mind.I wanted to have a telescope,but now I want my daddy back .\" Lucien Lawrence's letter to Father Christmas written after his schoolteacher father had been knifed to death outside his school gate ,must have touched every heart.Lucien went on to say that without his father he couldn't see the stars in the sky.When those whom we love depart from us , we cannot see the stars for a while .\nBut Lucien , the stars are still there, and one day, when you are older and your tears have gone , you will see them again. And in a strange way, I expect that you will find your father is there too , in you mind and in your heart .I find that my parents , long dead now , still figure in many of my dreams and that I think of them perhaps more than I ever did when they were alive . I still live to please them and I'm still surprised by their reactions.I remember that when I became a professor, I was so proud,or rather so pleased with myself ,that I couldn't wait to cable my parents . The reply was a long time in coming , but when it did , all Mother said was\"I hope this means that now you will have more time for the children!\" I haven't forgotten .The values of my parents still live on .\nIt makes me pause and think about how I will live on in the hearts and minds of my children and of those for whom I care .Would I have been as ready as Philip Lawrence have been to face the aggressors  , and to lay down my life for those in my care ? How many people would want me back for Christmas ? It's a serious thought , one to give me pause .\nI pray silently , something , in the dead of night , that ancient cry of a poet \" _ ), and my darling form the power of the dog .\"Yet I know that death comes to us all , and sometimes comes suddenly. We must therefore plan not to live forever , but live as if we will die tomorrow. We live on, I'm sure, in the lives of those we loved , and therefore we ought to have to care for what they will remember and what they will treasure . If more parents knew this in their hearts to be true , there might be fewer knives on our streets today .", "split": "train", "level": "", "topic": "Second Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high21080.txt", "source_text": "Newspapers in the United States earn most of their money from selling space for advertising. The rates they charge are tied to the number of readers. But the number of people who buy newspapers has been falling for years. And this traditional business model had not worked very well on the Internet, especially in a bad economy.\nMany newspaper companies have large debts from buying other papers. Some papers have recently closed or declared bankruptcy or reduced their operations. \nNewspapers are looking for new ways to reinvent themselves and new ways to earn money. That includes giving new consideration to an old idea-charging for at least some of the material that most papers now publish online for free.\nInternet access to newspapers means that more people may read the news, which is good for society. But good reporting costs money. The question is how much people are willing to pay for news that they have got used to receiving for free.\nThe look of American newspapers changed after USA Today arrived in 1982. Most of the stories were short. There was heavy use of color1 and images. People who compared it to television did not necessarily mean that as praise. But the new design succeeded and influenced many other papers.\nNow newspapers are looking to redesign themselves for an increasingly online world. Millions of people would rather read papers like USA Today and The New York Times for free on the Web than pay for a printed version. Publishers who chose that business plan might regret it now, but they might not have had much choice. Survival means changing as conditions change. Like any other business, newspapers have to balance their needs with the need of their customers.", "split": "train", "level": "", "topic": "Present Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high12487.txt", "source_text": "Most schools forbid chewing gum, but in a few years they might consider changing that rule. Why? Scientists are finding evidence that gum chewing may be good for your health. It may even help improve your test scores.\nThis exciting research is just beginning. And in the meantime, companies are also experimenting with adding vitamins, minerals, medicines, and other substances that could give gum the power to cure headaches and fight everything from serious diseases to bad breath.\nOther researchers are finding that gum might work better than a pill to deliver medicines and other substances into the bloodstream. That's because the lining   of our cheeks can absorb certain substances more quickly than our stomachs and intestines   can.\nThat discovery could help other researchers develop medicine-containing gums that fight colds, ease headaches, battle nervousness, and more. Scientists might even create antimicrobial   gums that cure bad breath.\nThose projects may take years, but gum scientists have already had at least one recent success: They've created a gum that could help us stay awake.\nResearchers have produced a gum called Stay Alert. Each stick has as much caffeine as a cup of coffee. It can take an hour for the caffeine in coffee to have its full effect, but the caffeine in Stay Alert _ in just a few minutes.\nThe gum is easy to transport and it's stable in cold and hot climates. Unlike a pill, it doesn't require water to swallow. Those qualities make it easy for soldiers to use.\nFor now, Stay Alert is available only to the military  . The manufacturer may one day offer it for sale to the public. People who work at night, such as truck drivers and medical personnel who ride in ambulances, might benefit from a product like Stay Alert.", "split": "train", "level": "", "topic": "may/might", "topic_category": "modals"}
{"id": "middle1120.txt", "source_text": "It is the 22ndcentury  and it is very popular to change people's bodies.\nMr. Smith decided to change his body. He changed his big nose to a small one, and his old and gray hair to short and blond hair. He also bought new green eyes, new hands, new arms, new knees and new feet. Mrs. Smith was happy because Mr. Smith's new feet didn't smell as bad as his old feet.\nHowever, something bad happened. One morning, Mr. Smith woke up and his new nose didn't work. The next morning he couldn't hear anything. Then his new blond hair went gray, and his new knees didn't move. And finally he could see nothing with his green eyes.\nIt was really terrible. Mr. Smith wanted his old body back. However, he had to pay 100,000 euro  for his old body.\nIt was expensive but Mr. Smith still got his own body back. He would never follow the fashion.\n,,(5)", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle4873.txt", "source_text": "Suzhou is an old city with a long history. The city is very clean and has fresh air. There are a lot of nice gardens in Suzhou and Suzhou gardens are famous in the world. When you enjoy the beauty in the gardens, you will feel very peaceful   and happy. Besides (......) the gardens, Suzhou silk is also very famous. On the streets, you can see many silk shops. You should buy some beautiful silk scarves because they are really beautiful. Suzhou food is so sweet and some people may not like it. But you can have different kinds of foods here. Suzhou is close to Shanghai. It takes about only one hour from Suzhou to Shanghai by bus. The traffic is very convenient   here. Welcome to Suzhou! You will have a good time here.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high5091.txt", "source_text": "For eighty four days old Santiago had not caught a single fish. At first a young boy, Manolin, had shared his bad fortune, but after the fortieth luckless day the boy's father told his son to go in another boat. From that time on, Santiago worked alone. The boy loved the old fisherman and always helped him with money and food. Usually, they would talk about the fish they had taken in luckier times or about American baseball after supper, while at night, alone in his cottage, Santiago dreamed of lions on the beaches of Africa, where he had gone years before. _ \nOn the eighty-fifth day, Santiago set off to fish before dawn. Two of his baits  were fresh tunas  the boy had given him, as well as sardines  to cover his hooks. Then he set his lines which went straight down into deep dark water.\nAs the sun rose he saw other boats in toward shore. A bird showed him where dolphins were chasing some flying fish. This time Santiago saw tuna jumping in the sunlight. A small one took the hook on his line. Pulling the fish aboard, the old man thought it a good fortune.\nToward noon a marlin, a common fish in the sea, started eating the bait which was one hundred meters down. Gently the old man played the fish, a big one, as he knew from the weight on the line. At last he struck to settle the hook. The fish did not come out of the surface. Instead, it began to pull the boat to the northwest. The old man followed it. _ \nIt was cold after the sunset. When something took one of his remaining baits, he cut the line with his knife. Once the marlin leaned suddenly, pulling Santiago forward on his face and cutting his cheek. By dawn his left hand was cramped . The fish had headed northward; there was no land in sight. Hungry, he cut pieces from the tuna and chewed them slowly.\nThat morning the fish jumped. Seeing it, Santiago knew he had hooked the biggest marlin he had ever seen. Then the fish went down and turned toward the east. Santiago drank a little water from the bottle during the hot afternoon.\nClose to nightfall a dolphin took the small hook he had rebaited. He lifted it aboard, careful. After he had rested, he cut meat from the dolphin and kept also the two flying fish he found in its stomach. That night he slept. He awoke to feel the line running through his fingers as the fish jumped. Feeding line slowly, he tried to tire the marlin. After the fish slowed its run, he washed his cut hands in sea water and ate one of the flying fish. At sunrise the marlin began to circle. Faint, he worked to bring the big fish nearer with each turn. _ The fish was two feet longer than the boat. No fish like it had ever been seen in Havana harbor.\nAn hour later, he sighted the first shark, a fierce Mako, and it came in fast to chase after the dead marlin. The old man struck the shark with his harpoon. The Mako rolled and sank, carrying the harpoon with it and leaving the marlin bloody. He knew the smell would spread. Watching, he saw two sharks closing in. He struck at one with his knife and watched it sliding down into deep water. The other he killed while it tore at the flesh of the marlin. When the third appeared, he thrust  it with the knife. The other sharks came at sunset. At first he tried to beat them with the tiller  from the boat, but his hands were bleeding and there were too many in the sea. In the darkness, as he steered toward the harbor of Havana, he heard them hitting the boat again and again. But the old man thought only of his steering and his great tiredness. He had gone out too far and the sharks had beaten him. He knew they would leave him nothing but the stripped skeleton of the big marlin.\nAll lights were out when he sailed into the little harbor and beached his boat. He could just make out the white backbone and the upstanding tail of the fish. _ In his cottage he fell on his bed and went to sleep.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle1750.txt", "source_text": "A young man from a village called Nawalapitiya married a young woman from Maiyuwa, a small village. They lived with the man's big family-his parents, his brothers, their wives and children. The family kept an elephant, in which the woman soon took a great interest. Every day she fed it with fruit and sugar.\nThree months later, having quarreled with her husband, the woman went back to her parents' home. Soon the elephant refused to eat and work. It appeared to be ill and heartbroken. One morning after several weeks the animal disappeared from the house.\nIt went to the woman's home. On seeing her, the elephant waved its trunk and touched her with it. The young woman was so moved by the act of the animal .So she went back to her husband's home.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high9643.txt", "source_text": "Every New Year brings renewed  expectation for a change, for a better life and for a better you. That's a wonderful thing, because this fresh start gives us a chance to reinvent our lives and ourselves. Here's how.\nLet go\nMany times we are held back by our previous failures,emotions and barriers . This is all old baggage. Let everything unhappy from the past go. Let go of failures. Let go of fears you've built up. Let go of your ideas about what your life has to be like. Let go of long-held beliefs and habits which seem to be burdens  to you.\nClear away distractions \nClear away email, your favourite blogs and news websites. Clearaway the iPhone or Blackberry, and clear away all the _ that pull at your attention. In fact, if you can, shut off the Internet for a while. You can come back to it after you take a break.\nDecide what matters most today\nForget about your goals for all of this year. Instead, decide what you want to do today. What matters most to you and your life? What are you most passionate  about right now? What excites you? What gives you the most fulfillment ? Often the answer would be in creating something, making something new, helping others, becoming a better person, and working on a project that you will be proud of. But whatever your answer, have it clear in your mind at the beginning of the day.\nReinvent yourself every day\nEvery day, you are reborn.Reinvent yourself and your life. Do what matters most to you. It might be the same thing that mattered most yesterday, or it might not be. That isn't important. What's important is today---right now! Be passionate, and be happy!\nYou'll have a fresh start every single day---not just on January 1 of a new year.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high11809.txt", "source_text": "I don't often lose things and I'm always careful with money, so I was quite surprised when I reached for my wallet and it wasn't there. At first, I thought it was possible that I could have left it at home. Then I remembered taking it out to pay the taxi, so I knew I had it with me just before I walked into the restaurant. I wondered if it was possible that it could have dropped out of my pocket while I was eating dinner. I turned and walked back to the table where I had been sitting. Unluckily, there were several people sitting at the table at that time, so I had the waiter go over to the table to see if my wallet was on the floor. While the waiter was looking for it, the head of the restaurant came up to me and asked me if anything was wrong. I told him what had happened. He asked me to report the missing wallet to the police. I told him I didn't want to do so; I was in a hurry because I had to reach my waiting room before two o'clock, where some people were waiting to see me. I also told him that my biggest worry at the moment was how I was going to pay for the meal. He told me not to worry about that. He asked me to write down my name and address, and he said he would send me a bill  .", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high11670.txt", "source_text": "Many gardeners believe that \"talking\" to their plants helps them grow---it turns out that _ may not be crazy after all. According to the scientists from the University of Exeter, plants may keep communicating with each other through a secret \"unseen\" language.\nFor their experiment, the scientists picked a cabbage plant that is known to send out a gas when its surface is cut. In order to get video evidence of the communication, they changed the cabbage gene by adding the protein---luciderase , which is what makes fireflies  glow in the dark.\nWhen the changed cabbage plant was in full bloom, they cut a leaf off with a pair of scissors, and almost immediately, thanks to the luciderase, they could see the plant sending out \"methyl jasmonate \".\nWhile this was a known fact, what was surprising was the fact that the minute this gas began to give out, the nearby cabbage plants seemed to sense some kind of danger and started to send out a gas that they normally have to keep predators  like caterpillars  away.\nWhat the scientists are not sure is whether the plants are trying to warn the other leaves or the near plants about the danger---something that will require further research However, the team, which is led by Professor Nick Smirnoff, is quite excited about the findings because this is the first time it has been proved that plants do not live a passive life, but actually move, sense and even communicate with each other.\nHowever, before you get all concerned, they are quite sure that plants do not feel the pain when they are cut, since they do not have nerves---so go ahead and bite into that juicy carrot!", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high200.txt", "source_text": "February has long been a month of romance. With the sweet smell of roses in the air, romantic films hit cinemas and love stories fill newspapers and magazines.\nOn the 14th day, it is a custom for a boy to take his girlfriend out to dinner, buy her flowers and chocolates, write poems, sing to her or even spell out her name with rose petals! This is what you see on Valentine's Day, a day named after Valentine who was a priest  in the third century Rome. When the emperor   decided that single men could become better soldiers than those with wives, he didn't allow marriage.\nBut Valentine continued to perform marriage ceremonies for young lovers in secret. When his actions were discovered, the emperor sentenced him to death. While in prison, it is said that Valentine fell in love with the daughter of his prison guard. Before his death, he wrote her a letter, which he signed \"From your Valentine\", an expression that is still in use today. Valentine died for what he believed in and so he was made a Saint  , as well as becoming one of history's most romantic characters.\nNowadays, Valentine's Day is also popular among Chinese young people. Some students are planning to make Valentine's cards for parents, teachers and friends. Others want to hold parties at which they will exchange small gifts and eat heart-shaped cakes. The idea is to have fun and encourage people to share in the spirit of St. Valentine.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high21355.txt", "source_text": "Ashrita Furman loves breaking records. In fact over the last 30 years, he's broken almost  110 Guinness World Records. And be recently broke the Guinness World Record for \"the most ecords held at the~time by an individual\".\n   Ashrita broke his first record in 1979, doing 27,000 star jumps in one go. But since then,he 's set all sons of records: clapping non-stop for 50 hours, balance a lawn mowerp)on ds chin for almos two minutes... the list is endless. The 57-year-old New Yorker runs a health food shop but spends his free time training to break new records\n  How does he decide which records to attempt? Simple! Ashriba studies the Guinness Book\nif Records online database. \"I used to stay up two or three in the morning, sifting through the 10,000 records and chose the ones I was interested in.\" he explained. But these days, to make tare he has overall fitness. he chooses records that work different pmt of his bod3\n  In his attempts to break records, Ashrita often navels abroad. In 2005. he set the record for he \"fastest mile on a space hopper while jumping along the Great Wall of China. In 2003, he at the record for the \"longest time balancing on a Swiss ball\" at Stonehenge, England. And he ikes to make his record attempts as challenging as possible.\n  As a teenager, he met a gum(}and began studying meditation(] .\"\n;hanged my life... And I soon realized that limits are all in the mind.\" One day, his gum told him to go and \"break records\". So he did and he hasn't stopped since. He recently said, \"The point is joy. The point is the challenge. It's something silly, but you are the best in the world at it\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high21147.txt", "source_text": "Phaethon stood impatiently at the heavy golden doors. He ordered the guards, Month and Year, to let him approach his father's throne. As the doors opened slowly, the sun's rays almost blinded him. Phaethon protected his eyes and felt his way toward Apollo's throne. \"Come here, my son. Follow my voice,\" Apollo's voice echoed. \"What is so urgent that you have my guards hurrying to do your bidding?\" \n          \"Father, I have a problem. All of my friends have been teasing me. They don't believe that you're my father or that you make the sun rise and set,\" complained Phaethon.\n     Apollo replied, \"Oh? That problem again? Well, just to prove it to your friends once and for all, I will satisfy any wish you desire.\" \n          \"Really? Then I have only one wish,\" answered Phaethon. \"I'd like to drive your chariot and make the sun rise tomorrow morning!\" \n     Apollo was horrified. \"No, not that! No one but me can drive the chariot. The horses are too powerful!\"\n     \"You said I could have anything,\" murmured Phaethon.\n     Bound by his promise, Apollo had to agree. His heart was sick with worry as he ordered Dawn to prepare the horses, Hour and Day, to the Golden Chariot. Phaethon could hardly wait to jump in the driver's seat and take the reins . He hoped all his friends were watching the sky and waiting for him through the stars. \n    \"Wait, my son! There are things you need to know!\" cried Apollo. \n\"Oh, Father! You worry too much. I've often seen you drive. I know what to do,\" Phaethon answered. \n         Apollo hurried to give directions. \"You have never driven my chariot before. You must make the horses stay on the path. If you are too low, you will  _ the earth and large land on it could be thrown into a world of fire.\"\n          \"I know, Father. Now watch me take off!\" shouted Phaethon. \n     Dawn stepped back and released the horses go. The horses were filled with excitement. The sky begged for Dawn's light, so she ran toward the horizon to make the darkness fade. As Phaethon was about to get on, Apollo took him by the arm and said, \"Please listen to me! If you go too high, you will warm the cold depths of the heavens, and the Bear or Snake or the Scorpion   will come alive!\"\n         Phaethon just laughed. \"My friends are waiting. I've got to go!\" he shouted. \n         With that, the chariot was off. It was a wild ride. Hour and Day were difficult to control. Phaethon did not have his father's strong arms or years of experience. The horses wove from side to side and jumped up and down through the heavens, hitting everything in their way. The sun bounced along behind the chariot like a basketball. It scratched the stars and slipped along mountaintops, leaving burnt remains behind. Phaethon's friends ran for cover as they watched. Just as his father had warned him, the figures in the sky began to move. Suddenly the Scorpion appeared suddenly before him, but Phaethon dashed by in time. The Snake struck out and bit a wheel off the chariot. \n     Apollo, seeing the destruction, rushed up toward the heavens, but he was too late! The Bear had waken up from his icy hibernation and seized Phaethon before his father could reach him. Apollo took hold of the reins and finally regained control of Hour and Day, but it was years before the earth's mountaintops were white with snow again. The scorched areas became deserts where very little would grow. Phaethon became a part of the stars alongside the Bear, where his father could regretfully keep an eye on him.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high17335.txt", "source_text": "From Mr. Ward Hoffman.\nSir, I was halfway through Professor Raj Persaud's article \"What's the tipping point?\"\n(Financial Times Weekend, April 9-l0) when it occurred to me that what I was reading was not ironic . If  Prof Persaud wants to know why Americans tip in restaurants, he need only ask the first American he meets inprefix = st1 /London.\nAmericans tip in restaurants for one reason, and one reason only: we tip to supplement   the salary of restaurant workers. Quality of service does not enter into it, beyond the fact that one may tip a bit less for poor service, or a little more for good service.\nNot tipping at all in a non-fast-food restaurant is not a choice. In the US, one used to tip about 15 per cent for dining in a family-style restaurant or in an up-market   restaurant. Here, in San FranciscoBayarea restaurants, we are encouraged to tip 20 per cent or more, to help restart workers live in this very expensive area.\nAfter eating at an Italian restart in my city, I left a tip of 20 per cent on the non-tax part of our dinner bill. It was expected. There is nothing more complicated than that about Americastipping in restaurants.\nWard Hoffman,  \nPalo Alto, CA94306,US\n*                *                  *\nFrom Mr. Philip McBride Johnson.\nSir, I agree with most of Raj Persaud's opinion about the doubtful value of tipping, but with one exception. Tips can be very useful when one is a repeat customer or diner.\nIt is only when the tipper is a stranger and likely to remain so that the system does not work to his or her advantage. But frequent a hotel or a restaurant, always tip a bit more, and the difference in service and treatment will be easily felt.\nPhfiip McBnde Johnson,\nGreat Falls, VA22066,US", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high2508.txt", "source_text": "Going Zero Waste means more than dealing with the rubbish we create. It means reducing _ , too. People who go Zero Waste are careful about what they do. They never take more than they need, they reuse plastic bags, and they make good plans not to buy more than necessary before going shopping.\nKamikatsu, a Japanese village, has already gone Zero Waste. The 2,000 villagers recycle everything possible. There are 34 different boxes at the recycling center! The villagers sometimes just feel unhappy about what they have to do, but they also see the good side.\nLet's think about how to enjoy a Zero Waste Christmas. By sending recyclable cards, we can help our friends and family reduce  waste. And wouldn't it be better to enjoy the spirit of Christmas with a real tree that can be re-planted in spring?\nGoing Zero Waste requires us to think more about what happens before and after we act. It is not always easy. But just think how good it would be, both for ourselves and for the earth we live on, if we never had to waste anything.", "split": "train", "level": "", "topic": "V-ing vs to-V", "topic_category": "gerunds_infinitives"}
{"id": "high4557.txt", "source_text": "Dublin City Hall\nInside City Hall is an interesting exhibition about Dublin's history, with historical items from the old city and multimedia presentations. The building, which dates from 1779, once badly damaged, was recently _ . Guided tours are available. Open Monday to Saturday 10:00 a.m.~5:15 p.m., Sunday and holidays 2:00 p.m.~5:00 p.m. Admission is EUR6.50. Phone 672- 2204.\nDublin Castle\nThis is a joy for anyone interested in archaeology or history. Dublin Castle was built in the 13th century on top of the foundations of a Viking structure. The castle served as a military fortress, prison, court of law and the core   of British administration in Ireland until 1922. It's now used for state functions and government conferences. Guided tours are available. Open Monday to Friday 10:00 a.m.~4:50 p.m.; Saturday, Sunday and holidays 2:00 p.m.~4:50 p.m. Closed during state functions. Admission is EUR4.50. Phone 677- 7129 or 677- 7270.\nTrinity College\nThe sole college of the University of Dublin, Trinity was founded by Queen Elizabeth I in 1592. The reason most visitors venture to Trinity is to take a look at the Book of Kells, which is on display at the Old Library. The ticket price includes admission to the Long Room, a striking space that contains 200,000 of the college's oldest books. Open Monday to Saturday 9.30am~5pm, Sunday noon~4:30 p.m. (from 9:30 a.m. June to September). College Green. Phone 608 -1177.\nIrish Museum of Modern Art\nHoused in the beautifully restored   Royal Hospital Kilmainham (which was modelled   on Les Invalides in Paris), the museum exhibits contemporary art and has an impressive permanent collection that includes pieces representing the cutting edge of Irish and international art. Open Tuesday to Saturday 10:00 a.m.~5:30 p.m., Sunday and holidays noon~5:30 p.m. The museum has no admission charge. Military Road, Kilmainham. Phone 612- 9900.\nJames Joyce Centre\nJames Joyce is one of Dublin's most famous 20th century writers. Author of such works as Dubliners, Ulysses and his autobiographical novel A Portrait of the Artist as a Young Man, Joyce's name is forever linked to the city of Dublin. The James Joyce Centre is dedicated to promoting the life and works of James Joyce to novices and scholars alike. Open Tues.~Sat. 10:00 a.m.~5:00 p.m., Sun. 1: p.m.~5:00 p.m., admission costs EUR5.00 for adults. North Great George's Street. Phone 878- 8547.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high19749.txt", "source_text": "Ahead of so-called Singles' Day on the 11th of this month,2013, online sales have already begun peaking.\nThe leading e-business platform, tmall.com, has promoted its fifty-percent-off discount to attract consumers. They are also trying to attract buyers through social media. Vice President of tmall.com Wang Yulei says more than 20 thousand online stores have joined the Double 11 Day sales. But this number has doubled. The final number of how many products going to be on sale has not been known yet. But so far, many more products planned to be put on shelves with discounts.\nDuring last year's Singles' Day, tmall.com, together with taobao.com, reached a record of 19.1 billion yuan in sales, which considered a milestone in the e-business history of China.\nSingles' Day was first started by Chinese college students in the 1990s as the opposite of Valentine's Day, a celebration for people without romantic partners. The timing was based on the date: Nov. 11--or double 11--for singles. Single young people would treat each other to dinner or give gifts to show love to someone and end their single status.\nBut now, the Singles' Day has been promoted as a kind of grand craze just for the shopping season, thanks to thousands of discounted products being promoted online.\nTaobao.com was the first big e-retail platform which used the double 11 idea to promote sales. Taobao.com reached one million yuan worth of sales on that day in 2009, when they first promoted the Singles' Day idea. In 2010, the sales increased to 936 million yuan. The figure climbed up to 5.3 billion yuan in 2011, putting huge demand on shipping services. The figure doubled in 2012.\nE-commerce is considered to be replacing the traditional retailing industry, but the reality is both sides are learning from each other.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high15217.txt", "source_text": "Introductory Chemistry was taught at Duke University for many years by professor Bonk. One year, two guys took the class and did pretty well on all the quizzes and mid-terms. They each had a solid A. These two friends were so confident in going into the final that the weekend before finals week, despite the Chemistry final being on Monday, they decided to go to the University of Virginia to party with some friends.\nThey had a great time there. However, with their hangovers and tiredness, they overslept all day Sunday and didn't make it back to Duke until early Monday morning. Rather than taking the final then, they found professor Bonk after the final and explained to him how they missed the final. They told him they went up to the University of Virginia for the weekend and had planned to come back in time to study, but they had a flat tire on the way back and didn't have a spare. So they were late getting back to campus.\nBonk thought this over and agreed that they could take the final the following day. The two guys, happy and relieved, studied that night and went in the next day at the time that Bonk had told them. He placed them in separate rooms and handed each of them a test booklet. He told them to begin.\nThey looked at the first problem which was something simple about solution . It was worth 5 points. \"Cool,\" they thought, \"this is going to be an easy final\". They then turned the page. They were unprepared, however, for what they saw on it. The question contained only two words: (95 points) Which tire?", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high14098.txt", "source_text": "Ode to Joy(<<>> ),a 42-episodes TV series, is about five young women living on the 22nd floor of Shanghai's \"Ode to Joy\" high-rise community. They become friends while pursuing love and career advancement. Since its appearance on April 18, Ode to Joy has been praised for its realistic description of the hidden struggles of city life. \"The audience can relate to the characters since their experiences can be traced back to real life too,\" commented the Dahe Daily. \"Even better, female audiences can find themselves in one or two of the characters because the characters _ feminine archetypes  found throughout the society.\"But the idea of following a group of women as they lead a city life is hardly a pioneering concept. In many ways, Ode to Joy resembles American TV series like Sex and the City (1998-2004) and Desperate Housewives (2004-2012). These two series were praised for their feminist themes, but they also employed well-known female archetypes to illustrate the range of dilemmas women face. Deborah A. Macey, a communications professor at Saint Louis University in the US, divides these archetypes up into four ways: the iron maiden, the sex object, the child,and the mother. \"The iron maiden is portrayed as masculine and career-oriented. The sex object owns her sexuality and genuinely loves her body. The child archetype is naive, optimistic, and dim-witted. The mother archetype connects the characters in the series and serves as the dominant storyteller,\" Macey said on the online media forum \"In Media Res\".\nSounds familiar? Yes, these features can be seen in the characters of Ode toJoy. Andy (Liu Tao), for instance, partly embodies the iron maiden role. She's super smart, rational and direct. She moves from the US to Shanghai and takes the position of CFO at a top Chinese company. Fan Shengmei (Jiang Xin) can be seen as the \"mother\" in the series. Despite the fact that she s in charge of her own family issues,she takes her friends under her wing and stands up for them. Qu Xiaoxiao (Wang ziwen), the sexy and beautiful girl born with silver spoon, perfectly illustrates what is bitter-sweet relationship between friends and lovers. With that being said. Ode to Joy doesn't lack creativity. It assigns the \"child\" role to two characters-the straightforward, naive Qiu Yingying (Yang Zi), and the good-tempered, hard-working Guan Ju'er (Qiao Xin).\nBut this category of TV series has its risks. Having five main characters means the drama isn't story-driven but character-driven. \"It's not something you often see in Chinese TV dramas,\" Yuan Zidan, Ode to Joy's screenwriter, told Changjiang Daily. \"But we want to challenge the norms.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high9466.txt", "source_text": "In American schools there is something called Homecoming. Many high schools and colleges with a football team have a Homecoming game. This can be the most important event of the year except graduation or commencement   day. Students plan Homecoming for many weeks in advance.\nSeveral days before Homecoming, students start to decorate the school. There are signs to wish luck to the team, and many other signs to welcome all the graduates. Many people still come to Homecoming twenty or thirty years after their graduation.\nThe members of school clubs build booths   and sell lemonade, apples and sandwiches. Some clubs help to welcome visitors. During the day people like to look for teachers that they remember from long ago. Often they see old friends and they talk together about those happy years in school.\nEveryone soon comes to watch the football game. When the game is half over, the band comes onto the field and plays school songs. Another important moment is when the Homecoming Queen or King appears. All the students _ a most popular student Homecoming Queen or King. It is a great honor to be chosen.\nHomecoming is a happy day, but it is not perfect unless the football team wins the game. Even if the team loses, the students still enjoy Homecoming. Some stay at the school to dance, and others go to a party. For everyone it is a day worth remembering.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high18773.txt", "source_text": "There was a rich merchant who had 4 wives. He loved the 4th wife the most and adorned her with rich robes and treated her to delicacies. He took great care of her and gave her nothing but the best. \nHe also loved the 3rd wife very much. He's very proud of her and always wanted to show her off to his friends. However, the merchant is always in great fear that she might run away with some other men. \nHe too, loved his 2nd wife. She is a very considerate person, always patient and in fact is the merchant's confidante. When the merchant faced some problems, he always turned to his 2nd wife and she would always help him out and tide him through difficult times. \nNow, the merchant's 1st wife is a very loyal partner and has made great contributions in maintaining his wealth and business as well as taking care of the household. However, the merchant did not love the first wife and although she loved him deeply, he hardly took notice of her. \nOne day, the merchant fell ill. Before long, he knew that he was going to die soon. He thought of his luxurious life and told himself, \"Now I have 4 wives with me. But when I die, I'll be alone. How lonely I'll be!\" \nThus, he asked the 4th wife, \"I loved you most, endowed you with the finest clothing and showered great care over you. Now that I'm dying, will you follow me and keep me company?\" \n\"No way!\" replied the 4th wife and she turned away without another word. \nThe answer cut like a sharp knife right into the merchant's heart. The sad merchant then asked the 3rd wife, \"I have loved you so much for all my life. Now that I'm dying, will you follow me and keep me company?\"\n\"No!\" replied the 3rd wife. \"Life is so good over here! I'm going to remarry when you die!\" The merchant's heart sank and turned cold. \nHe then asked the 2nd wife, \"I've always turned to you for help and you've always helped me out. Now I need your help again. When I die, will you follow me and keep me company?\" \n\"I'm sorry, I can't help you out this time!\" replied the 2nd wife. \"At the very most, I can only send you to your grave.\" The answer came like a bolt of thunder and the merchant was devastated. \nThen a voice called out: \"I'll leave with you. I'll follow you no matter where you go.\" The merchant looked up and there was his first wife. She was so skinny, almost like she suffered from malnutrition. Greatly grieved, the merchant said, \"I should have taken much better care of you while I could have!\" \nActually, we all have 4 wives in our lives.\nThe 4th wife is our body. No matter how much time and effort we lavish in making it look good, it'll leave us when we die. \nOur 3rd wife is our possessions, status and wealth. When we die, they all go to others. \nThe 2nd wife is our family and friends. No matter how close they had been there for us when we're alive, the furthest they can stay by us is up to the grave. \nThe 1st wife is in fact our soul, often neglected in our pursuit of material, wealth and sensual pleasure. \nGuess what? It is actually the only thing that follows us wherever we go. Perhaps it's a good idea to cultivate and strengthen it now rather than to wait until we're on our deathbed to lament.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high12967.txt", "source_text": "On November 15th, 2014, children aged 8 to 12 got together in five cities around the world to participate in the first Global Children's Designation. The event that was organized by a Dutch company called Unexpect, challenged kids to come up with solutions for some of the world's most pressing problems in a day!\nThe day began with the kids listening to the various challenges that were related to their particular cities and towns. The teams were then asked to brainstorm about which problem they were going to handle and how. There were so many amazing ideas produced on that day.\nWhile some of the ideas were far from perfect, there were many that could be practical like the smart cars which can ease traffic pressure by telling traffic lights of its arrival and also guiding the drivers to the best possible route .\nEmer Beamer, the founder of Unexpect, says the purpose of the project is to introduce children to skills they probably never learn in class. She says that for most part, schools focus on teaching things that they will most likely never need to know again. She believes that for kids to be successful in the world, they should be learning how to be creative, handle new technologies and deal with unexpected situations.\nThough the first global design challenge was relatively small, involving only a few hundred of the two billion youngsters that are bursting with ideas, the next one will be much bigger. That's because in 2015, Unexpect plans to distribute free tool kits  to any school that is interested in hosting their own Children's Designation Challenge. We can't wait to see what ideas kids will come up with next.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
