{"id": "high17766.txt", "source_text": "Father's Day may be over in the United States, but animal dads are still hard at work. From penguins to catfish  , some animal fathers play a big part in raising their babies. \n   \"Seahorses are possibly the best example of fathers caring for their young in the animal world,\" said Heather Masonjones, a biologist at the University of Tampa in Florida. Human mothers carry their babies in their bodies for nine months. But seahorses are different. A female seahorse lays eggs and then puts them in a pouch on a male seahorse's belly  , where the eggs stay until they hatch. \n    Male seahorses aren't the only animal dads caring for eggs. The male hardhead catfish carries up to 48 marble-\nsize eggs in his mouth for 60 days! He doesn't eat for the entire time. \"You'd think it would be hard for them to give up a meal,\" said Ed Matheson, a fish expert at the Florida Marine Research Institute. \n    Emperor penguins sit on eggs to hatch them during Antarctica's freezing winter. The males have to gather closely together for warmth and can lose half of their weight in the two months that it takes the baby penguins to hatch. \n    Even mammal   dads play a role in raising their young. The male South American marmoset   takes care of the baby in place of the mother a few weeks after she gives birth. \n    So next Father's Day, remember the millions of dads hard at work in the animal kingdom!", "split": "train", "level": ""}
{"id": "middle4369.txt", "source_text": "At Carl Hayden High School in Phoenix, Arizona in the United States, four poor Mexican boys worked together on a strange electric machine. They were encouraged by their teacher Allan Cameron to build the machine. It only cost them $800 to build it. They used pipes , cameras, computer parts, and whatever they could find. All the other students wondered what it was. The machine was like a very small submarine . It could move around in a swimming pool. The boys could control  its movement from outside the pool.\nCarl Hayden High School had been invited to a competition of high schools and universities. The schools were from the United States and Canada. The school that could build the best machine would be the winner. Many students came from schools that gave them lots of money and support. The Carl Hayden boys had hardly any support and very little money.\nStudents from eleven schools traveled with their machines to the University of California, including students from the famous university, MIT. When students saw the machine made by the Carl Hayden boys, some of them laughed. Its name was \"Stinky\" because it had a very strong smell. But when the competition started, _ saw that \"stinky\" was no joke. It did better than all the other machines, including the ones from MIT, and it took first place in the competition.\nSince then, the boys from Carl Hayden High School have become famous. People have even offered them money for college, and a movie producer has asked them if it is OK to make a movie to tell their story.", "split": "train", "level": ""}
{"id": "high12486.txt", "source_text": "With the development of society and economy, animals and their habitats are getting pushed aside as households decrease in size and increase in number.\nSmall numbers of people per household on average use more energy and goods per person. Greater numbers of households require more natural resources for construction. The possible result of this problem may be _ natural resources to meet consumer demand without endangering habitats important to biodiversity.\nPersonal freedom and social choice may come at huge environmental cost. Direct costs include visible damage to animal habitats and plant life. Indirect costs include the release of more greenhouse gases.\nThe effects of such \"personal freedom and social choice\" have already surfaced in south-west China's Wolong Nature Reserve. In Wolong, they found that a reduced average household size was directly tied to an increase in homes, and thus an increase in the amount of firewood consumed for cooking and heating. The rise in wood fuel use has contributed to disappearance of forests and to the loss of habitats for giant pandas.\nCurious about whether other parts of the world were experiencing similar phenomena, they got the support of a team of researchers including Stanford's Paul Ehrlich, well-known for his population studies, to find out the household dynamics in 141 countries between 1985 and 2000. Their study proved that the difficult choice of Wolong is part of a global trend.\nIn the 76 countries considered biodiversity \"hotspots\", such as the United States, Brazil, Australia, and Kenya, the number of households grew by 3.1% every year, while the population increased just 1.8%. Meanwhile, the number of people per home dropped from 4.7 to 4.0. The decline in household size has resulted in 155 million additional households in hotspot countries, almost always limiting biodiversity.\nIn the 10 non-hotspot countries -- those without high-density areas of animal and plant species -- similar results were found, though on a lesser scale. Even in countries experiencing population decline, such as New Zealand, the number of households still increased because of a reduction in household size.", "split": "train", "level": ""}
{"id": "high997.txt", "source_text": "I had the meanest mother in the world.While other kids ate candy for breakfast.I had to have cereal, eggs and toast.Others had cakes and candy for lunch, while we had to eat a sandwich.As you can guess, my supper was different from the other kids'.But at least I was not alone in my suffering.My sister and two brothers had the same mean mother as I did.\nMy mother insisted on knowing where we were at all times.She had to know who our friends were and what we were doing.We had to wear clean clothes every day.Other kids always wore their clothes for days. We reached the height of disgrace   because she made our clothes herself, just to save money.\nThe worst is yet to come.We had to be in bed by 9:00 each night and up at 7:45 the next morning.So while my friends slept, my mother actually had the courage to break Child Labor Law.She made us work. I believed she lay awake all night thinking up mean things to do to us.Through the years, our friends' report cards had beautiful colors on them, black for passing, red for failing.My mother, however, would only be satisfied with black marks.None of us was allowed the pleasure of being a dropout  .\nShe forced us to grow up into educated and honest adults.Using this as a background, I'm now trying to bring up my three children.I'm filled with pride when my children think I am mean because now I thank God every day for giving me the meanest mother in the world.", "split": "train", "level": ""}
{"id": "high5326.txt", "source_text": "Imagine going to sleep then waking up speaking another language. It may sound impossible, but it's actually happened.\nThe phenomenon of being able to suddenly speak another language is known as\"Xenoglossia\", from the Greek words\"xenos\"(foreigner)and \"glossa\"(language).\n _ once happened to a 13yearold girl from Croatia. After being unconscious because of a disease for 24 hours in 2010,she woke up speaking fluent German. The girl, who came from the town of Knin in the south of Croatia,was studying German at school but she'd only started recently. Her parents said that she'd been reading German books and watching German TV at home, but that she wasn't fluent in the language.However ,since waking up, she's been able to communicate \"perfectly\"in German.What's really strange is that she's now unable to speak Croat,her mother language.Doctors at Split's KB Hospital have asked some experts to examine the girl as they try to find out what caused the change.Dr Mijo Milas said,\"In earlier times this would have been considered as a miracle ;we prefer to think that there must be an explanation--it's just that we haven't found it yet.\"\nIn 2007,Matej Kus from Czech became unconscious after a motorbike accident. On waking up 45 minutes later,he could speak fluent English.Matej was only 18 years old at the time, and had just started studying the language and so was at a low level.Peter Waite,Kus's teammate said,\"I couldn't believe what I was hearing.It was really clear English.It was unbelievable to hear him talk in unbroken English.\"Unluckily,Matej's new language skills didn't last.Two days later, when he recovered fully from the accident, he'd completely forgotten his English.\nWe still don't know exactly what happened to the two people. Perhaps scientists will discover something new and exciting. But until then, keep studying!", "split": "train", "level": ""}
{"id": "high2227.txt", "source_text": "A new generation addiction is quickly spreading all over the world. Weboholism , a twentieth century disease, affects people from different ages. They surf the net, use e-mail and speak in chat rooms. They spend many hours on the computer, and it becomes a compulsive habit. They cannot stop, and it affects their lives.\nTen years ago, no one thought that using computers could become compulsive behavior that could affect the social and physical life of computer users. This _ behavior has affected teenagers and college students. They are likely to log on computers and spend long hours at different websites.\nThey become hooked on computers and gradually their social and school life is affected by this situation. They spend all free time surfing and don't concentrate on homework, so this addiction influences their grades and success at schools. Because they can find everything on the websites, they hang out there. Moreover, this addiction to websites influences their social life.\nThey spend more time in front of computers than with their friends. The relation with their friends changes. The virtual life becomes more important than their real life. They have a new language that they speak in the chat rooms and it causes cultural changes in society.\nBecause of the change in their behavior, they begin to isolate( themselves from the society and live with their virtual friends. They share their emotions and feelings with friends who they have never met in their life. Although they feel confident on the computer, they are not confident with real live friends they have known all their life. It is a problem for the future. This addictive behavior is beginning to affect the whole world.", "split": "train", "level": ""}
{"id": "middle897.txt", "source_text": "Lily: Hello! This is Lily speaking. Is that Kate?\nKate: Yes, it is. Hi! Lily!\nLily: Hi! There's a meeting this afternoon in our classroom. Can you come, Kate?\nKate: I'm afraid I can't. My mother isn't feeling well today. I must help her with the housework and look after my little brother.\nLily: I'm sorry to hear that. But it doesn't matter. I think you'd better stay at home.\nKate: Thank you. By the way, what's the meeting about?\nLily: it's about the basketball game. We're going to play against Class Three.\nKate: That's great!\nLily: I got a letter from Uncle Wu yesterday. And a color photo, too.\nKate: Er... but who's Uncle Wu?\nLily: A farmer on the Jinxing Farm. Don't you remember?\nKate: Oh, yes. He was very friendly to us when we worked there last September.\nLily: it's a very nice photo. We're carrying rice in the photo.\nKate: Please bring it to school tomorrow morning.\nLily: OK! Bye!\nKate: Bye!", "split": "validation", "level": ""}
{"id": "high19645.txt", "source_text": "A woman planning \"Harry Potter night\" at a supper club she runs at home has been forced to change their name after a warning from film studio Warner Bros .\nThe evenings in Kiburn, north London, were due to include food  and other elements from the Harry Potter books. However, Warner Bros, maker of the Harry Potter films, wrote to the club's organizer \"Ms Marmite Lover\" warning that the parties would infringe its rights.\nThe club will now hold two \"Genetic Wizard nights\" for Halloween. On her blog,Ms Marmite Lover explains that she researched and developed her menu with her Harry Potter-obsessed teenage daughter and a food writer. \nGuests would have to enter the venue, called the Underground Restaurant, through \"Diagon Alley\" and by giving a password--while a \"Sorting Hat\" would decide the seating plan.\nAfter Warner Bros learned about the event, he wrote to Ms Marmite Lover saying: \"While we are delighted that you are such a fun of the Harry Potter series, unfortunately your proposed use of the Harry  Potter Properties without our permission would amount to an infringement of Wamer's rights.\"\nThe letter added: \"Warner does not, of course, object to you holding a generic wizard/Halloween night at the Underground Restaurant.\"\nMs Marmite Lover suggested in her blog: \"JK Rowling herself, having at one time been a struggling single parent, and having donated to the National Council for one Patent Families, would probably approve of a single mother being entrepreneurial  and creative\".\nThe Underground Restaurant usually charges diners about 20-30 each, except alcohol. Warner Bros says it has guidelines to help Harry Potter fans run non-profit and charitable events true to the spirit of the stories.\nThe vast majority of non-commercial events are able to go ahead with the studio's support, it says.", "split": "train", "level": ""}
{"id": "high13490.txt", "source_text": "Anne is six years older than me. Growing up, we were very poor, and my mother worked evenings at a factory in a small town. Not seeing my mother much, Anne looked after me and my younger sister.  During those hard years, Anne was always there for me, not only as a big sister, but as a mother and my best friend.\nWhen I was seventeen and had no money, I thought my only chance of going to college was if I could win a scholarship. I had an important interview for such an award. Anne at that time was struggling, surviving on a part-time job as she put herself through the local community college after serving in the army.  I told her of my interview.  I asked her advice on what to wear and showed her my best outfit   and how I planned to be careful, how I sat so that the hole in the bottom of my shoes would not be seen, but I wasn't sure what I would do if it rained.\nAnne suggested that we go shopping, and we took the bus to the JCPenney store. We found a beautiful pair of leather shoes on sale. She told me to try them on, but I thought it was just for fun as neither of us had ever owned anything that expensive before. But Anne handed me the boxed shoes and said, \"Here, I'll buy these for you.\"\n\"But . . .\" was all I could say.\n\"You deserve them,\" she replied. \"This interview is important. I want to see you get that scholarship.\"\nI was speechless as I knew this was a lot of money for her, and she would probably have to eat nothing but noodles for at least a month.\nI went to the interview and crossed my legs so that my beautiful new shoes shone with pride. I won the scholarship and became an engineer. Although they were nice leather everyday shoes, I didn't wear them much because they were so special.  Now, after 20 years have passed, I still have that pair of shoes with me, and I just wear them on those occasions when I need to feel special.", "split": "train", "level": ""}
{"id": "high286.txt", "source_text": "In America,Virginia Beach has all the elements of a classic seaside resort:brilliant beaches,a lively boardwalk,plenty of restaurants and nightspots,and amusement rides sure to appeal to kids.Many believe Virginia Beach is at its best in the off-season,when the town is less crowded but the weather is still mild.\nMeanwhile,some safety tips should be followed,enjoying the happiness and excitement the beach offers.\nThe number l safety tip concerns ocean safety:pay attention to Flag conditions posted on the lifeguard stands.Lifeguards post a red flag to warn when the ocean water is dangerous.Take them seriously! Tourists from land-locked regions are particularly easily attracted by the magic of the waves.However,a calm ocean can become risky without warning.Make sure you swim near a lifeguard.Swimming without lifeguard protection is almost five times as great as drowning at a beach with lifeguards.\nNever swim alone.Many drownings involve single swimmers.When you swim with someone else,if one of you has a problem,the other may be able to get help,including signaling for assistance from others.\nDon't fight the current.The facts show that some 80% of rescues by lifeguards at ocean beaches are caused by currents.These currents are formed by surf and gravity,because once surf pushes water up the slope of a beach,gravity pulls it back.This can create concentrated rivers of water moving offshore.If you are caught in a rip current,don't fight it by trying to swim directly to shore.Instead,swim parallel to shore until you feel the current relax,then swim to shore.Most rip currents are narrow and a short swim parallel to shore will help bring you to safety.", "split": "train", "level": ""}
{"id": "high13128.txt", "source_text": "Bill McIntosh and Royce Wedding had been the best friends for 30 years. Now, living alone 12 miles east of the town, Bill earned his living by hunting foxes and rabbits.\n\"Coming to the football match this afternoon?\" Bill McIntosh asked 54-year-old Royce Wedding as they drank beer at the Eureka Hotel. Royce shook his head, \"I promised Mom I'd burn off the weeds in one of our fields.\" \"I'll give you a hand,\" Bill said.\nDriving slowly from the southern edge of the field, they worked their way upwind, leaving a line of burning weeds in their wake. Suddenly the fire was on them. Bill pushed open his door only to find himself thrown through the air, the gasoline tank exploded and the car jumped three feet off the ground. When it crashed back down Royce found himself unable to move. Bill lay where he fell. \"Royce!\" he cried, struggling to his feet and heading for the car. Pulling open the door, he seized Royce's arms through the smoke. \"I'm stuck,\" Royce said. \"Get yourself away!\" The fire bit at Bill's arms, face and legs, but he said, \"I'm not leaving you here.\" Now Bill pulled as hard as he could. Suddenly he fell backward. Royce was free and out of the car.\n\"What's the matter with that dog?\" said Vicky Wedding, Royce's mom. Shocked by noise behind her, she turned to see Bill leaning against the door.\nSix months after the fire, when Royce went out of hospital, he walked into the Eureka Hotel and bought Bill a beer.", "split": "train", "level": ""}
{"id": "middle5925.txt", "source_text": "What is the hottest topic at your school? In Hangzhou Yongjin Middle School, it's money.\nThe school had an activity called \"making a living\" recently. About 800 Junior 1 and Junior 2 students were divided into 112 teams. They went out to make money by selling things.\nWhat did they choose to sell? Some sold newspapers; some chose bottled water; some sold environmentally friendly shopping bags and bamboo baskets.\nHuqi's team decided to sell educational books in front of the Children Activity Centre. They thought parents would like to buy books for their children. But unfortunately , they came across urban management officers . The officers asked them to leave. \"We played hide-and-seek with the officers for the whole morning,\" said Hu. \"Finally we gave up and moved to other place.\nWang Yongyi and her team sold ice cream in a square. They didn't meet any officers. But few people were interested in what they were selling. The team then put up a board saying the money was to help the \"Project Hope\" for country kids. It worked. More people came to their stall. A foreigner even gave them 100 yuan.\nMeng Zhaoxiang and his team were luckier. They sold all their cakes in four hours, spending 39.5 yuan and getting back 80 yuan. \"It was not easy to make the money,\" said Meng. \"Some people just looked. Others just tasted but didn't buy. Now I know how hard it is for our parents to earn the money we need to lead happy lives.\"", "split": "train", "level": ""}
{"id": "high5517.txt", "source_text": "If you're looking for the place that has everything, there's only one place to visit, and that is New York. It's a whole world in a city.\nThe World of Theatre: All of New York is a stage. And it begins with Broadway. Where else can you find so many hit shows in one place? Only in New York.\nThe World of Music: Spend an evening with Beethoven at Lincoln Centre. Swing to the great jazz of Greenwich Village. Or rock yourself silly at the hottest dance spots found anywhere.\nThe World of Art: From Rembrandt to Picasso. From Egyptian tombs to Indian teepees. Whatever kind of art you like, you will find it in New York.\nThe World of Fine Dining: Whether it's roast Beijing duck in Chinatown, lasagna in Little Italy, or the finest French coq au vin found anywhere, there is a world of great taste waiting for you in New York.\nThe World of Sights: What other city has a Statue of Liberty? A Rockefeller Centre? Or a Bronx Zoo?", "split": "train", "level": ""}
{"id": "high17385.txt", "source_text": "Fresh Water provides an expansive subject for the third program in the BBC's fascinating new natural history series. Broadly, we investigate   the world's lakes and rivers and the creatures which inhabit   them. Thus we visit the deepest lake on the planet, Lake Baikal in Siberia. We observe colonies   of Indian smooth-coated otters. A magical series which gives us a real sense of context in relation to the planet we inhabit.\nBBC 2\nFAMILY GUY\n11.45PM\nRoad to Europe, without proper identification, Brian and Stewie stow away on a plane they think is leaving for England. They're wrong, and soon they're in Saudi Arabia (Brian: \"Oh my God, we are finished. We are lost in the desert.\") at the beginning of a long trip home.\nITV 1\nAGATHA CHRISTIE'S POIROT\n9PM\nCards on the Table, Tonight's mystery concerns the death of one of London's richest and most mysterious men, Mr. Shaitana (Alexander Siddig), who has a fascination with crime. Shaitana hosts dinner and a game of bridge in his apartment, but when the time comes for the first guests to take their leave, they discover that their host has been stabbed   through the heart.\nCHANNEL 4\nTHE GAMES: LIVE\n9PM\nFor the first time on The Games, the men fight in a Kendo tournament, using 1.2m shinai (bamboo swords). The women compete in the cycling, racing wheel-to-wheel on competition bikes with no brakes. Plus other news from the English Institute of Sport in Sheffield.", "split": "train", "level": ""}
{"id": "high2620.txt", "source_text": "When I first saw the bookAlice in Lace, I thought I was going to like it. And as it turned out, I love it! I love books about life and being a kid. And Alice in Laceis just that kind. It's a humorous book about being thirteen and the problems kids might face. Alice and her friends get a strange assignment from their totally cool teacher, Mr. Everett. It was like playing the game of \"Life,\" but you had to act it out.\nSo Pamela is pregnant, Elizabeth buys a car and Alice gets married. Well, of course, Pamela wasn't really pregnant, but she walked around with a pillow under her shirt to get people's reactions. Elizabeth didn't really buy a car, but she went to the car lot and made the sales guy think she was. The whole class got assignments like these! I would love to do something like that for school.\nIn the book Alice has a lot to think about. \"Getting married is hard!\" Alice says. She has to plan the ceremony, the honeymoon, find a place to live, pay for furniture and two months' rent and food. Maybe she and her \"husband\" could work it out -- if they were getting on fine!\nAlthough this book was funny, it really made me think about how problems like these could really mess up your life. Take teenage pregnancy for example. How could you have a baby and stay in school? You couldn't find a babysitter every day to stay with your kid. A child really consumes your life. I understand what the teacher was trying to do. He was trying to discourage the class from getting into these problems by giving them a glimpse of life. As someone about to become a teenager myself, I can say sometimes a story makes you think about what's up ahead.\nOverall, I would say this book is wonderful. My favorite part of the book is discovering that if I like it, there are seven other Alice books I can check out at my local library. I love this book, and I hope you will too.", "split": "train", "level": ""}
{"id": "middle7376.txt", "source_text": "Dear friends,\nI'd like to share my suggestions about studying with you. \"Studying\" is not the same thing as \"doing homework\"! Studying may include doing homework,but it also includes a lot more, as you will see. So if you say that you have no homework,and therefore you can't or you don't have to study, you're mistaken!\nI am going to give you some suggestions on how to study efficiently. _ worked for me when I was in the high school and college.\nNot only that, but they also worked equally well for me in literature and math.\nAlthough everyone's learning style may be different,and some of my suggestions may not work for you, I still ask you to try them. A lot of successful students have used them.\nPlease send me suggestions about studying that work for you. I will try to include them into the further version of this guide.\nHere are some of my suggestions:\nA. Manage your time.\nB. Take notes in class and rewrite them at home.\nC. Study hard and study in a quiet place.\nD. Read texts actively and slowly. Do it before and after class.\nE. Finish your homework by yourself.\nF. Do not only study for exams.\nYours,\nEmma", "split": "train", "level": ""}
{"id": "high9082.txt", "source_text": "One of the most successful singers of the twentieth century , Ella Fitzgerald, has made several different styles of her own. She was born in Virginia but was brought up in Yonkers, New York. Chick Webb noticed her in a competition when she was sixteen. He asked her to sing with his band  , and when he died in 1939, she took over.\nUnlike Besie Smith, Ella Fitzgerald taught herself the sentimental music so popular in the 1930's--songs like \"My Heart Belongs to Daddy\"--- and her recordings became best sellers. During the 1940's she developed her own \"scat singing\", for songs like \"Flying Home\" and \"Lady Be good\".\nElla Fitzgerald was the perfect musical partner for her friend, the trumpets  Louis Armstrong, matching him in warmth and artistry. \" I just like music,\" she has said.\"To me, it's a story. There is only one thing better than singing... it's singing.\"", "split": "train", "level": ""}
{"id": "high16790.txt", "source_text": "The greatest recent changes have been in the lives of women. During the twentieth century there was an unusual shortening of the time of a woman's life spent in caring for children. A woman marrying at the end of the 19th century would probably have been in her middle twenties, and would be likely to have seven or eight children, of whom four or five lived till they were five years old. By the time the youngest was fifteen, the mother would have been in her early fifties and would expect to live a further twenty years, during which custom, chance and health made it unusual for her to get paid work. Today women marry younger and have fewer children. Usually a woman's youngest child will be fifteen when she is forty-five and is likely to take paid work until retirement at sixty. Even while she has the care of children ,her work is lightened by household appliances and convenience foods.\nThis important change in women's way of life has only recently begun to have its full effect on women's economic position. Even a few years ago most girls left school at the first opportunity and most of them took a full-time job. However, when they married, they usually left work at once and never returned to it.                \nToday the school-leaving age is sixteen, many girls stay at school after that age , and though women tend to marry younger ,more married women stay at work at least until shortly before their first child is born. Many more after wads, return to full or part-time work. Such changes have led to a new relationship in marriage, with both husband and wife accepting a greater share of the duties and satisfaction of family life, and with both husband and wife sharing more equally in providing the money and running the home, according to the abilities and interest of each of them.", "split": "train", "level": ""}
{"id": "high13768.txt", "source_text": "We feel it important to start reading to your child right from the start -the younger the better! With little ones(children from birth to 4)it is very important to read and reread books.Starting early makes the job of _ (for you will be teaching your child how to listen) easier,as it helps to develop an early love of the written and spoken word.\nWe believe that you should read aloud to your child at least once every day .Set a special reading time during the day or evening when you can settle down  and enjoy a book,without interruption.For most families,reading aloud at bedtime is a common practice.\nWe understand that it can be quite discouraging to read to a child who takes no interest .Take heart! Learning to listen takes experience .The more you read ,the more your child will learn to sit for a story .Children have a natural development of responses to your reading .By the time your child reaches6-7 months,she/he is attracted by the book in your hand ,and would like to test it out by using it as a chew toy.This is natural! By one year,your child is learning to listen and talk about the pages,often shouting out things she/he recognizes.Encourage this! And at the onset  of walking ,you have your biggest challenge yet.your child  is always on the go.you need to set your reading time for a time in the day when your child is preparing to settle down.This means bedtime.Remember,it is your right and duty to teach your child about the power of books.Of course ,it doesn't happen overnight,but the returns are great!", "split": "train", "level": ""}
{"id": "middle5198.txt", "source_text": "Mrs Hunt comes back from work. She tells Mr Hunt about a nice dress. \"I see it in the shop every day\", she says , \"and ...\"\n\"And you want to buy it ?\" says Mr hunt . \"How much is it ?\"\n\"Two hundred and sixty yuan.\"\n\"Two hundred and sixty yuan for a dress ?That's too much !\"\nBut every evening when she comes back , Mrs Hunt speaks only about the dress, so at last he says , \"Oh ,buy the dress ! here's the money !\" She is every happy . But the next evening, when Mr Hunt wants to have a look at the nice dress, Mrs Hunt says ,\"I don't want to buy it .\"\"Why not ?\" he asks.\n\"Well, it is still in the window of the shop after a week. So I think no one wants this dress . And I don't want it ,either.\"", "split": "train", "level": ""}
{"id": "high19122.txt", "source_text": "Years ago, I was watching a detective show on TV where the fingerprints of a criminal are required. The hero invites the bad guy to his home and offers him a glass of water. The man takes the glass and drinks the water. After he leaves the hero dramatically brings out a handkerchief and picks up the glass. His expressions show the satisfaction at a job well done. The bad guy will soon be arrested. \nAt that time, I found it amazing - how can prints on a glass identify people? My dad explained that if you were to press your thumb on an inkpad and then on a sheet of white paper you will leave a smudge or print, which no one else in the world can make. The same would be true for each of your fingers. The Chinese were the first to use a fingerprint as a type of identification - it was used as a signature on important documents, although they had no way of independently matching it with the owner. \nEach print is one-of-a-kind and no two people have the same characteristic. Scientists and criminologists (those who study criminal characteristics) determine the differences between fingerprints by a careful study of their curves and not by their general shape or pattern. \nIn 1892, an English scientist, Sir Francis Galton, published a book on using fingerprints to solve crimes. At the same time in Argentina, a police researcher Juan Vucetich was also working towards a fingerprint classification system. However, it was in 1896 that Sir Edward Henry, then serving as Inspector General of Police in India, developed the print classification system that would eventually be used globally. \nSir Edward Henry and his assistant Khan Haque discovered that all fingerprints could be systematically classified according to their general curve patterns. He divided them into three classes on the basis of their general pattern: loops  , whorls  , and arches  . By counting the curve between any two points in the pattern, each of the ten fingers could be classified into a particular group. Taking the group together as a unit you have a complete system of classifying fingerprints. \nIn June 1897, the world's first fingerprint bureau was set up in Calcutta and in 1901, Sir Edward Henry was appointed head of Scotland Yard in London, where he applied the system. This system, called the science of fingerprint identification, is still used by police departments all over the world today with few changes.", "split": "train", "level": ""}
{"id": "middle4371.txt", "source_text": "Tom likes chocolates very much,but his mother doesn't give him chocolates , because they're bad for his teeth,she thinks. But Tom has a very nice grandfather. The old man loves his grandson very much and sometimes he buys Tom some chocolates. Then his mother lets him eat them,because she wants to make the old man happy.\nOn Sunday evening,it is Tom's birthday. He says,\"Please,God ,let them give me a big box of chocolates for my birthday.\"His mother says,\"God can't hear you. Don't shout.\"\"I know,\"says the clever boy with a smile.\"But Grandfather is in the next room,and he can.\"", "split": "train", "level": ""}
{"id": "high13951.txt", "source_text": "A job is more than a job, especially to the old. \"It's not the money that matters, but the sense of self-worth,\" 56-year-old Cheng Wonlan said. So, every day Ms Cheng carries a bag of parcels, letters and documents and does her rounds in North Point. She's a courier .\nFive years ago, Ms Cheng was a nurse at a private clinic. She had worked there for 30 years but became jobless when the doctor moved away. It was difficult for her to find another job as a nurse. \"People do not trust my ability when they learn how old I am,\" she said. After two years of searching, she eventually found another nursing job. But then after two years, she quit. Why?\n\"My colleagues were young and they didn't understand me because of my age. They often asked me, 'You are so old. What are you working for?' I was very unhappy,\" she said. When the rest of her family left for work, she was lonely and bored at home. Then her neighbours told her about Employees' Retraining Board offering retraining courses for older people. These courses are specifically designed to encourage the older people back to work.\n\"I was interested in courier work. I didn't think my age was a barrier  because I was fit,\" she said. Upon graduating, Ms Cheng was offered a job by a company. But then Ms Cheng was faced with a conflict: she was caught between honour and employment. \"I felt embarrassed about carrying and delivering letters and parcels,\" she said. It took Ms Cheng 24 hours to make up her mind: there was nothing wrong or embarrassing about doing the job. So she went off to work as a courier.\nMs Cheng's employer, Anthony Chong, is delighted with her responsible attitude and said, \"I hire older people because they are able and reliable. Age is not an important factor but attitude is. Many old people will not run from difficulties but the young ones will.\"", "split": "train", "level": ""}
{"id": "middle2932.txt", "source_text": "Everybody says that youth is the best time for our lives. Being young means romance, love and new discoveries, but it is also the most difficult time, because you have to make some very important decisions, which will influence your future life.\nThings are not easy nowadays even for adults, but for teenagers, Who have to find their own place in society, it's even difficult. It is necessary not only to adapt to society, but also to be confident of your position in five, ten or even twenty year's time.\nFor the future it is important to have a good nob. In order to get a really good job, you have to be well educated.\nEmotional problems for young people can be very important, too. The first teenager problem is that \"nobody understands me\". Some parents often continue to treat their children as little children when they are starting to consider themselves to be adults.\nThere are also some global problems. Young people in all countries are facing these problems. Let's start with smoking. According to studies, at the age of 16, almost 72% of all boys and 37% of all girls in Russia have already tried smoking. Smoking is not a natural need.It's just that teens try it when they want to appear to be more like adults.\nDrugs are also a serious problem. Students know the names of drugs well enough. 32% say they have tried drugs at least once, mainly because they were having fun, their friends influenced them to, they wanted to relax or they wanted to seem \"cool\". That's too bad.\nSo, you see, problems do happen and they can't be _ d. We should pay much attention to them.", "split": "train", "level": ""}
{"id": "middle1711.txt", "source_text": "Are you carrying too much on your back at school? You're not alone. Back experts  in the USA are worried about that young students are having back and neck problems because they are carrying too much in their backpacks .\n\"It hurts my back when I run,\" said Ebelin Reyes, a student in Virginia. \"It's hard to get up the stairs with my backpack because it's too heavy.\" Students have to carry heavy backpacks on their backs for a whole week's study. Ebelin is one of them. They have   regular backpacks with two straps  to carry them, but a number of students with heavy loads  have _ rolling backpacks. The backpacks have wheels and can roll on the ground. Shirley Park's backpack weighs 10 kilos, and she said, \"I'll change to a rolling backpack because I am starting to have back pain.\"\nHow much is too much? Experts say that students should carry no more than 10% to 15% of their own body weight. A few students have had a good idea to lighten  the load: less homework.\nDoctor's suggestions:\nLighten the load. Take home only the books the students need that day.\n(2) Wide straps are better. They can send out weight over your shoulders  and be sure to wear backpacks with two straps.\n(3) The heaviest things should be packed closest to the back.\n(4) Bend  both knees when you pick up the pack, don't just bend over the waist .", "split": "test", "level": ""}
{"id": "high16783.txt", "source_text": "The Lego Group had a very low beginning in the workshop of Ole Kirk Christiansen,a carpenter from Denmark.Christiansen began creating wooden toys in 1932.Two years later, he came upon the Lego name by putting together the first two letters of the Danish words Leg and Godt,which mean \"play well.\"The name could be interpreted as \"I put together\" in Latin;it is also similar to the Greek verb meaning \"gather\" or \"pick up\".\nIn 1947,the company enlarged to making plastic toys.At first,the use of plastic for toy production was not highly regarded by salesmen and consumers of the time.Many of the Lego Group's shipments were returned,following poor sales.However, Christiansen's son,Godtfred Kirk Christiansen,saw the great potential in Lego bricks to become a system for creative play-As the junior managing director of the Lego Group,he spent years trying to improve the \"locking\" ability of the bricks and made the bricks more versatile .In 1958, the modem interlocking brick design was finally developed and patented .\nToday Lego is sold in more than 1 30 countries.Every minute 33,824 Lego bricks are made,and kids around the world spend 5 billion hours a year playing with Lego.There will be more than 400 million people playing with Lego bricks this year.On average,every person in the world owns 62 Lego bricks,and about seven Lego sets are sold every second.\nThis year Lego fans all over the world are celebrating the 50th anniversary of the tiny building blocks.Though already 50 years old,Lego is still the same product it was in the 1950s.\nBricks bought then are still compatible  with present bricks and that is probably the reason the toy has never fallen out of favor.", "split": "train", "level": ""}
{"id": "middle5185.txt", "source_text": "In April this year, lots of bags full of small change  were seen at bus stops in Tianjin. They were made for passengers to turn their notes into small change. And such an idea came from four students from Zhongbei Middle School, Tianjin.\n\"People will surely feel worried when they take a bus without coins. We just want to do something to help them,\" said Wang Yongcun, 15, one of the four students.\nThe four boys spent their whole weekend making the change bags. After that they went to see the number of the passengers at each bus stop near their school, and then chose the top six stops to put the bags.\nMany people think that the four boys have really done a good job. But, things didn't go as the boys thought. Two days later, they found that the money was gone, and that even the bags were taken. It really made them sad but they would not give up. Their classmates and teachers came to help them in time. They put their pocket money in bags again. And the teachers also taught them to make better change bags. They tried their best to do it.\nThe four boys feel very happy because they have done something good for the passengers. Their warm hearts are moving. More and more people are beginning to join in the activity.", "split": "train", "level": ""}
{"id": "middle470.txt", "source_text": "Mr. Evens works in Sydney. Last week he had a two weeks' holiday, but he didn't know where to go. He said to his friend Robert, \"I hate the hot weather here, but I can't find a cool place in Australia. How will I take my holiday?\"\n\"That's easy,\" said Robert. \"You'd better go to Moscow. Snow and ice are covering the ground now.\"\nMr. Evens agreed with his friend. He bought an air ticket and soon arrived in Moscow. He made a happy journey  there. But one day He got into trouble. After lunch he went to a park outside the city. He saw a dog following him while he was walking past a house. It was hungry and wished him to give it some food to eat. Bad luck! He had no piece of bread or cake in his pockets. He tried to send it away, but it began to bark at him. He wanted to look for a stick but couldn't find anything except snow and ice. Suddenly he saw a stone in the ground. He tried to pick it up but he failed.\n\"How strange Russians  are!\" Mr. Evens said to himself. \"They do not tie their dogs, but firmly  tie the ground!\"", "split": "train", "level": ""}
{"id": "middle6711.txt", "source_text": "Happy Days Clud\nFor young people\nFrom 12...18 years old\nEvery Friday 7:30p.m...10:30p.m\n29 Milton Street Just PS1 a week\nParker's Sweet Shop\n14 Barrett Road 5minutes from town centre\nTry our famous chocolate eggs and sugar\nHearts\nPrices lower than in other shops\nOpen Monday--Saturday 9am.--5pm\nInternational Library\nBooks, CDs and Videos over 100 foreign\nnewspapers and magazines\nEntrance free\nMonday...Saturday 9:30--6:00p.m\nNews England House, Muswum Street\nPainting Competition\nFor young people 8...16 years old\nPaint a picture of an animal\nSend it to:\nYoung Artist Magazine\n12 High Street\nBefore 14 September and win a bicycle!", "split": "train", "level": ""}
{"id": "high1681.txt", "source_text": "The $11 billion self-help industry is built on the idea that you should turn negative thoughts like \"I never do anything right\" into positive ones like \"I can succeed.\" But was positive thinking advocate Norman Vincent Peale right? Is there power in positive thinking?\nResearchers in Canada just published a study in the journal Psychological Science that says trying to get people to think more positively can actually have the opposite effect: it can simply highlight how unhappy they are.\nThe study's authors, Joanne Wood and John Lee of the University of Waterloo and Elaine Perunovic of the University of New Brunswick, begin by citing   older research showing that when people get feedback which they believe is overly positive, they actually feel worse, not better. If you tell your friend who is slow to learn that he has the potential of an Einstein, _ . In one 1990s experiment, a team including psychologist Joel Cooper of Princeton asked participants to write essays opposing funding for the disabled. When the essayists were later praised for their sympathy, they felt even worse about what they had written.\nIn this experiment, Wood, Lee and Perunovic measured 68 students' self-esteem. The participants were then asked to write down their thoughts and feelings for four minutes. Every 15 seconds, one group of students heard a bell. When it rang, they were supposed to tell themselves, \"I am lovable.\"\nThose with low self-esteem didn't feel better after the forced self-affirmation  . In fact, their moods turned significantly darker than those of members of the control group, who weren't urged to think positive thoughts.\nThe paper provides support for newer forms of psychotherapy   that urge people to accept their negative thoughts and feelings rather than fight them. In the fighting, we not only often fail but can make things worse. Meditation   techniques, in contrast, can teach people to put their shortcomings into a larger, more realistic viewpoint. Call it the power of negative thinking.", "split": "train", "level": ""}
{"id": "high4397.txt", "source_text": "As most university students are packing their bags,boarding trains or flying home for the Spring Festival,some will stay behind to spend the holiday on campus.\nZhou Yunyun,22,a senior finance major at Jilin University,has decided that instead of traveling to Hainan province,he will kill the time by playing computer games with his online friends.\n\"I'm used to chatting and playing with them every day.It's just fun to make friends this way,\"he said.\"When I returned home in past years,my relatives always asked me a lot of questions about my plans after graduation.They had high expectations of me,which made me feel stressed,\" said Zhou.\nThe campus,usually lively,will probably turn into a death town,with most restaurants,shops and student centers closed during the break.But there are also a few advantages,according to Jia Debao,2 1,a junior majoring in administration at China Agricultural University.\"I might feel a bit lonely,but at least I can stay away from my parents' complaining and enjoy the peaceful and quiet stay,\" he said.\"More importantly,I can enjoy the high speed of the Internet,I can always find empty seats in classrooms,and I don't have to wait to use the bathroorm\" But education experts recommend students who stay on campus to come up with more interactive plans.That's because communication on the Internet can't replace real life interpersonal relationships.\nSociety has promoted a kind of\" _ \" or close-in culture among some young people, according to Shi Tongyu, a researcher at the Chinese Academy of Social Sciences. He warned that this kind of lifestyle can damage students' mental and physical development.\n\"When you constantly stare at a computer screen and type on your keyboard,you gradually lose the ability to socialize and survive normally,\"said Shi.\"A human's most important task is to survive,which cannot be completed by staying at home all the time. Instead,it must be achieved through real life experience and communication.\"", "split": "train", "level": ""}
{"id": "middle963.txt", "source_text": "The one-child policy in our country has made most families much smaller than before. That is to say, there are fewer children in a family. But the population of China is still growing faster. Why? In fact, it's a serious problem not only in China, but also in the whole world. It's reported that the world population is _ to reach 9,200,000,000 by 2050. There are two important reasons. First, there are still more and more babies born every year. Next, people in the world can live much longer than before.\nThe earth is too tired, but it has to burden  more in the future. Who can save her?\n,.", "split": "train", "level": ""}
{"id": "high22526.txt", "source_text": "Just before Mother's Day I purchased the Flex Belt for my mother to help her lose some weight. I wasn't sure if she was going to like the present but she seemed to love it. I saw the Flex Belt review on the Internet by chance and was very impressed with what I read. It seems that the Flex Belt is helping thousands of people achieve their weight loss goals.\nI asked my mother a few questions about the Flex Belt such as whether this product was easy to use, whether she felt painful while using it and the most important question was whether she lost any weight. She told me that it was so easy to use, and that even a child could operate it. She also said that in the first period of using this product she did feel that it was a little bit magical and she was pleased with the amount of weight she had lost.\nOver the past few years it seems that my fitness routine  has gone downhill . I used to enjoy going to my local gym to do a bit weight lifting, or enjoy meeting up with friends once a week for a game of soccer. Recently I noticed that I became a bit \"round\", so I have started to do some exercise by taking a thirty-to-forty-minute run every morning. I feel like the weight that I have put on especially around my midsection is slowly dropping off. Everyone knows the benefits of having a slim waist but it seems that we don't actually do anything about trying to achieve this. There are a few reasons for this, such as lack of time, not being motivated  enough, or not having enough money to join a gym. So this is the reason I think the Flex Belt is great to own.\nI am happy that my mum loves the present and because the product is working great for my mum, I've decide to get one for myself as well.", "split": "train", "level": ""}
{"id": "middle5471.txt", "source_text": "For 13-year-old Brooke Martin, seeing her golden dog Kayla has become much easier, even when she's not at home. Martin made a kind of machine--iCPooch. It allows pet owners to video chat with their pets and sends food from other places.2-1-c-n-j-y\nWhen a dog owner puts the iCPooch app on a phone, he or she can connect to the iCPooch machine at home and start talking. The owner's image  and voice will be on the screen. When the owner pushes a button on the iCPooch app, the machine will give the dog some food that has been stored inside the box.\nHow could Martin come up with the idea? The idea came to the Washington girl when she took a business class last year. That led her to think about helping her pet Kayla. Kayla always looked sad when she was left alone at home.\"I wanted to know how you could talk to your dog if you were not at home. And what if you were able to give them a treat while you were away?\" Martin explained her idea.\nNow Martin and her family have set up a company. They've had investments   from businessmen and asked a factory to make the product. They expected to sell 8,000 products by the end of 2015.\nMartin is satisfied  with her success. \"A year ago, I never thought that I would be able to start a business, or even having an idea for a business,\" she said. \"I've learned that we are supposed to hold on to your dreams.\"", "split": "train", "level": ""}
{"id": "high7578.txt", "source_text": "Science Fiction\nThe science fiction type of entertainment is considered by most to be fathered by Jules Verne (A Journey to the Center of the Earth and Twenty Thousand Leagues Under the Sea) and H. G. Wells (The Time Machine and The War of the Worlds). Sci-Fi, as it is commonly shortened, is a fictional story in which science and technology have a significant influence on the characters and plot. Many such works are guesswork about what the future holds and how scientific findings and technological advances will shape humankind.\nWriting in the late 1800s, Jules Verne was remarkably successful in his 10 guesses about future technologies of air conditioning, automobiles, the Internet, television, and underwater, air, and space travel. Unbelievably, of all places from which to choose, Jules Verne guessed Tampa, Florida, USA as the launching site of the first project to the Moon, which was only 200 kilometers away from the actual 1969 location at Cape Canaveral, Florida.\nOne of the best-known science fiction books is Nineteen Eighty-Four by George Orwell. Published in 1949, it was not meant as a prediction, but as a warning: Orwell was describing what he saw as the outcome of the ideas, trends, and emerging technologies of his time. Many invented terms from this novel have become common in everyday use, such as \"big brother\" and \"doublethink\". Even the author's name has been made into an adjective--Orwellian--and has become a warning descriptor for situations where privacy is lost and the individual becomes sacrifice under a totalitarian  government. Nineteen Eighty-Four was translated into sixty-five languages within five years of its publication, setting a record that still stands.\nWhat helps bring science fiction into being is usually a new discovery or innovation. The author creates an analysis of the potential influence and consequences and then wraps it in a pleasant story. For example, the beginning of space exploration was followed a few years later by the Star Trek television program and movie series. Advances in genetics  cause fantasies of the end of disease, horrors of eugenics , and thrillers where creatures disappearing long ago are brought back to life. The science fiction author's self-determined role is that of field glasses for humanity--searching the world of future possibilities upon the road which we are traveling.", "split": "test", "level": ""}
{"id": "high18463.txt", "source_text": "About influenza  A(H7N9) virus\nWhat is the influenza A(H7N9) virus?\nInfluenza A H7 viruses are a group of influenza viruses that normally spread among birds. The influenza A(H7N9) virus is one smaller group among the larger group of H7 viruses. Although some H7 viruses (H7N2, H7N3 and H7N7) have sometimes been found to infect  humans, no human infections with H7N9 viruses have been reported until recent reports from China.\nWhat are the main signs of human infection with influenza A(H7N9) virus?\nSo far, most patients with this infection have had severe pneumonia . Signs include fever, cough and shortness of breath. However, information is still limited about the full area of disease that infection with influenza A(H7N9) virus might cause.\nHow did people become infected with the influenza A(H7N9) virus?\nSome of the confirmed cases had connections with animals or with an animal environment. The virus has been found in a pigeon in a market in Shanghai. It is not yet known how persons became infected. The possibility of animal-to-human spread is being looked into.\nIs it safe to eat meat like chicken and pork products?\nInfluenza viruses are not spread through eating well-cooked food. Because influenza viruses are made inactive by normal temperatures used for cooking (so that food reaches 70degC in all parts), it is safe to eat properly prepared and cooked meat. Diseased animals and animals that have died of diseases should not be eaten. In areas experiencing outbreaks, meat products can be safely eaten only if they are properly cooked and properly handled during food preparation. The eating of raw meat and uncooked blood-based dishes is a high-risk practice and should be discouraged.\nIs it safe to travel to China?\nThe number of confirmed cases in China is very low. WHO does not advise the application of any travel measures with respect to visitors to China, nor to persons leaving China.\nAre Chinese products safe?\nThere is no evidence to link the present cases with any Chinese products. WHO advises that people should not fear to trade them at this time.", "split": "train", "level": ""}
{"id": "high19197.txt", "source_text": "In 11 states across the United States, school buses are now doing more than just sending students. They also carry advertisements on the outside.  Restaurants, companies, banks, and other businesses pay for the ads, hoping to attract more customers. Anci it's a way for the schools to make money.\n\"We've seen a lot of income produced by the advertisements,\" said Devra Ash, who is the spokesperson for School District 11 in Colorado Springs, Colorado. She is also the mother of a third grader.  Last year, District 11 made more than $ 15,000 from school-bus ads.Besides Colorado, states such as Arizona, New Jersey, and Texas allow ads on the outside of their school buses. The idea appears to be spreading. In Georgia, some school district leaders are suggesting putting ads on their buses ioo.\nSchool districts need to make sure that the ads are proper for kids, according to Michael Beauchamp, an officer of Alpha Media. This company works with businesses in several states to create ads for school buses. \"The districts won't allow ads for things like beer, cigarettes,or politics,\" Beauchamp said.\nBut not everyone is in favor of school buse.s having ads on the outside. That includes Georgia's Department of Education. Spokeswoman Dorie Nolt said, \"We strongly believe that advertising on the outside of school buses distracts  drivers and children. \"\nParents also hold different opinions about this. \"If the advertisements can bring in money  for the schools and help save some programs, that is great. \" said Glenn Herdling of River Vale, New Jersey.  His son is in second grade.\nCindy Tomarchio of East Windsor, New Jersey, feels differently. \"I know the schools can use the money, but kids already see enough advertising every which way they turn,\" she said.", "split": "train", "level": ""}
{"id": "middle5412.txt", "source_text": "How do you study each day? You may answer it in one second: have classes at school, take notes and do homework. Feeling a little bored? There are other ways that can make learning interesting and varied. It's called digital learning.\nDigital learning is a way to help students learn by using the Internet. There are three important kinds of digital learning. Apps are computer software applications  . People can download them on their mobiles. The other two kinds are social networking services, including weibo and WeChat and websites. Every one of them is like your teacher. They help you _ what you learn at school.\nCompared with traditional learning ways, digital learning has its advantages. Digital learning is also varied. It covers almost every school subject. More importantly, it always offers students the newest resources   to learn from.\nDigital learning is also personalized. You can choose what you like to learn. If you don't master what you have learned at school, you can learn again through digital ways.\nHowever, digital learning also has disadvantages. When you use digital ways to learn, you've got little chance of talking with teachers and classmates. As digital learning uses computers or smartphones, watching the screen too long may be bad for your eyes. It is better to take a rest every 20 minutes.", "split": "train", "level": ""}
{"id": "middle4636.txt", "source_text": "Long ago in a small village, there was a place. It is famous for the House of 1000 Mirrors.\nA small, happy little dog learned of this place and decided to visit. When he arrived, he jumped happily up the stairs  to the doorway  of the house. He looked through the doorway with his ears lifted high  and his tail  wagging  as fast as it could. To his great surprise, he found himself looking at 1000 other happy little dogs with their tails wagging just as fast as his. He smiled a great smile, and was answered with 1000 great smiles just as warm and friendly. As he left the house, he thought to himself, \"This is a wonderful place. I will come back and visit often.\"\nIn the same village, another little dog, who was not quite as happy as the first one, decided to visit the house. He slowly climbed the stairs and hung  his head low as he looked into the door. When he saw the 1000 unfriendly-looking dogs looking back at him, he _ at them and was afraid to see 1000 little dogs growling back at him. As he left, he thought to himself, \"That is a terrible place. I will never go back there again.\"\nAll the faces in the world are mirrors. What kind of reflections  do you see in the faces of the people you meet?", "split": "train", "level": ""}
{"id": "high21945.txt", "source_text": "I can't remember a winter being as cold as this in Pennsylvania, but I'm sure there were colder days.\n         Even though the daylight hours are growing longer minute by minute, it's easy to find an excuse not to go out unless you  ly must, but then again I often have to push myself to accomplish things.\n         People I speak to have been in all kinds of  _ moods. They say they're \"under the weather,\" not feeling good about this time of year.\n         As I stood outside with my two dogs yesterday, it was so cold that my nose and face felt frozen and my ears were stinging.\n         Of course, that doesn't matter to Ricky and Lucy. They have a routine they must go through to find just the fighting spot no matter how cold or hot it is.\n         So I wait.\n         But this time it was different. As cold as it was, I suddenly was excited thinking about how wonderful this extreme cold really was.\n         Then the sun broke through the clouds and memories of summer's extremely hot days flashed through my mind. I could remember standing in the heat of the afternoon, with sweat pouring down my brow and the hot, burning sun against my face. I reminded myself then and there that in the cold of the winter I would wish I had this heat.\n         I was grateful for the extremes. Without the extremes in my life, I would never appreciate the days when things were just right. Without the extremes, life would be boring.\n         It's being pushed to one of the extremes that makes us appreciate the middle more. Health challenges remind us that we need to pay more attention to how we live. Financial extremes remind us that when things go smoothly it's also time to save for raining days. ks5u\n         I've come to the conclusion that all too often I find a reason not to be happy with where I am at that moment.\n         Whether it's hot or cold, good health or bad, in the money or out of it, I always\nwant it to be different.\n         I'm tired of being \"Under the Weather!\"", "split": "train", "level": ""}
{"id": "middle6773.txt", "source_text": "One day, in an English class, the students are doing their lessons. Their teacher, a young woman, is very happy. She sings some nice songs with them and then she goes to the blackboard and writes \"SMILES\" on it.\n\"This is the longest word in English, \" she says to the class.\nA girl stands up and says, \"It has only six letters. How can it be the longest word in English?\"\nThe teacher smiles and says, \"Oh, look! There is a mile  between the first letter and the last one. \"", "split": "train", "level": ""}
{"id": "high17830.txt", "source_text": "\"It is high time someone explained to you about good manners. Yours are obvious by their absence and I feel sorry for you.\"\nThese were the words that Carolyn Bourne e-mailed to her son's fiancee , Heidi Withers. The couple had just visited the Bourne family home in England.\nWithin days, the e-mail was all over the Internet, and the subject of manners hit UK national news.\nHeidi, Mrs Bourne said, stayed in bed too late. She complained when she was hungry and was particular about food. She told rude jokes. Finally, she had never thanked Mrs Bourne for the weekend. \nBut it wasn't just Heidi's behavior that got people talking. Facebook groups started up about the e-mail. The one with the most members was called \"Carolyn Bourne needs to learn some manners\". \nPeople said Mrs Bourne had been too direct. They thought she had been cruel when she told Heidi to go to \"finishing school\" -- a centre where badly-behaved young women used to be sent. Heidi's father wrote back to Mrs Bourne and called her a \"snotty   Miss Fancy Pants\" -- someone who thinks they are socially better than anyone else. Everyone agreed that there are rules of \"good\" and \"bad\" behavior. Everyone agreed that these rules had been broken. However, no one could agree what these rules were -- or whether Heidi or Mrs Bourne was in the wrong.\nSo what does politeness really mean? Is there a secret to social etiquette  ? Shirley Schomaker runs a real-life finishing school. She said that both Mrs Bourne and Heidi had been impolite. The true secret, she said in a BBC interview, lies in making everyone feel comfortable.\n\"Social etiquette isn't about being snotty and being in the know  ,\" she said. \"It's about making other people feel good. It's about communication. It's about making society get along better.\"", "split": "train", "level": ""}
{"id": "high20826.txt", "source_text": "Marjorie Gestring\nMarjorie Gestring was a springboard  diver from the United States who won the gold medal in 3-meter springboard diving at the 1936 Summer Olympics in Berlin, Germany at the age of 13 years. With the cancellation  of the Olympics in 1940 and 1944 because of World War II, Gestring did not get a chance to defend her title, and her comeback attempt for the 1948 Summer Olympics failed. \nBob Mathias\n17-year-old American Bob Mathias won the decathlon  only four months after taking up the sport. He is the youngest athlete in Olympic history to win a men's track and field event. By the time Mathias retired from decathlon competition in 1952, he had nine victories in nine competitions. He had won two gold medals separately in 1948 and 1952. In 1954 a film about his early life called The Bob Mathias Story was made, in which he and his wife played themselves.\nFu Mingxia\nFu Mingxia was born on August 16, 1978 in Wuhan, Hubei Province. At an early age, her father taught her to swim at a nearby river. She started exercising gymnastics at age 5, soon turning to diving. Fu Mingxia left home at age 9 to train in Beijing. In the 1992 Summer Olympics held in Barcelona, Fu Mingxia became China's youngest Olympic champion ever when she won the 10-meter platform gold at the age of 13.\nIan Thorpe\nIan Thorpe was born on 13 October, 1982. He is a former Australian freestyle swimmer. At the age of 14, he became the youngest male ever to represent Australia. Ian Thorpe, 17 years old, won the gold medal in the 400m freestyle by breaking his own world record in Sydney 2000. He has won five Olympic gold medals.", "split": "train", "level": ""}
{"id": "high11301.txt", "source_text": "No one really knows how and why people change as they get older. Also, no theory sufficiently explains all the changes of the aging process. Aging is a complex and varied process that varies in how it affects different people and organs. In fact, even in one person , different organ systems \"age \" at a different rate.\nAt a certain point in our lives our body systems will begin to weaken . It may become more difficult for us to see and hear. The slow change of aging causes our bodies to lose some of their ability to _ from disease and injury. In order to live longer , we have always tried to slow or stop this change that leads us toward the end of our lives.\nMany factors decide our health . A good diet plays an important role. The amount and the type of exercise we get are another two factors. Our living condition is yet another. But scientists studying the aging problem want to know: Why do people grow old? They hope that by studying the aging medical science they may be able to make the length of life longer.\nThere is nothing to be afraid of as the old age comes. Many consider the later part of life to be the best time for living. Physical activity may become less, but often we get better understanding of the world and ourselves.\nWhat we consider the old age now may only be middle-aged some day soon. Who knows ,with so many advances in medical science happening so quickly, life length may one day be measured in centuries ,rather than in years!", "split": "train", "level": ""}
{"id": "high14913.txt", "source_text": "As jewelry designers,my sister Jodie and I are always traveling for work.We need to go to a lot of shows,so we can't pack lightly and usually bring about four suitcases filled with our work.\nMost of our stuff is made from heavy materials and metals.So part of the routine for us when we fly is getting stopped by security.Our jewelry sets off the alarms,and we've become accustomed to arriving early to go through private screenings.Most of the time,it's not troublesome.\nHowever,on our recent trip to a Paris trade show,we were stopped at security and asked to empty our bags. One of the agents walked over to another agent and they started whispering to each other.Both gentlemen came back,and one of them then told us that it seemed that we were carrying a very dangerous object.\nMy sister and I just said,\"Huh?\"Of course,we were a little concerned,thinking that maybe someone put something dangerous in one of our bags when we weren't looking.\nOne of the agents then started to unpack our bags.I kept asking what he was 1ooking for and then the object in question finally appeared.It was our Cosima necklace.It's a piece of jewelry,with large,metal triangular spikes.\nMy sister and I 1ooked at each other and breathed a huge sigh of relief.We started laughing and explained to the two male agents that it was just a necklace from our collection.not a weapon of mass destruction.They thought we were lying,and one agent kept repeating that he believed it was a weapon.\nI tried to explain that we were jewelry designers going to a trade show,and this was simply a piece from our collection.But the agents didn't _ it.Then a few women guards came over to assist.One of the women guards was holding an earring up to her ear and another was trying on a ring.Apparently,they liked our stuff.\nIt was only at this point that the male guards gave up.And I think they also got tired of listening to a bunch of women talk about jewelry.They let us through.\nWe took the names of the women agents and sent them a piece of jewelry when we got back to say thanks.", "split": "train", "level": ""}
{"id": "middle3216.txt", "source_text": "You are going to high school, aren't you? Maybe you don't know what to do. Well, here's a list of the top six things to do when you are in high school. These things will give you ideas of what your high school life could be like. Here you go!\n1 Find your passion  and what kind of person you are: Whether it's dance, basketball, or drawing, the important thing is that you have found something you are interested in.\n2 Talk to people you wouldn't usually talk to: meet new people, find new friends and even talk to people you don't like. It will show what a great person you are. You never know what will happen after high school.\n3 Take part in at least one contest : This will give you tears of laughter, happiness and memories.\n4 Get a job: This will help you see what it's like to have responsibility . It can also help you make a little money to spend on yourself.\n5 Take a trip with your friends: It doesn't matter where you go or what you do, the memories will happen on the way and go on till the final place.\n6 Do your best at school: Don't ever get lazy; working hard now will help you in the future.", "split": "train", "level": ""}
{"id": "high23191.txt", "source_text": "Early that day the weather turned and the snow was melting into dirty water. Streaks of it ran down from the little shoulder-high window that faced the backyard. Cars slushed by on the street outside, where it was getting dark. But it was getting dark on the inside too.\nHe was in the bedroom pushing clothes into a suitcase when she came to the door.\nI'm glad you're leaving! I'm glad you're leaving! She said. Do you hear?\nHe kept on putting his things into the suitcase.\nSon of a bitch! I'm so glad you're leaving! She began to cry. You can't even look me in the face, can you?\nWhen she noticed the baby's picture on the bed and picked it up.\nHe looked at her and she wiped her eyes and stared at him before turning an d going back to the living room.\nBring that back, he said.\nJust get your things and get out, she said.\nHe did not answer. He fastened the suitcase, put on his coat, looked around the bedroom before turning off the light. Then he went out to the living room.\nShe stood in the doorway of the little kitchen, holding the baby.\nI want the baby, he said.\nAre you crazy? No, but I want the baby. I'll get someone to come by for his things.\nYou're not touching this baby, she said.\nThe baby had begun to cry and she uncovered the blanket from around his head.\nOh, oh, she said, looking at the baby.\nHe moved toward her.\nFor god's sake! She said. She took a step back into the kitchen.\nI want the baby.\nGet out of here!\nShe turned and tried to hold the baby over in a corner behind the stove.\nBut he came up. He reached across the stove and tightened his hands on the baby.\nLet go of him, he said.\nGet away, get away! She cried.\nThe baby was red-faced and screaming. In the scuffle they knocked down a flowerpot that hung behind the stove.\nHe crowded her into the wall then, trying to break her grip. He held on to the baby and pushed with all his weight.\nLet go of him, he said.\nDon't, she said. You're hurting the baby, she said.\nI'm not hurting the baby, he said.\nThe kitchen window gave no light. In the near-dark he worked on her fisted fingers with one hand and with the other hand he gripped the screaming baby up under an arm near the shoulder.\nShe felt her fingers being forced open. She felt the baby going from her.\nNo! She screamed just her hands came loose.\nShe would have it, this baby. She grabbed for the baby's other arm. She caught the baby around wrist and leaned back.\nBut he would not let go. He felt the baby slipping out of his hands and he pulled back very hard.\nIn this manner, the issue was decided.", "split": "train", "level": ""}
{"id": "middle5103.txt", "source_text": "A group of reporters asked a group of 4-to-8-year-old children this question, \"What does love mean?\" The answers were surprising. The children would answer like they did below.\nRebecca --- age 8\n\"When my grandmother hurt her knees , she couldn't bend   over and paint her toenails   any more. So my grandfather would do it for her all the time, even when his hands hurt, too. That's love.\"\nSamantha --- age 6\n\"Love is when someone hurts you, and you get so mad but you don't shout at her because you know it would hurt her feelings.\"\nTerry --- age 4\n\"Love is what makes you smile when you're tired.\"\nBethany --- age 4\n\"I let my big sister pick on   me because my Mum says she only picks on me because she loves me. So I pick on my baby sister because I love her.\"\nLauren --- age 4\n\"I know my elder sister loves me because she gives me all her old clothes and has to go out and buy new clothes.\"\nElaine --- age 5\n\"Love is when Mummy gives Daddy the best piece of chicken.\"\nClear --- age 5\n\"My Mummy loves me more than anybody. You don't see anyone else kissing me to sleep at night.\"\nJessica --- age 8\n\"You really shouldn't say 'I love you' unless you mean it. But if you mean it, you should say it a lot. People forget.\"", "split": "train", "level": ""}
{"id": "high13041.txt", "source_text": "There is one holiday in the year which is completely American, Thanksgiving Day. It is the day when everyone goes back home to spend the day with his family, to have the traditional Thanksgiving dinner of roast turkey, to talk about old times.\nThis is a story of Thanksgiving Day and of one man's efforts, under rather special circumstances, to carry on these traditions.\nOld Pete took his seat this day on his usual bench in Union Square. Every Thanksgiving Day for nine years, Pete had taken this same seat exactly at one o'clock, and each time the same pleasant thing had happened. But this time Pete had come here more from habit than from hunger.\nCertainly today Pete was not hungry. He had just had a dinner so enormous that he could hardly breathe. The buttons on his ragged shirt and coat were about to burst. He was so full of soup, oysters, roast turkey, apple pie, ice cream, and a dozen other rich foods that the November breeze and the first light fall of snow felt cool and pleasant to his face.\nThe meal had been completely unexpected. He had been passing one of the large homes on Fifth Avenue, where there lived two rich old ladies. It seems that it was their custom each Thanksgiving to place a servant at the front entrance with orders to bring in the first hungry looking person that passed and then give him a Thanksgiving dinner of everything he could eat. On this particular Thanksgiving Day, Pete had passed, the servant had brought him in, and, before Pete knew it, he was being served like a king with more food than he could eat.\nPete sat on the bench now, hardly able to move. He happened to look to the left and there in the distance he saw the Old Gentleman coming toward him. He wanted to get up and run, but he was so full of food that he stayed right there. Every Thanksgiving Day for nine years, the Old Gentleman had come here, and found Pete on this same bench, and then taken him to a restaurant and bought him a Thanksgiving dinner. It was a kind of tradition which the Old Gentleman, who had no family and lived alone, had tried to continue. The old man was tall and thin and sixty years old. He was aristocratic looking and he always dressed in black. His hair was whiter and thinner than it had been the year before, and he leaned more heavily on his cane than he used to.\n\"How do you do!\" said the Old Gentleman. \"I am glad to see that the changes of another year have permitted you to move in health through this beautiful world.\"\nEach time the Old Gentleman had said exactly this same thing. It was part of the tradition. Old Pete, too, began to feel as though he himself was now a part of the tradition, and he therefore did not have the courage to tell the old man that he had already eaten. This dinner seemed to mean so much to the Old Gentleman.\n\"Thank you, sir,\" said Old Pete at last. \"I'll go with you gladly. I'm very hungry sir.\"\nTogether the Old Gentleman and Pete walked south to the same restaurant where each year Pete had his Thanksgiving dinner. They sat at the same table. The Old Gentleman seemed pleased and happy. When the waiter brought dish after dish of food to Pete, the Old Gentleman sat quietly and smiled. Under the circumstance, Pete had to eat. It was part of the tradition, and so he ate like a hero. Soup, oysters, roast turkey, pie, he ate everything, although when he entered the restaurant even the smell of more food almost made him sick. At last Pete leaned back with the battle won.\n\"Thank you sir,\" he said, with some effort, \" for a fine dinner.\"\nThey parted as they did each year at the door, the Old Gentleman going south, Pete north.\nAround the corner, Pete stopped for a moment, felt a terrible pain in his stomach, then fell to the sidewalk unconscious. A little later an ambulance came. In the hospital they discovered that he had had an attack of indigestion.\nAn hour later, another ambulance brought the Old Gentleman to the same hospital. At first they thought it was also indigestion but later one of the nurses said,\n\"That nice old gentleman over there-- you wouldn't think that it was a case of starvation. Proud old family, I suppose. He told me that he hadn't eaten a thing for three days.\"", "split": "train", "level": ""}
{"id": "high18767.txt", "source_text": "Martha Graham, born in 1894, was one of the most famous dancers and creators of dance, whose influence on dance has been compared with the influence Picasso had on the modern visual arts, Stravinsky had on music, or Frank Lloyd Wright had on architecture. She created almost two hundred dance pieces. She is often called the Mother of Modern Dance.\nEarlier in her life, however, Martha did not know that she would become a dancer. At that time, the dancers were looked down on. So Martha's parents didn't approve of her desire to dance at the beginning. Until 1916, she began her studies at the newly created Denishawn School of Dancing and Related Arts, founded by Ruth St. Denis and Ted Shawn, where Graham worked very hard to improve her ability to dance because she was considered too old to begin dancing.\nIn 1936, Graham made her defining work, \"Chronicle^, which signaled the beginning of a new era in modern dance. The dance brought serious issues to the stage for the general public in a dramatic manner. Influenced by the Wall Street Crash of 1929, the Great Depression that followed, and the Spanish Civil War, it focused on depression and isolation, reflected in the dark nature of both the set and costumes.\nGraham continued to dance past the age of seventy. Once again, she was met with criticism from people who came to watch her shows. But she didn't give up. Her last completed ballet was 1990's Maple Leaf Rag. \"A Dancer's World\" is an introduction to Graham and her work. She tells about her dances and her dance group shows some of their methods.\nMartha Graham received many awards during her lifetime, including the Presidential Medal of Freedom in nineteen seventy-six. She was the -first dancer to receive the country's highest civilian  honor. She died in 1991 at the age of ninety-six. In 1998, Time magazine listed her as the \"Dancer of the Century\" and as one of the most important people of the twentieth century.", "split": "train", "level": ""}
{"id": "high5528.txt", "source_text": "Proudly reading my words, I glanced around the room, only to find my classmates with big smiles on their faces and tears in their eyes. Confused, I glanced toward my stone-faced teacher. Having no choice, I slowly raised the report I had worked on, hoping to hide myself. \"What could be causing everyone to act this way?\"\nQuickly, I flashed back to the day Miss Lancelot gave me the task. This was the first real task I received in my new school. It seemed simple: go on the Internet and find information about a man named George Washington. Since my idea of history came from an ancient teacher in my home country, I had never heard of that name before. As I searched for the name of this fellow, it became obvious that there were two people with the same name who looked completely different! One invented hundreds of uses for peanuts, while the other led army across America. I stared at the screen, wondering which one my teacher meant. I called my grandfather for a golden piece of advice: flip   a coin. Heads--the commander, and tails--the peanuts guy. Ah! Tails, my report would be about the great man who invented peanut butter, George Washington Carver.Weeks later, standing before this unfriendly mass, I was totally lost. Oh well, I lowered the paper and sat down at my desk, burning to find out what I had done wrong. As a classmate began his report, it all became clear, \"My report is on George Washington, the man who started the American Revolution.\" The whole world became quiet! How could I know that she meant that George Washington?\nObviously, my grade was terrible. Heartbroken but fearless, I decided to turn this around. I talked to Miss Lancelot, but she insisted: No re-dos; no new grade. I felt that the punishment was not justified, and I believed I deserved a second chance. At last, I worked very hard for the rest of the school year.\nTen months later, that chance came as I found myself sitting in the headmaster's office with my grandfather, now having a completely different conversation. I smiled and flashed back to the embarrassing moment at the beginning of the year as the headmaster informed me of my chance to skip the sixth grade. Justice is sweet!", "split": "train", "level": ""}
{"id": "middle4254.txt", "source_text": "This is a picture of Kate Green's family. In the picture we can see her grandparents, herparents, her brother Mike and her. Her grandparents are on the chair. Mr Green and Mrs  Greenare behind them. Mike is under the window.  Kate is on the floor. What's behind Kate? It's a cat. It's black and white.", "split": "train", "level": ""}
{"id": "high21887.txt", "source_text": "DOYLESTOWN STATION, Pa.(CBS)--Marie Buonanno has boxes of holiday lights to decorate her house.She already has one tree up in her living room and a nativity scene.But this holiday season, she would not dare decorate outside.\n\" It is very disappointing that we can' t celebrate the Christmas holiday the way that we religiously choose to,\" says Buonanno.\nHer home only has a holiday wreath on the door, since the Doylestown Station Condominium Association told her the bylaws do not allow color1ed Christmas lights.Last year, she was fined $400, $ 10 for each day her lights were up.But she says  _ .\n\"One of my neighbors that I spoke to a few days ago, who decorates with multicolor1ed lights, says he never got a letter of warning or a fine.\"\nOnly white, non-blinking lights are allowed outside.And you can only put up a single white, blue, or orange light in your windows.Neighbors collected 62 signatures to ask the Association board to allow color1ed Christmas lights.In response, the Association sent out a survey.\nOut of 38 total responses, 19 voted for white lights, 14 voted for color1ed non-blinking lights, and 5 voted for color1ed blinking.The board said the vote was 19-14 against color1ed lights, interpreting the 5 votes as a separate category.\n\"As long as it\" s tasteful,\" says neighbor Marc Udell, \"let the community do what the community is going to do.\"\nNo one answered the door at the Association president* s house.Some neighbors say they like the look of white lights.\n\"Some color1ed lights are pretty and they have their place in neighborhoods, but you never really know how far people are going to go with them,\" says Jeff Edwards.\nIt will be a holiday of white lights for Buonanno and her neighborhood.She says for now she will miss her color1ed lights and the holiday cheer they brought to her home.", "split": "train", "level": ""}
{"id": "high17944.txt", "source_text": "The great white shark is the largest shark and is probably the most well-known and feared shark. The great white shark is gray or bluish above and white below. The largest Great Whites can reach lengths of 22 feet and weigh up to 5,000 pounds. The Great White has massive teeth, which are positioned in rows. When the Great White attacks, it bites its prey and shakes its head back and forth. The serrated teeth act as a saw and literally tear the victim apart. Actually the Great White Shark often swallows many of its own teeth in an attack.\nGreat Whites employ several hunting skills depending on the prey. Most of the time, the shark will remain still underwater before attacking its prey from underneath. In the case of hunting some kinds of seals, the impact of the shark is so powerful that it knocks both the shark and the seal clear out of the water. With larger prey such as elephant seals, the shark will simply take a huge bite out of it and wait for it to bleed to death. When hunting dolphins, the shark will attack from above, to avoid detection from the dolphin's echolocation.\nInterestingly, a Great White Shark has never been observed giving birth. However, pregnant females have been caught. The Great White Shark is known to be ovoviviparous. Females give birth to eight or nine pups that are already about five feet in length upon birth, which is different from other egg-laying animals.\nDespite the fear of Great White Sharks, at least in part generated by Steven Spielberg's 1975 movie, Jaws, Great White Sharks do not target humans as prey. Most attacks are attributed to mistaken identity. Sharks can easily mistake humans for seals. Many human injuries caused by Great White Sharks are cases of test-biting. If a shark is unsure about a floating object, it often gives it test bite to determine what kind of object it is. While such bites do little damage to buoys  and other objects, they obviously can cause serious damage on the human body.", "split": "train", "level": ""}
{"id": "middle3215.txt", "source_text": "How should one invest a sum of money in these clays of inflation  ? Left in a bank it will hardly keep its value, however high the interest rate. Only a brave man, or a very rich one, dares to buy and sell on the Stock Market. Today it seems that one of the best ways to protect your savings, and even increase your wealth is to buy beautiful objects from the past. Here I am going to offer some advice on collecting antique clocks, which I personally consider are among the most interesting of antiques.\nI sometimes wonder what a being from another planet might report back about our way of life. \"The planet Earth is ruled by a mysterious creature that sits or stands in a room and makes a strange ticking sound. It has a face with twelve black marks and two hands. Men can do nothing without its permission, and it fastens its young round people's wrists so that everywhere men go they are still under its control. This creature is the real master of Earth and men are its slaves .\"\nWhether or not we are slaves of time today depends on our culture and personality, but it is believed that many years ago kings kept special slaves to tell the time. Certain men were very clever at measuring  the time of clay according to the beating of their own hearts. They were made to stand in a fixed place and every hour or so would shout tire time. So it seems that the first clocks were human beings.\nHowever, men quickly found more convenient and reliable  ways of telling the time. They learned to use the shadows cast by the sun. They marked the hours on candles, used sand in hour- glasses, and invented water-clocks. Indeed, any serious student of antique should spend as much time as possible visiting palaces, stately homes and museums to see some of the finest examples of clocks from the past.\nAntique clocks could be very expensive, but one of the joys of collecting clocks is that it is still possible to find quite cheap ones for your own home. After all, if you are going to be ruled by time, why not invest in air antique clock and perhaps make a future profit ?", "split": "train", "level": ""}
{"id": "middle3312.txt", "source_text": "My husband and I had just opened up a pet sitting business earlier that year. Our customers had slowly risen from three to thirty a month. We were busy through those hot summer months, driving between visits. Our work was strictly done at the pet owner's home. It was almost too busy for the two of us, but we were making good money!\nWe asked pet owners new to our business to phone two weeks ahead so we had enough time to meet the owners and pets at their homes and make any following meetings before the owner leaves.\nOne day, we decided to take on a new customer just two days before they would leave. We met the family, filled in a form, and spent some time with their dog, Hercules. He playfully jumped on us and touched our hands and arms using his tongue. The family laughed as he did this, showing us that he was very loving.\nTwo days later I appeared at the house, alone. I came up to Hercules and said hello happily. I filled up his water bowl and cleaned any messes he made. Meanwhile, he was so lovely sitting beside. I thought this would be the good picture to send to the owners as usual. After the light and \"click\" sound went off, Hercules rushed at me. I didn't know what had just happened until I noticed the drops of blood. I ran out and did the only thing--calling my husband.\nThen I went to neighbors for help. My husband arrived after ten minutes. The helpful neighbor and my husband led Hercules back into his pen . Then my husband and I took off to the hospital.\nI must have looked like I was shot when I walked into the hospital. The nurses quickly moved me to a room. I asked the doctor in a weak but playful manner, \"Am I going to die?\" He replied, \"Finally.\"", "split": "train", "level": ""}
{"id": "middle5442.txt", "source_text": "Dear Mom,\nI'm sorry that I can't go back home for Mother's Day next week. On that day, I'll have to go to an important meeting for my boss, who helps me a lot with my work and life here. But I'll find time to see you at home soon.\nMom, thank you for everything you've done for Tim and me. After Dad died of a heart attack at home ten years ago in a road accident, you had to work in a supermarket in the daytime and in a restaurant at night. But you always gave us two your love and care. Though you don't have to work now, I still remember your coming home and feeling tired many evenings.\nTim is going to finish his studies next month. He said he would move back from school and look for a job near home. I'm glad you won't live by yourself any more. Let's plan to take a trip in the near future. It's been years since the three of us took a trip together.\nHappy Mother's Day. I love you, Mom.\nBest wishes,\nDavid", "split": "train", "level": ""}
{"id": "high18516.txt", "source_text": "Doctors sometimes prescribe light therapy to treat a form of depression in people who get too little morning sun. But too much light at other times may actually cause such mood disorders. Long-lasting exposure to light at night brings depression, a new study finds, at least in animals.\nThe new data confirm observations from studies of people who work night shifts, says Richard Stevens of the University of Connecticut Health Center. Mood disorders join a growing list of problems, including cancer, obesity and diabetes--that can occur when light throws life out of balance by disturbing the biological clock and its timing of daily rhythms.  www.ks5u.com\nIn the new study, Tracy Bedrosian and Randy Nelson of Ohio State University exposed mice to normal light and dark cycles for four weeks. For the next four weeks, half of the mice remained on this schedule, and the rest received continuous dim light throughout their night. Compared with mice exposed to normal nighttime darkness, those getting dim light at night lost their strong preference for sweet drinks, \"a sign they no longer get pleasure out of activities they once enjoyed, \" Bedrosian says.\nIn a second test, mice were clocked on how long they actively tried to escape a pool of water. Those exposed to night lights stopped struggling and just floated in the water, a sign of \"behavioral despair\",10 times as long as the mice that had experienced normal nighttime darkness. All symptoms of depression disappeared within two weeks of the mice returning to a normal light-dark cycle, the researchers report. The scientists also could quash the behavioral symptoms by injecting   the brains of animals with a drug that prohibits the activity of certain molecules linked with human depression. This finding further suggests that light at night may cause something related to depression.\nHuman studies linking nighttime light and mood disorders are important but can't easily detect molecular underpinnings   as animal studies can,says George Brainard of Thomas Jefferson University. The new work, he says, suggests that the change of the biological clock by light at night can be \"an extremely powerful force in regulating biology and behavior. \"", "split": "train", "level": ""}
{"id": "middle4507.txt", "source_text": "Island University has a competition for middle school students.\nRead about the competition on their website.\nSchool Competition\nStudents! Here is your chance to help the physically disabled. Think out a robot or a machine to help them live better. There'll be three prizes. The winning schools each will get $ 15,000. Read the information below:\nWhat do you have to do?\n* Try to know problems faced by the physically disabled in Hong Kong. Write a 200-word article on the difficulties these people have to suffer each day.\n* Try to know modern inventions that help the physically disabled. Then think out a robot or a machine that will improve the lives of the physically disabled. Draw your invention. You can make as many drawings as you like to show your invention. You can even make a small model of your invention\n* Write a short description of your invention\nWho-can join? All middle school students in Hong Kong. So, come on! Join the competition, and get the chance!", "split": "train", "level": ""}
{"id": "high5469.txt", "source_text": "TAIBEI - Increasing numbers of Taiwanese students are joining the island's \"China rush\", seeking education on the Chinese mainland.\nAccording to official Chinese figures, the number of Taiwanese students admitted into college and postgraduate programs on the mainland totaled 461 in 1996, 928 in 1997 and 839 in 1998.Although no latest official numbers were available,\" Netbig.com Said this number had risen between 30 to 50 percent annually in the past two years with well over 1000 entering mainland campuses last year.\nThe Internet site, based in the Chinese city of Shenzhen, provides education service and information on Chinese mainland colleges and universities. \"Many Taiwanese believe a Chinese education giving more knowledge about the people and culture in the mainland will increase their chances in the Chinese job market, Net.com vice-president Ingrid Huang said.\"I believe _ will give me hands-on experience in the business field in the Chinese mainland and a better understanding of the Chinese mainland people,\" said Lydia Chang, a 19-year-old majoring in journalism at Shih Shin University. Chang plans to go on to get a master's degree in business administration in Shanghai, which she says offers the best environment for such studies.\nA journalism graduate student, surnamed Lin, at the National Taiwan University said he would like to study law on the Chinese mainland since \"there will be better career prospects now that more Taiwanese companies are going there\". \"They hope the children could build up connections which could later become useful in their business operations,\" said Yang Ching-yao, professor of the Chinese mainland studies. A Netbig.com survey showed the campuses favored by Taiwan students included Beijing, Qinghua and Renmin universities in Beijing, and Jinan and Zhongshan universities in Guangzhou. The most popular studies were law, business and Chinese medicine.\nAt present, Chinese Taibei doesn't recognize diplomas earned in the Chinese mainland nor help with any inquiries about studying there. But recognizing the trend, education authorities are giving a final form to a policy accepting certificates from selected universities.", "split": "train", "level": ""}
{"id": "middle2099.txt", "source_text": "Peter and I are good friends. Peter is an American boy. I am a Japanese girl. He is thirteen. I am twelve. We are in the same class,Class Two.\nPeter has a nice clock. He likes it very much. He puts it on his desk. Every morning it wakes him up . I have a new watch. It looks beautiful. I wear it every day. It tells  me the time.", "split": "train", "level": ""}
{"id": "high4917.txt", "source_text": "Not many people can say that they have lived in two totally different environments, and technically neither can I. I have lived in the same house in the same Connecticut town my whole life, but a lot of my childhood and teenage years have been spent visiting my family in New York City.\nWethersfield is a typical New England town, a small close community   where almost everyone knows your name. My friends all go to the same high school and my parents are friendly with my friends' parents. Most of my friends don't realize what life is like outside this little town. Maybe every so often a few take a day trip to Manhattan or Boston, but none really knows what it's like to live in an urban environment.\nMy parents are both from New York City and since they have _ and friends who still live there, we visit a lot. From an early age I have been exposed to urban life. Jeff, one of my cousins, lives with his mother in a one-bedroom apartment in Brooklyn. He has never had his own room and has always been very much on his own. I don't think any of my friends could understand how someone could live like that. www.zxxk.com\nWhen I go to the city I see things I would never see in my hometown. I see poverty and people struggling to make a living. I observe a whole different pace; there, you're just one guy living with millions of others who will never know your name.\nI feel blessed to have experienced the lifestyles of two completely different places. I am grateful for the opportunities I have had. I feel that living in Wethersfield has given me a solid base in forming my character and the ability to deal in a close-knit society. On the other hand, my time spent in New York has exposed me to diverse cultural experiences. I feel that I would be comfortable in any environment and could make the best of any situation.", "split": "train", "level": ""}
{"id": "high6100.txt", "source_text": "A report brought back by most visitors to the US is how friendly, polite, and helpful most Americans were to them. To be fair, this observation is also frequently made of Canada and Canadians, and should best be considered North American. There are, of course, exceptions. Small-minded officials, rude waiters, and ill-mannered taxi drivers are hardly unknown in the US. Yet American's friendliness and helpfulness is an observation made so frequently that it deserves comment.\nFor a long period of time and in many parts of the country, a traveler was a welcome break in an otherwise dull existence. Dullness and loneliness were common problems of the families who generally lived distant from one another. Strangers and travelers were welcome sources of distraction, and brought news of the outside world.\nThe tough realities of the border also shaped this tradition of hospitality. Someone traveling alone, if hungry, injured, or ill, often had nowhere to turn except to the nearest settler agent. It was not a matter of choice for the traveler or only a charitable impulse   on the part of the settlers. It reflected the hardship of daily life: if you didn't take in the stranger and take care of him, there was no one else who would. And someday, remember, you might be in the same situation.\nToday there are many charitable organizations which specialize in helping the exhausted traveler. Yet, the old tradition of hospitality to strangers is still very strong in the US, especially in the smaller cities and towns away from the busy tourist routes. \"I was just traveling through, got talking with this American, and pretty soon he invited me home for dinner, amazing.\" Such observations reported by visitors to the US are not uncommon, but are not always understood properly. The casual friendliness of many Americans should be understood neither as superficial nor as artificial , but as the result of a historically developed cultural tradition.\nAs is true of any developed society, in America a complex set of cultural signals and customs is the basis of all social inter-relationships. And, of course, speaking a language does not necessarily mean that someone understands social and cultural patterns. Visitors who fail to \"translate\" cultural meanings properly often draw wrong conclusions. For example when an American uses the word \"friend\", the cultural meanings of the word may be quite different from those it has in the visitor's language and culture. It takes more than a brief encounter on a bus to tell polite customs from individual interest. Yet, being friendly is a virtue   that many Americans value highly and expect from both neighbors and strangers.", "split": "train", "level": ""}
{"id": "high4474.txt", "source_text": "A great man married a woman and they had a little lovely girl.\nWhen the little girl was growing up, the man usually hugged her and said, \"I love you, little girl.\" The Little girl would say, \"I'm not a little girl any more.\" Then the man would laugh, \"But to me, you'll always be my little girl.\"\nThe little girl later left her home and went into the world. No matter where she was, the man would call her and say, \"I love you, little girl.\"\nOne day the little girl received an unexpected phone call. The great man became ill. He couldn't talk, smile, walk, hug or dance.\nSo she went to the side of the great man. He looked at her and tried to speak, but he could not. She sat next to the great man, and drew her arms around his useless shoulders . Her head on his chest , she thought of many good memories. She felt sad as she couldn't hear the words of love that had comforted her.\nAnd then she heard from within the man, the beat of heart. The magic happened. She heard what she wanted to hear. His heart beat out the words that his mouth could no longer say... I love you, little girl... I love you, little girl.", "split": "train", "level": ""}
{"id": "middle1004.txt", "source_text": "A man fell out of his plane and fell back into it again. Two people rowed  a small boat from New York to England in 56 days. One person was so big that he wouldn't fit in any hospital room. Would you believe these stories? Well, they may sound strange, but they did happen. James Cornell has more strange but true stories like these in a book called Very Strange People.\nHere is part of the contents  of Very Strange People. The contents lists the names of the chapters  or parts of the book. It also tells on what page each chapter begins.\nChapter                                                            Page\nOne       A Dog's Life  ..........................................3\nTwo      A Lucky Pilot   ................... ..............14\nThree    High Wire Act   .................... .............33\nFour   Fat Men  ............................................... 41\nFive     Over the Falls  .........................................43\nSix      A House without an end  ................... .............53\nSeven    Row, Row, Row Your Boat  ................. ..............60\nEight  The Tower Builder  ....................... ..............85", "split": "train", "level": ""}
{"id": "high8618.txt", "source_text": "One day Mrs. Perry said to her husband, Jack, there is a meeting of our ladies' club at Mrs. Young's house at lunch time today. And I want to go to it. I'll leave you some food for your lunch. Is that all right?\"\n\"Oh, yes,\" her husband answered, \"that's quite all right. What are you going to leave for my lunch?\"\n\"This tin of fish.\" Mrs. Perry said. \"And there are some cold boiled potatoes and some beans here, too.\"\n\"Good,\" Mr. Perry answered. \"I'll have a good lunch.\"\nSo Mrs. Perry went to her meeting. All the ladies had lunch at Mrs. Young's house , and at three o'clock she came home.\n\"Was your fish nice?\" asked she.\n\"Yes, but my feet are hurting,\" he answered.\n\"Why are they hurting?\"\n\"Well, the words on the tin were Open the tin and stand in hot water for five minutes.\"", "split": "train", "level": ""}
{"id": "high5125.txt", "source_text": "Scientists know of more than 1,000 volcanoes on the surface of Venus, Earth's \"sister\" planet. A big question has been: Are they still active? The scientists say yes.\nTheir evidence for recent volcanic activity on Venus comes from a lava  flow in the planet's northern hemisphere. The flow is hotter than the rocks around, which means the lava might still be cooling off. \"The flow we studied seems to be very young---it is still warm inside,\" Nataliya Bondarenko said.\nVenus is a difficult planet to study from Earth because it is surrounded by thick clouds. Telescopes on Earth can't see through these clouds, so the best information about Venus comes from spacecraft orbiting it.\nBondarenko and her colleagues studied the lava flow using data from NASA's Magellan mission. That spacecraft spent four years in orbit around Venus and used radar to make a map of 98 percent of the planet's surface. On October 11th, 1994, the mission ended, and the spacecraft plunged   through Venus' heavy cloud cover and crashed onto the planet below.\nWhile in orbit, the Magellan craft sent microwaves, which can go through Venus' clouds, to the surface. Microwaves are invisible and can be as long as three feet. These waves are a kind of energy, like light. And like light, they bounce off surfaces. The way the waves bounced off the Venus' surface and back to the craft supplied information that the scientists used to estimate the temperature of various parts of the planet's surface. Bondarenko's team found that the lava flow was hotter than its surroundings---which may mean the lava flow is in the process of cooling.\nThe scientists say the lava flow can't be very old because if it were, it would have cooled off enough that Magellan wouldn't have noticed the difference in microwaves. She adds that the flow appears in a 1978 view of the surface that a craft called the Pioneer Venus Orbiter captured.", "split": "train", "level": ""}
{"id": "high23655.txt", "source_text": "STOCKHOLM - Mo Yan, the 2012 Nobel Prize winner for literature, said on Friday that diversity in global cultures makes human beings' cultural life interesting.\nMo told a reception in the Chinese Embassy in Stockholm that it was a responsibility to protect the diversity in cultures while creating the diversity as well.\nHe said that translation played a very important role in bridging different cultures, adding that without the translators who had translated his books he couldn't have won the Nobel Prize.\n\"I think translation is much harder than writing itself,\" said Mo Yan, explaining that it only took 43 days to write the work Life and Death Are Wearing Me Out, while it took Swedish sinologist Anna Gustafsson Chen six years to translate the work.\nEarlier in the day he visited a Swedish middle school, where about 20 Swedish students who were studying Chinese welcomed him by singing the theme song in the movie \"Red Sorghum\" which was based on his novel of the same name.\n\"Unlike the rough and husky voice in the movie, the Swedish students presented the song with a gentle and soft voice, making it rather a romantic song,\" Mo told the gathering at the Chinese Embassy.\nHe said he hoped that there were going to be some outstanding translators among the students, adding that meeting them made him \"extraordinarily happy.\"\nHe said language was going to be \"the most reliable way\" for interaction between peoples because one had to know the language of a nation to understand the people's inner world and spiritual life.\nLan Lijun, Chinese Ambassador to Sweden, said that Chinese literature had stepped into the spotlight worldwide after Mo Yan had won the Nobel Prize, which would help contribute to the literature communication and dialogue between China and the rest of the world.\nPeople in Sweden and other parts of the world were all welcome to know more about Chinese culture, he added.\nThere were about 130 people attending the reception, including Per Westerberg, speaker of the Swedish Parliament.", "split": "train", "level": ""}
{"id": "middle3046.txt", "source_text": "If an American is satisfied with you,he will put his thumb and forefinger into a circle.That means OK.But in Brazil,the very sign is considered to be rude.In Poland,a guest usually presents flowers to his hostess.The number must be an odd one.Besides,the hostess isn't expected to remove the cover of the bunch of flowers.And usually,the red rose is a sign of love.\nUsually we nod to express our agreement and shake our heads to show disagreement.To our surprise these body movements mean the opposite in Bulgaria.\nThe differences in customs and cultures in the world are really noticeable.We should learn more about them to avoid embarrassment .Then,would you please remember:When in Rome,do as the Romans do.", "split": "test", "level": ""}
{"id": "high13382.txt", "source_text": "We spend a quarter of our lives asleep. Sleep is necessary for the body to rest, yet our brains continue to process information. Studies have shown that students are more successful when they sleep after studying-instead of pulling all-nighters-because the brain reviews information learned. Similarly, dreaming is an opportunity to work out emotional problems and form thoughts and memories. About 25 percent of the time spent sleeping is spent in rapid eye movement, or REM, sleep. This type of sleep is known for when dreams occur, but it also helps energize the brain and body.\nResearchers have found two important factors regarding humans and sleep: basicsleep need and sleep debt. Basic sleep need is the amount of sleep we need to have regularly to perform at our best. Sleep debt is the loss of sleep. A few studies say that most adults function best with a basic sleep need of seven to eight hours a night. The problem is that sleep debt also factors in, just because that you meet your basic sleep needs a few nights of the week doesn't mean it cancels out the effects of one night's sleep debt.\nOf course, everyone is different and some people require more or less sleep than the standard basic sleep need. But the real problem lies in what lack of sleep does over the long period to people who either does not meet his or her body's needs or for one reason or another doesn't get enough regular sleep. It is more possible for these people to have motor vehicle accidents, weight gain and risk for heart disease or diabetes   and may be at increased risk for psychological conditions such as depression or drug abuse. Sleeping too long also can be associated with depression and poor health.", "split": "train", "level": ""}
{"id": "middle4032.txt", "source_text": "For this little boy,it was the coldest winter.In that winter,his father lost a leg in an accident. He couldn't go out to work again.From then on,his father became another person. He often lost his temper and beat him.\nOne night, the boy was walking slowly lonely on the street. He passed a lovely small shop, He looked at some nice packages  of coffee quietly for a long time. An idea came into his mind .He knew his father loved coffee and he knew stealing was no good.But all he could think of was his father's smile.He soon put a package of coffee into his jacket and ran back home.He gave the coffee to his father,who gave a smile that the boy had missed for so long.But,unfortunately,before his father could taste the coffee,the shopkeeper broke in and caught the boy. His father beat him again.\nYears later, he became a successful businessman. One day, his mother called and said his father wanted to see him. Busy working, he refused. Weeks later, he heard the sad news that his father had _ . When he went through the relics  ,he found an old box.Inside the box was the coffee that he had stolen from the shop.On the cover was his father's handwriting:\"The gift from my son.\"There was also a letter:\"Dear son,I'm a failure as a father.  But I also have a dream--to own a coffee shop, where I can make cups of coffee for you. I'm sorry I didn't make it.\"\nSadness suddenly occupied him. He regretted not meeting his father for the last time, and decided to complete his father's dream. After quitting his own job, he started a coffee business.\nThe coffee business is now a huge success. And the little boy is Howard Schultz--the owner of the multinational corporation Starbucks.", "split": "validation", "level": ""}
{"id": "high9754.txt", "source_text": "More than 40 countries, including Russia and Taiwan, have agreed to be founding members of China's proposed Asian Infrastructure Investment Bank. However, two of the world's largest economies, the United States and Japan, have _ at this time.\nChina proposed the bank last October as a way to finance roads, bridges, ports and other needed infrastructureprojects in Asia. The time limit for joining as a founding member was March 31. In only a few months, the number of countries seeking membership nearly doubled. They came from Africa, Europe, South America, Asia and the Pacific. Some European powers added themselves to the list. They include Britain, Germany, France and Italy. Other important economies include South Korea, Australia and Russia.\nTaiwan also sought to become a founding member. But it is not clear how China will react. Taiwan and China do not have diplomatic ties. But, relations have improved since the election of President Ma Ying-jeou in 2008. The two sides also are working on details of a trade agreement. However, popular opposition in Taiwan to mainland China's increased influenceon the island remains very strong.\nThe U.S. and Japan have said they are concerned about the governance of the Asian Infrastructure Investment Bank, or AIIB. The United States has urged countries to consider details about the bank's governance and standards -- itssocialand environmental policy -- before joining. Critics say the AIIB threatens the work of existing development banks such as the World Bank, the International Monetary Fund and the Asian Development Bank.\nYet, the Asian Development Bank itself noted in a recent report that the need for infrastructure projects in Asia is great. The institution, led by the U.S. and Japan, estimated last May that the Asia Pacific area needed $800 billion each year in infrastructure development.\nExperts are watching to see how China will take its leadership role in the new bank. The AIIB is expected to start with $100 billion in capital, mostly from China. Some experts point to the high interest in membership. Shi Yinhong is a political scientist at Renmin University in Beijing. He says China's leading part in the bank comes withbenefitsand costs.\nIn other words, while China has gained from the effort to develop the AIIB, it will also have to satisfy other bank members and multi-national institutions. Officials at the World Bank, International Monetary Fund and Asian Development Bank say they are looking for ways to cooperate with the AIIB.", "split": "train", "level": ""}
{"id": "middle4847.txt", "source_text": "It seems more and more Americans want schools to teach foreign languages to children younger than five years old.The most popular way to teach these young children another language is called immersion  .\nChildren in immersion programs hear only the new language in the classroom.The children play games, sing songs and talk to one another in the new languages, some experts   say immersion programs are the most effective   way for young children to learn a language.But there can be a problem when children in the United States begin to learn another language at such an early age.Not many elementary schools continue to teach a foreign language.Only seven of the fifty states require   schools to teach a foreign language to students between the ages of six and twelve.Language experts say it is easier for younger children to learn a language.Still, American schools generally do not begin to teach foreign languages until secondary schools.By then, students are about thirteen years old.\nAmerican schools face difficult choices about the cost of educational programs.The government has increased support for foreign language study in its education law called No Child Left Behind.\nAt the college, the Modern Language Association says more students than ever are studying foreign languages and more languages are being studied now than in the past.Spanish is the most widely   taught in American colleges and universities.French, German, Chinese and Italian are also popular.", "split": "train", "level": ""}
{"id": "high6989.txt", "source_text": "As researchers learn more about how children's intelligence develops, they are increasingly surprised by the power of parents.The power of the school has been replaced by the home.To begin with, all the factors which are part of intelligence--the child's understanding of language,learning patterns, curiosity--are established well before the child enters school at the age of six.Study after study has shown that even after school begins, children's achievements have been far more influenced by parents than by teachers.This is particularly true about learning that is languagerelated.The school rather than the home is given credit for variations in achievement in subjects such as science.\nIn view of their power, it's sad to see so many parents not making the most of their child's intelligence.Until recently parents had been warned by educators who asked them not to educate their children.Many teachers now realize that children cannot be educated only at school and parents are being asked to contribute both before and after the child enters school.\nParents have been particularly afraid to teach reading at home.Of course,children shouldn't be pushed to read by their parents, but educators have discovered that reading is best taught individually--and the easiest place to do this is at home.Many fourand fiveyearolds who have been shown a few letters and taught their sounds will compose single words of their own with them even before they have been taught to read.", "split": "train", "level": ""}
{"id": "high6564.txt", "source_text": "The following are letters to the editor of a school newspaper\nDear editor,\nI'd like to express my opinion about grades. Students should be allowed to study without worrying about grades. Fortunately, most educators are becoming aware of the fact that students have different interests and abilities. I understand that grades are useful, but grades often limit creativity. Competing for better grades causes many students to turn down opportunities to pursue music, dramatics and sports. Grades force an arbitrary  standard of success on everyone. I do not demand as some extremists do, that grades be removed immediately. However, I do believe that less emphasis should be placed on grades. I hope that someday grades will become optional at Village High School.\nMagdalena Smith\nDrama Club\nDear editor,\nI'd like to say something about grades. Let's face the facts about grades. Grades perform three basic functions. First, grades motivate students to work at their highest level of competence. Second, they act as a reward for hardworking students and as a punishment to students who do not work hard. Finally, grades are used as an effective standard by which to measure student achievement. Good grades help students to get jobs and to get into university. I've spoken with a number of students who have jobs, and most of them say that they were hired primarily on the basis of their grades. My grades helped me land a part-time job and will help me get into university next year. I think grades are extremely important at Village High School.\nSimon Harper\nScience Club", "split": "train", "level": ""}
{"id": "high11887.txt", "source_text": "The first ting we do is to put an APB and this goes to all the police stations in the country.\nNext we telephone the hospitals. Often the person we are looking for has been in an accident.\nThen we might try parents, friends or relatives they might be with. We try to follow their movements and to find the last person they saw in local or national papers--especially papers they might read. There are other things we can do: put posters in places where they might be, go on television.\nHere in America there is a magazine in which there are photographs of missing children. This is often the last hope. Of course, with nearly two million missing children every year, we can't do all these things for everyone. We haven't got the time, or the money , or the people who work for it.", "split": "train", "level": ""}
{"id": "high17387.txt", "source_text": "Tour Inside a Volcano in Iceland\nOperation dates: From June 15th -July 31st \nDeparture times: 8:00 AM / 10:00 AM /12:00 PM / 14:00 PM.\nDuration: 5-6 hours (up to 1 hour inside the volcano)\nFitness level needed: Average. No knowledge of hiking or climbing is needed.\nDistance Walked: About 2.5 km (1.7 miles) each way.\nAge limit: 12 years\nIncluded:\nPick-up at your hotel in Reykjavik\nAll safety equipment\nSoup, coffee/tea and perhaps some sweets as well \n Transfer back to Reykjavik\nBring with you:\nGood shoes. Sneakers will work, but we don't recommend them.\nWater. The walk over the lava field is a good workout!\nOutdoor clothing. Dress according to weather for the walk. A warm sweater or a jacket would be useful.\nAbout the tour:\nThis volcano tour takes you inside a volcano, through the top crater and down to the bottom of its magma chamber .\nThe Thrihnukagigur volcano has not erupted for 4,000 years and shows no signs of coming to life again anytime soon. Hence, you are safe!\nYou depart from Reykjavik and drive to the area of Blafjoll mountains (About 30 minutes' drive). From there, an easy 35- to 40-minute walk awaits you, in order to get to the volcano.\nUsing a system normally used to carry window cleaners outside skyscrapers, you will go down 120 metres in an open elevator, a basket lift that is supported by cable wires.\nThe group is split into smaller parties of four to five persons. The trip takes about 10 minutes and the first ones to go down will be the first ones to go up.\nAfter exploring the volcano on the inside, you will walk back over the lava field where the coach awaits and transfers you back to Reykjavik.", "split": "train", "level": ""}
{"id": "high2994.txt", "source_text": "I do desire to help my Chinese students to find a better way of learning. I once divided my Chinese MBA students into six groups and set them an assignment: brainstorming on \"two-hour business plans\", for example: a restaurant chain. Originality would be valued most. As a result, five groups proposed projects for restaurant chains. The sixth showed a catering service. I couldn't help expressing my disappointment, though the time limit had been rather challenging.\nThose middle managers and financial analysts from state-owned enterprises and global companies were not untalented or without opinions, but they had been accustomed to an educational system that rarely rewarded critical thinking or Originality. Papers were often copied from the Internet and the Harvard Business Review. Students insisted that copying was a superior business strategy, better than inventing and creating.\nIn China, you can see almost all kinds of products you can imagine have been made and sold, but so few well developed marketing and management minds have been produced that it will be a long time before most people in the world can name a Chinese brand!\nPartnerships with institutions like Yale and MIT have been established so as to solve the problem mentioned above. And there's also the \"thousand talent scheme\": this new government program is designed to improve technological modernization by inviting top foreign trained scientists to the mainland with large sums of money. But there are concerns about China's research environment, which is known for lacking in encouraging independent thinking and inventiveness, and even high salary offers may not be attractive enough to overcome this.\nIf China wants to become a major world creator, it is no good just seeking partnerships with top Western universities or gathering a group of well-educated people and telling them to think creatively. It's time to establish a rich learning environment for young minds. Yes, new way of learning is the key!", "split": "train", "level": ""}
{"id": "high14097.txt", "source_text": "From the jagged   peaks of the Himalayas to the powerful Yangtze River that flows into the Pacific, China's vast terrain   and varied climate make it the sixth most biologically diverse nation on the planet.\nSince 1998, The Nature Conservancy has been working in China's northwest Yunnan Province to protect some of the amazing natural and cultural diversity unique to this country for its future generations. In cooperation with Chinese local and state government agencies, the Conservancy established the Yunnan Great Rivers Project, which protects an area about the size of West Virginia.\nDid you know?\n*China contains 10% of the world's total species.\n*At least 15% of China's mammal species and 8% of its bird species are found nowhere else on Earth.\n*Nearly 15,000 plant species are native to Yunnan Province.\n*Yunnan is home to 75% of Tibetan medicinal herbs and 30 endangered species.\nWhat is the Nature Conservancy trying to do?\nEducation for Sustainability  \nThe Nature Conservancy recognizes that environmental education is an important element of working closely with local communities to achieve sustainable conservation results. In response, the Conservancy launched a new program called Education for Sustainability which tests means of teaching and learning that combine conservation goals, social justice, and appropriate development and participation in a vision and mission for personal and social change.\nPromoting Green Tourism\nTourism is both an environmental threat and an economic opportunity, with the potential to provide extremely needed income to northwest Yunnan. The Conservancy is working with local communities, government agencies, and tourism enterprises  to develop strategies for \"green\" tourism which will limit the footprint of mass tourism while generating income for local people. In addition to combining tourism development and management at our five action sites, we assisted with regional marketing efforts to promote eco-tourism opportunities.", "split": "train", "level": ""}
{"id": "high5174.txt", "source_text": "The January fashion show, called Future Fashion, exemplified how far green design has come. Organized by the New York-based nonprofit Earth Pledge, the show inspired many top designers to work with sustainable fabrics for the first time. Several have since made pledges to include organic fabrics in their lines.\nThe designers who undertake green fashion still face many challenges. Scott Hahn, a cofounder with Gregory of Rogan and Loomstate, which uses all-organic cotton, says high-quality sustainable materials can still be tough to find. \"Most designers with existing labels are finding there aren't comparable materials that can just replace what you're doing and what your customers are used to,\" he says. For example, organic cotton and non-organic cotton are virtually indistinguishable once woven into a dress. But some popular synthetics, like stretch nylon, still have few eco-friendly equivalents .\nThose who do make the switch are finding they have more support. Last year the influential trade show Designers & Agents stopped charging its participation fee for young green entrepreneurs who attend its two springtime shows in Los Angeles and New York and gave special recognition to designers whose collections are at least 25% sustainable. It now counts more than 50 green designers, up from fewer than a dozen two years ago. This week Wal-Mart is set to announce a major initiative aimed at helping cotton farmers go organic: it will buy transitional cotton at higher prices, thus helping to expand the supply of a key sustainable material. \"Main-stream is about to occur,\" says Hahn.\nSome analysts are less sure. Among consumers, only 18% are even aware that eco-fashion exists, up from 6% four years ago. Natalie Hormilla, a fashion writer, is an example of the unconverted consumer. When asked if she owned any sustainable clothes, she replied, \"Not that I'm aware of.\" Like most consumers, she finds little time to shop, and when she does, she's on the hunt for \"cute stuff that isn't too expensive.\" By her own admission, green just isn't yet on her mind. But thanks to the combined efforts of designers, retailers and suppliers--one day it will be.", "split": "train", "level": ""}
{"id": "middle5478.txt", "source_text": "The big red American car was much too wide for an English country road. When Jack saw it running towards him, he stopped his own car at the side of the road to make room for it to pass. The American car went slowly past, so close that he could see the driver's face clearly.\n\"Where have I seen that face before?\" he though. \"Wait a minute! I remember now. It was in the newspaper!\" He took all the newspapers from his bag and turned quickly to the middle page. There was a picture of the face in it. Yes, it had a large mouth and small eyes, and his eyes were behind dark glasses.\n\"Wanted by the police,\" read by Jack. \"The city Bank will give a lot of money to anyone who helps the police to catch this man.\"\n\"Call the police at once,\" he said to himself. But a few minutes later, he was sad. \"This man was caught this morning,\"  answered the police.", "split": "train", "level": ""}
{"id": "high887.txt", "source_text": "On Sunday while I was having my own Father's Day celebration, I thought about my dad a lot. By the time I called to tell him that I loved him, he had already gone to bed. So I wrote the following to show what my dad means to me.\nAbout 28 years ago, my dad was a used car salesman. Every Thursday night, he would head off to Shreveport, LA for theauction . Most of the time, I drove a car over there for him so he could sell it there.\nOne day, I was riding with my dad to Shreveport for the auction when he found ahitchhiker with a backpack. As soon as dad saw him, he pulled the car over and offered him a ride. Dad asked him his name and continued to talk to him about all sorts of things. I can't recall why but he told dad a lot of terrible things that had occurred to him. I sat in the back seat and watched the scene with amazement. I could see that the hitchhiker changed his attitude as he could tell someone who was really listening to him.\nWe drove another forty-five minutes before we had to exit the interstate . We pulled over and dad told him to keep his head up and things would start looking up for him soon. He reached into his pocket and handed the hitchhiker a twenty-dollar bill and then a the-dollar bill.\nWe drove on and my dad did not say a single thing. I was still completely amazed by what I just witnessed. I was always told everyone to never pick up a hitchhiker and yet my dad did it every single time he saw one. I'm sure that it made that poor man's day, probably a month to follow.\nWhile reflecting upon that story, I learned a lot about my dad and life. I learned that if you come from a place of service or compassion, you can change people's lives. Just one single kind act can change someone's life. It never occurred to my dad about not stopping to help him.\nThis is the type of person my dad is. Thank you for setting such high standards for me to follow.\nDad, I love you. Happy Father's Day!", "split": "train", "level": ""}
{"id": "middle5605.txt", "source_text": "\"Homestay is a form of study abroad program. It allows the visitor to rent a room from a local   family to better understand the local lifestyle. It also helps to improve the visitor's language ability,\"said a teacher during a school meeting last term. \"Students who wish to learn more about foreign cultures or to get foreign experience should join this kind of holiday. I am sure you won't be disappointed  .\"\nAfter this special meeting,I always thought about this kind of holiday. Last month,I had a chance at last to go on such a holiday with some of my schoolmates and we went to London,a place where I had wanted to go since years ago.\nAs we were still young,we had a group leader who planned things for us and looked after us. After we got to London,we went to stay with different families. I was lucky that my host family   was a white couple who had a daughter about my age. They treated me as a daughter of their family during my stay there. They were interested in me and I learnt a lot of things from them,too.\nThe holiday was filled with activities every day. After breakfast,a local teacher would come to take us in his car. Then we would have classes or go on a sightseeing trip to different places of interest like the Big Ben,the London Bridge,and the Buckingham Palace. We would go back to our own homes after the activities.\nThe holiday was a valuable experience for me. I enjoyed every minute of it. Yet,time really flew fast. Three weeks later,we had to leave \"home\" for Hong Kong.", "split": "train", "level": ""}
{"id": "high13276.txt", "source_text": "Adding math talk to story time at home is a winning factor for children's math achievement, according to a new research from the University of Chicago. The study from psychologists Sian Beilock and Susan Levine shows a marked increase in math achievement among children whose families used Bedtime Math, an iPad app that delivers engaging math story problems for parents and children to solve together.\nEven children who used the app with their parents as little as once a week saw gains in math achievement by the end of the school year. The app's effect was especially strong for children whose parents tend to be anxious or uncomfortable with math.\nPrevious research from this group has demonstrated the importance of adults' attitudes about math for children's math success. For example, a recent study found that math-anxious parents who help their children with math homework actually weaken their children's math achievement.\nThe new findings demonstrate that structured, positive interactions around math at home can cut the link between parents' uneasiness about math and children's low math achievement.\n\"Many Americans experience high levels of anxiety when they have to solve a math problem, with a majority of adults feeling at least some worries about math,\" said Beilock, professor in Psychology and author of Choke, a book about stress and performance. \"These math-anxious parents are probably less likely to talk about math at home, which affects how competent their children are in math. Bedtime Math encourages a dialogue between parents and kids about math, and offers a way to engage in high-quality math interactions in a low-effort, high-impact way.\"\nStudy participants included 587 first-grade students and their parents. Families were given an iPad installed with a version of the Bedtime Math app, with which parents and their children read stories and answer questions involving math, including topics like counting, shapes and problem-solving. A control group received a reading app that had similar stories without the math content and questions related to reading comprehension instead. Children's math achievement was assessed at the beginning and end of the school year. Parents completed a questionnaire about their nervousness with math.\nThe more times parents and children in the math group used the app, the higher children's achievement on a math assessment at the end of the school year. Indeed, children who frequently used the math app with their parents outperformed similar students in the reading group by almost three months in math achievement at year's end.", "split": "train", "level": ""}
{"id": "middle2726.txt", "source_text": "Look at this. It's a blue bag. It is my bag. What's in it? Look, this is my English book. It's blue, too. My Chinese book is also in my bag. It is yellow. This is my pencil case. It's big and nice. I like English and Chinese. My bag is my good friend.\n.", "split": "train", "level": ""}
{"id": "middle4584.txt", "source_text": "If you won a lottery and had lots of money, what would you do? Most people would start by buying themselves things, such as a new car or a bigger TV. Some people even decide to move a bigger house.\nMany people who win lots of money may find that they have a lot of friends. The new friends they make may follow them for their money but they may also leave them when all money is spent. Sometimes people can't decide what they want to do with all the money they have won, so they try to think of what they want. In the end, most people usually decide to save the money.\nThere are some lottery winners who decide to give up their jobs, because they think they have enough money and don't need to work any longer. Some big lottery winners make even bigger changes--they end their marriages. They feel that they should be with a younger or more attractive man or woman but what they don't know is that their new money is just a bit of luck. _ can't change everything. Before you buy the next lottery ticket, think about what you want to do and what you don't want to do if you won.", "split": "validation", "level": ""}
{"id": "high458.txt", "source_text": "Barditch High School decided to an All-School Reunion. Over 450 people came to the event. There were tours of the old school building and a picnic at Confederate Park. Several former teachers were on hand to tell stories about the old days. Ms. Mabel Yates, the English teacher for fifty years, was wheeled to the Park.\nSome eyes rolled and there were a few low groans when Ms.Yates was about to speak. Many started looking at their watches and coming up with excuses to be anywhere instead of preparing to listen to a lecture from an old woman who had few kind words for her students and made them work harder than all the other teachers combined.\nThen Ms. Yates started to speak:\n\"I can't tell you how pleased I am to be here. I haven't seen many of you since your graduation, but I have followed your careers and enjoyed your victories as well as crying for your tragedies. I have a large collection of newspaper photographs of my students. Although I haven't appeared in person, I have attended your college graduations, weddings and even the birth your children, in my imagination.\"\nMs. Yates paused and started crying a bit. Then she continued:\n\"It was my belief that if I pushed you as hard as I could, some of you would succeed to please me and others would succeed to annoy me. Regardless of our motives, I can see that you have all been successful in you chosen path.\"\n\"There is no greater comfort for an educator than to see the end result of his or her years of work. You have all been a great source of pleasure and pride for me and I want you to know I love you all from the bottom of my heart.\"\nThere was a silence over the crowd for a few seconds and then someone started clapping. Tee clapping turned into cheering, then into a deafening roar . Lawyers, truck drivers, bankers and models were rubbing their eyes or crying openly with no shame all because of the words from a long forgotten English teacher from their hometown.", "split": "train", "level": ""}
{"id": "middle7206.txt", "source_text": "A young shoemaker left his village. Along the way, he saw some ants who were very sad because a bear had destroyed their house. The shoemaker helped them rebuild it, and the ants offered to return the favor.\nThe shoemaker followed his way and found some bees with the same problem as the ants. The young man also helped them, and the bees promised to help him in the future.\nFurther along , the shoemaker learned that the king's daughter was in the castle of a witch . The young man decided to save her, But the witch threw him a bag of sand mixed with small seeds and told him that if he wasn't able to separate  the two, she would cut off his head before the sun came out.\nThe young man thought about his death. But his friends the ants came and helped him pass the test. The witch was very surprised. Then she took him to a room where there were thirteen girls with their faces covered. The shoemaker had to discover which one was the princess.\nThe young man became _ but he saw a bee that landed on a girl's body. She is the true princess. When the shoemaker uncovered her face, the witch was changed into a crow. The young people fell in love and lived with animals happily.", "split": "train", "level": ""}
{"id": "high20532.txt", "source_text": "Our tours leave directly from the Las Vegas Strip, no terminals, saving up to 2 hours' time! Our prices include all fees -- including fuel and anything else you can think of; we also beat any competitor's price by 5%.\n*South Rim -- Grand Canyon Luxury Coach Tour   $79 Per Person\nOur Grand Canyon Tour is the only luxury Motor Coach Tour that stops at Bright Angel Lodge for a full three hours, at which point you can take the free shuttle to multiple viewpoints including Mather Point, Yavapai Point ... click above for more details.\n*West Rim -- Grand Canyon Tour   $125 Per Person\nThis tour stops at Haulapai Indian Reservation of the Grand Canyon. These stops include Eagle and Guano Point. There're also extra stops along the way for shopping and smoking. This package not only includes the Grand Canyon, but a short photo stop at the Hoover Dam as well ... click above for more details.\n*Airplane Tours & Helicopter Tours\nThese breath-taking tours take you into the skies above the Grand Canyon for a once-in-a-life-time adventure that can be shared by the whole family or by yourself. Airplane Tours starting at $164 per person, and Helicopter Tours starting at $304 per person ... click above for more details.\n*Hoover Dam -- AM / PM Mini Tour   $37.5 Per Person\nHoover Dam Mini Tour starts your morning or afternoon with a short drive to Lake Mead -- created by the Dam in 1935, and continues along to include the Power Plant Tour, guided by a Hoover Dam expert. A delicious lunch is included ... click above for more details.\n*Las Vegas to Hollywood 1 Day Tour   $185 Per Person\nThis tour takes you sightseeing down and around Hollywood Blvd/Beverly Hills, home of the world-famous Walk of Fame as well as Grauman's Chinese Theatre. It ends at beautiful Santa Monica Beach & Pier ... click above for more details.", "split": "train", "level": ""}
{"id": "high21058.txt", "source_text": "When nature is left alone, a balance is reached among the animals and plants living in one area. But when man starts his work in nature, the balance is likely to be destroyed. He grows a crop and takes it away to eat; then there are no dead leaves to fall on the ground, holding water while it sinks into the surface, or decaying  and adding humus  to the soil. Unless a farmer acts with knowledge and skill, he is therefore most likely to make the land poorer. To take the place of the useful matter in the crops that he removes, he uses some kind of fertilizer. Chemical fertilizers are of great help, but the waste products of animals and decaying remains of plants should also be put on the land. In some places, it is a habit to burn waste material lying about, but such burning destroys the useful matter in the dead plants. Although the ashes that are left are valuable when put on the land, a better practice is to bury the waste so that it decays and increases the humus in the soil.\nIn the past, when the world population was much lower than it is now, a man had little difficulty in ordinary times in growing the food that was needed. When a field had been used some years and had become tired, the farmer could move to another place. The tired land then slowly recovered. Gradually grasses and other plants would appear on it and its productive power would slowly return to normal through their decay. But nature, left alone, would take a long time to bring back the land to its former state; the length of time required would depend on local conditions, but it might well be ten years.\n It is a bad practice to grow the same crop in a field year after year. If the crop is changed, the land will suffer less because it is treated and used in a different way. Different plants have different effects on the soil. Therefore, a change of crop will do less harm than the growing of the same crop year after year and a regular change to grass will do good to the soil. Much will therefore be gained if different crops are grown one after another, a method known as the rotation  of crops.", "split": "train", "level": ""}
{"id": "high2094.txt", "source_text": "The World Trade Organization (WTO) founded on January 1, 1994, aims to encourage international trade to flow as freely as possible, making sure that trade agreements are respected and that any disputes   can be settled.\nIn the five years since its founding, the WTO has become well-known as one of the world's most powerful economic organizations, taking its place alongside the World Bank and International Monetary Fund.\nThe system of global rules for international trade, however, dates back half a century to 1948 when the General Agreement on Tariffs   and Trade (GATT) was formed after World War II.\nAs time went by it became clear that the GATT had two major _ --the limited areas of trade it covered, and the lack of an effective system to settle disputes.\nAfter seven years of trade talks ending in 1994. the so-called Uruguay Round finally gave birth to the WTO, complete with an effective system to settle disputes and new rules covering trade in services and intellectual property  .\nEven after seven years of talks and 22500 pages of agreements there were still problems, especially the difficult-to-deal-with areas of agriculture and services.\nThe WTO. with its head office in Geneva, has 135 members with 30 more waiting to join.", "split": "validation", "level": ""}
{"id": "middle499.txt", "source_text": "One afternoon I toured an art museum while waiting for my husband to finish a business meeting.I was looking forward to a quiet view of the art works.\nA young couple viewing the paintings ahead of me chatted nonstop between themselves.I watched them a moment and decided the wife was doing all the talk.I admired the husband's patience for putting up with her continuous talk.Distracted by their noise,I moved on.\nI met with them several times as I moved through the different rooms of art.Each time I heard her constant burst of words,I moved away quickly.\nI was standing at the counter of the museum gift shop making a purchase when the couple came near to the exit.Before they left,the man reached into his pocket and pulled out a white object.He extended it into a long stick and then tapped his way into the coatroom to get his wife's jacket.\n\"He's a brave man.\"The clerk at the counter said,\"Most of us would give up if wewere blinded at such a young age.During his recovery he made a promise that his life wouldn't change.So ,as before,he and his wife come in whenever there's a new art show.\"\n\"But what dose he get out of the art?\"I asked,\"He can't see.\"\n\"Can't see?You're wrong.He sees a lot.More than you or I do.\"The clerk said,\"His wife describes each painting so he can see it in his head.\"\nI learned something about patience,courage and love that day.I saw the patience of a young wife describing paintings to a person without sight and the courage of a husband who would not allow blindness to change his life.And I saw the love shared by two people as I watched this couple walk away hand in hand.", "split": "test", "level": ""}
{"id": "middle7544.txt", "source_text": "Reading is a good habit, but the problem is, there's too much to read these days, and too little time to read every word of it. There are hundreds of skills to help you read more in less time. Here are two skills that I think are very good.\nPreview -- if it's long and hard. Previewing is very useful for getting a general idea of heavy reading like long magazine articles and science reports.\nHere is how to preview.\n*Read the first two paragraphs and the last two paragraphs carefully.\n*Then read only the first sentence of the other paragraphs.\nPreviewing doesn't give you all the details. It tells you not to spend time on things you don't really want or need to read.\nSkim -- if it's short and simple. Skimming is a good way to get a general idea of light reading, like popular magazines or the sports of your daily paper.\nHere's how to skim.\n*Get your eyes to move fast. Sweep them across each line.\n*Pick up only a few key words in each line.\nEverybody skims differently. You and I may not pick up the same words when we skim the same piece, but perhaps we'll get the same idea of what it's all about.", "split": "train", "level": ""}
{"id": "high12734.txt", "source_text": "Enjoy your reading time! We provide a collection of books for you.\nBiography\nWhen Salinger learned that a car park was to be built on the land, the middle---aged writer was shocked and quickly bought the neighboring area to protect it. The towns-people never forgot the rescue and came to help their most famous neighbor.\nJ.D. Salinger: A life by Kenneth Slawenski published by Random House   Price: $27\nMystery\n\" You're a smart boy. Benny's death was no accident, and you're the only one who saw it happen. Do you think the murderer should get away with it?\" The boy was staring stubbornly at his lap again. A thought suddenly hit Annika, \" You recognized the man in the car, didn't you?\" The boy hesitated, twisting his fingers, \" Maybe,\" he said quietly.\nRed Wolf by Liza Marklund Published by Atria Books    Price: $25.99\nShort stories\nShe wants to say to him what she has learned, none of it in class. Some women are born stupid, and some women are too smart for their own good. Some women are born to give, and some women only know how to take. Some women learn who they want to be from their mothers, some who they don't want to be. Some mothers suffer, so their daughters won't. Some mothers love, so their daughters won't.\nYou Are Free by Danzy Senna published by Riverhead Books   Price: $14.99\nHumor\nDo your kids like to have fun? Come to Fun Times! Do you like to watch your kids having fun? Bring them to Fun Times! Fun Time's \"amusement cycling\" is the most fun you can have in the Unite States right now. why spend thousands of dollars flying to Disney World when you can spend less than half to that within a day's drive in most cities?\nHappy And Other Bad Thoughts by Larry Doyle published by Ecco   Price: $15", "split": "validation", "level": ""}
{"id": "high11921.txt", "source_text": "The more people I meet, the more I love my dog. Every day I am reminded why I love him so much.\nThree weeks before Christmas in 2008 at about 2:00 in the morning, my dog woke us up out of a sound sleep because someone was knocking at our door. He barked in front of me as if to protect me from the stranger who was knocking. My husband answered, and it was a local police officer telling us that my father-in-law had called the police because he forgot our number. My mother-in-law was suffering from a brain disease and was in the hospital. We thanked the officer and raced to the hospital. We would have taken him, but the hospital would consider him to be a dirty pet.\nAfter visiting the hospital we drove home and hugged our dog once more. At this point it was unlikely that little dog remembered waking us up. What he did remember was that we left him alone for several hours and he missed us. He thought we missed him, too, so he greeted us at the door with his tail wagging  .\nSomeone tried to break in our house that summer, but, once again, our little dog saved the day. Our curtains were damaged, but no one got in. When I got home from work, I found parts of my curtains lying on the floor. We called the police and the officer said that he did a great job.\nMy dog is a loving sweet dog who just wants some attention. I worked with him for months and now he sits, dances, sings, shakes hands, and so much more. The best part is he looks out for me as much as I look out for him.\nMy husband says the dog is spoiled  ; I say he finally has a loving home.", "split": "train", "level": ""}
{"id": "high15377.txt", "source_text": "As a teen, you're going through big changes physically and mentally. Your interests are expanding. And your desire to take control of your own life is growing.\nHere is the challenge: Kids need to explore the world in new ways, and parents need to protect them from the dangers that are out in that world. These conflicts can easily set off fireworks in otherwise calm houses. Sometimes conflicts can't be avoided. But by paying attention to the building blocks of successful relationships, you can work towards making home a happy and healthy place for you and your parents.\nFor instance, try to find a time to talk when your parents are not angry, tired, distracted, or hungry. A good time to talk is when you're all relaxed . Timing is everything. If the conversation begins to turn into an argument, you'd better calmly and coolly ask to stop the conversation for now. You can pick it up again when everyone's more relaxed. Listen to what your parents are saying, and repeat it back to them. This shows them that you're listening. It also gives them a chance to clear things up if you're not on the same page.\nRespect is the building block of good communication. People who respect each other and care about each others' feelings can disagree without things getting ugly.\nYou are more likely to get along with your parents and have more independence  if your parents believe in you. How do you build trust? Trust comes by actually doing what you say you're going to do. Some teens find that doing fun activities with their parents can improve their relationships. Sometimes we forget that parents are more than rule-makers---they're interesting people who like to watch movies, and go shopping ---just like their teenagers!\nWhat do you do if you are trying your best, but your relationship with your parents continues to be rocky ? You may consider seeking outside help. You can find supportive adults, such as a teacher or a coach, who can\nr.\nRemember you can only change your own behavior; your parents are the only ones who can change theirs.", "split": "train", "level": ""}
{"id": "middle3353.txt", "source_text": "One day, I went to see my last patient, an old woman. In the doorway, I saw she was struggling   to put socks on her swollen  feet in the bed. I stepped in, spoke quickly to the nurse, read her chart noting . I was almost in the clear that she was not in serious condition.\nI asked, \"Could I help put on your socks? How are you feeling? Your sugars and blood pressure were high but they're better today. The nurse mentioned you're anxious to see your son. He's visiting you today. It's nice to have a family visit. I think you really look forward to seeing him.\"\n\"Sit down, doctor. This is my story, not yours.\" She said with a serious voice.\nI was surprised as I helped her with the socks. She told me that her only son lived across from her house, but she had not seen him for five years. She believed that was the main cause of her health problems. After hearing her story and putting on her socks, I asked if there was anything else I could do for her. She shook her head no and smiled. All she wanted me to do was to listen.\nEach story is different. Some are detailed and others are simple. Some have a beginning, middle and end but others don't have clear ends. Some are true but others not. Yet all those things do not really matter. What matters to the storyteller is that the story is heard -- without interruption  or judgment .\nIt was that woman who taught me the importance of stopping, sitting down and truly listening. And, not long after, in an unexpected accident, I became a patient. 20 years later, I sit all the time -- in a wheelchair.\nFor as long as I could, I continued to see patients from my chair. I believe in the power  of listening.", "split": "train", "level": ""}
{"id": "high13158.txt", "source_text": "Did you know that Albert Einstein could not speak until he was four years old, and did not read until he was seven? His parents and teachers worried about his rnenta1ability.\nBeethoven's music teacher said about him,\"As a composer he is hopeless.\" What if this young boy believed it?\nWhen Thomas Edison was a young boy,his teachers said he was so stupid that he could never learn anything.He once said,''I remember I used to never be able to get along at schoo1.I was always at the foot of my class...My father thought I was stupid,and I almost decided that l was a stupid person.\"What if young Thomas believed what may said about him?\nWhen the sculptor Auguste Rodin was young; he had difficulty learning to read and write.:. Today, we may say he had a learning disability. His father said of him, \"I have an idiot  for a son. \"His uncle agreed. \"He's uneducable,\" he said. What if Rodin had doubted his ability?\nWalt Disney was once fired by a newspaper editor because he was thought to have no \"good ideas\". Enrico Caruso was told by one music teacher, \"you can't sing. You have no voice at all. \" And an editor told Louisa May Alcott that she was unable to write anything that would have popular appeal.\nWhat if these people had listened and become discouraged? Where would our world be without the music of Beethoven, the art of Rodin or the ideas of Albert Einstein and Walt Disney? As Oscar Levant once said, \"It's not what you are but what you don't become that hurts. \"\nYou have great potential.When you believe in all you can be, rather than all you cannot become, you will find your place on earth.", "split": "train", "level": ""}
{"id": "high8718.txt", "source_text": "Dear Editor,\nI am writing to ask what has happened to our youth. They are not as polite, hard-working or clever as my generation.  I will give you two examples.\nLast Friday, I got on the underground at 9.15a.m. It was very busy so there were no free seats. There were some teenagers sitting on the seats nearest me. I didn't know why they were not at school. They were talking loudly and laughing. It was difficult to read my newspaper with all the noise. A heavily pregnant  woman and her daughter got on at the next stop, with lots of shopping bags. I expected the teenagers to let them sit down. They saw the woman but did nothing. I had to ask them to give her a seat. They reluctantly did so but give me a rude look. I got off at the next stop and was glad that the teenagers didn't follow me.\nLast Saturday, I had dinner with my friend's family. I was expecting to meet his children, who I hadn't seen for ten years. During dinner, we started talking about world politics. It soon became clear that they didn't know much. They couldn't tell me the name of the King of Spain or the President of Italy. All they knew about was the Internet and which singers were the most beautiful. In my day, students knew the kings, queens and presidents of every country in Europe.\nI worry about the future of Germany. How could these young people become responsible workers and parents? They sit around Macdonald's after instead of going to the library like I did at their age. Maybe they have too much money. Perhaps another reader can give us an idea about what to do with this\"lost generation\".\nFranz Vogts\nHamburg", "split": "train", "level": ""}
{"id": "high7609.txt", "source_text": "\"Plants were expected to get larger with increased carbon dioxide in atmosphere, but changes in temperature, humidity  and nutrient availability  seem to trumped the benefits of  increased carbon dioxide,\" said researchers from the National University of Singapore.\n45 percent of the species studied now reach smaller adult sizes than they did in the past. The researchers pointed out that warmer temperatures and changing habitats, caused by climate change, are possible reasons for shrinking  creatures.\n\"We do not yet know the mechanisms  involved, or why some organism are getting smaller while others are unaffected,\" the researchers said. \"Until we understand more, we could be risking negative consequences that we can't yet quantify.\"\nThe change was big in coldblooded animals. Only two decades of warmer temperatures were enough to make reptiles  smaller. An increase of 1 degree centigrade caused nearly a 10 percent increase in metabolism  . Greater use of energy resulted in tiny tortoises and little lizards. Fish are smaller now too. Though overfishing has played a part in reducing numbers, experiments show that warmer temperatures also stop fish growth. There is a recent report on warmer temperatures' negative effects on plankton , the base of the marine  ecosystem.\nWarmblooded animals weren't immune  from the size change caused by climate change. Many birds are now smaller. Mammals have been miniaturized too. Soay sheep are thinner. Red deer are weaker. And polar bears are smaller, compared with historical records.\nThis is not the first time this has happened in Earth's history. 55 million years ago, a warming event similar to the current climate change caused bees, spiders and ants to shrink by 50 to 75 percent over several thousand years. That event happened over a long time than the current climate change.\nThe speed of modern climate change could mean organisms may not respond or adapt quickly enough, especially those with long generation times. So, it is likely that more negative influences of climate change will be shown in future.", "split": "train", "level": ""}
