{"id": "high8250.txt", "source_text": "If you see a group of kids hitting and abusing an animal, would you stop them? Would you at least call the police? Again people would walk away. Some people do not believe that animal abuse is a big issue.\nEvery day animals are abused in their homes or on the streets. It seems as if politicians do nothing to stop this issue. Everyone is worried about education and global warming. What about animals? We should not ignore them just because they cannot talk to us. Animals, like us humans, have rights. Every living being has the right to warm shelter and good food, but most importantly, they have the right to be wanted and loved. They have the right to be a special, much loved member of their own family.\nThere are many organizations that deal with abused animals or animals that have no home like ASPCA, PETA, the Humane Society and many more. There are organizations that deal with this issue, but that does not mean that we still shouldn't help. The biggest saying that bothers me is, \"I am only one person. I can't make a difference.\" If everyone thought like that, we wouldn't have the organizations and loving people who help the world every day. By helping one animal, you are making a difference.\nThere are many things you can do right now to help animals around your neighborhood. You can volunteer at your local animal shelter, raise money for animal shelters, inform your community about animal abuse or you can write to your representatives and tell them that animal abuse needs to be taken seriously.\nAs you walk down the street, try to help any animals you see walking around. You can easily buy a cheap box of dry cat or dog food to feed the animals. If we do not help our animals now, we may never have animals again. Always remember that with every step you take, you help save an animal's life and isn't that worth fighting for?", "split": "train", "level": "", "topic": "Second Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high3385.txt", "source_text": "Car needs gas to run as your body needs food to work for you. Eating the right kinds of food is very important. A good eating habit can help your body grow strong if you take care of what you eat.\nThere are four main food groups altogether. The _ group has food like milk, cheese and sour milk. The other three groups are the meat and fish group, the fruit and vegetable group, and the bread and rice group. Each meal should have at least one food from all four main groups. With all of these foods together, you will be given enough energy during the day.\nIt is easy to get into bad eating habits. You may eat your breakfast in a hurry to get to school on time or you may not have time for a good lunch. It may be easier to eat fish and chips for your supper all the time. But you will find yourself tired and you will not be able to think quickly.\nWatching what you eat will help keep your body healthy and strong. It is also good to take some exercise. It will help you eat more if you take a walk or play games in the open air. Having good eating habits with some exercise is the key to your health.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high2311.txt", "source_text": "It gives me great pleasure today to say a few words in praise of a man we will all miss very much. To be honest, I can't imagine we will do without him when he's gone.\nBill Masters almost single-handed built up our sales force in the Houston area and developed the market position that we enjoy today. In only six years, he has brought the firm from a very low fifth position in the area sales to the point where we now outsell all but one of our competitors. Not only have we got 37 per cent of the market under Bill's leadership; we are increasing our share with each passing month.\nAs you know, the company has moved Bill to northern California to work his sales magic in one of this company's most competitive  areas. But we know that if anyone can do it, Bill Masters can, and I know you all join me in wishing him the best of luck in his new work.", "split": "train", "level": "", "topic": "Present Perfect", "topic_category": "tenses_aspects"}
{"id": "high7712.txt", "source_text": "What is green food? Do you enjoy green food every day? The concept of \"green food\" was first suggested by the Department of the Ministry of Agriculture in 1990.\nGreen symbolizes life, health and energy. Nowadays, people demand healthy and fresh food. Having enough food to eat is only a basic requirement, and they need more than this. They want to enjoy unpolluted, safe and nutritious food and eat comfortably. So the government does this through a set of \"from the land to the dinner table\" quality controls. It requires to change China's traditional agricultural structures and ensure the food of high quality.\nSafe vegetables refers to products without substances harmful to humans. Growing such vegetables requires no strong poisons, thus guaranteeing vegetables fresh and clean. There are strict regulations in place for even applying fertilizer . The examination of vegetables should reach the state food hygiene  standard. The following conditions for green food are regulated by the China Green Food Development Center. Firstly, products or raw materials must reach the green ecological environment standard set by the Ministry of Agriculture. Secondly, crop planting, livestock raising, fish breeding and food processing must follow green food operating procedures set by the Ministry. Products must be up to the green food hygiene standard. External packing must be pasted with national standard universal labels, special green food packing decoration and tag regulations.\nHowever, by now, our goal hasn't been completely realized. When you return home with a full basket, you are still worried about whether what you have bought is green and healthy. Indeed, for the sake of our health, we still have a long way to go.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high7972.txt", "source_text": "Unlike chemists and physicists, who usually do their experiments using machines, biologists and medical researchers have to use living things like rats. But there are three Nobel prize-winning scientists who actually chose to experiment on themselves - all in the name of science, reported The Telegraph.\n1. Werner Forssmann (Nobel prize winner in 1956)\nForssmann was a German scientist. He studied how to put a pipe inside the heart to measure the pressure inside and decide whether a patient needs surgery.\nExperiments had been done on horses before, so he wanted to try with human patients. But it was not permitted because the experiment was considered too dangerous.\nNot giving up, Forssmann decided to experiment on himself. He anaesthetized   his own arm and made a cut, putting the pipe 30 centimeters into his vein. He then climbed two floors to the X-ray room before pushing the pipe all the way into his heart.\n2. Barry Marshall (Nobel prize winner in 2005)\nMost doctors in the mid-20th century believed that _ was down to stress, spicy food or an unusually large amount of stomach acid. But in 1979 an Australian scientist named Robin Warren found that the disease might be related to a bacteria called Helicobacter pylori.\nSo he teamed up with his colleague, Barry Marshall, to continue the study. When their request to experiment on patients was denied, Marshall bravely drank some of the bacteria. Five days later, he lost his appetite and soon was vomiting each morning - he indeed had gastritis.\n3. Ralph Steinman (Nobel prize winner in 2011)\nThis Canadian scientist discovered a new type of immune system cell called the dendritic cell. He believed that it had the ability to fight against cancer.\nSteinman knew he couldn't yet use his method to treat patients. So in 2007, when doctors told him that he had cancer and that it was unlikely for him to live longer than a year, he saw an opportunity.\nWith the help of his colleagues, he gave himself three different vaccines based on his research and a total of eight experimental therapies. Even though Steinman eventually died from his cancer, he lived four and a half years, much longer than doctors had said he would.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high18253.txt", "source_text": "Dozens of school districts around the country have been looking at these studies and are considering ways to adjust their class schedules.\nEric Peterson is head of St. George's School, a private boarding school for grades 9-12 in the northeastern state of Rhode Island.\nAfter looking at the medical research on adolescent sleep needs and observing students in his own school, Peterson consulted with Dr. Judy Owen, a famous pediatrician   and sleep expert.\nArmed with what he considered to be convincing data, Peterson decided to change his school's start time from 8:00 am to 8:30 am on a trial basis to see if a 30-minute change would make a difference. He was surprised by the results.\n\"What was really astonishing was how many benefits and how significant the benefits were,\" he says. \"In the research itself, we saw just over a 50 percent decrease in health-center admissions for fatigue, or fatigue-related illness, or rest requests. We saw almost a 35 percent decrease in first-period lateness. Students reported that they were more attentive. They were less sleepy during the day.\"\nAnd, according to Dr. Patricia Moss, assistant dean for Academic Affairs at St. George's School, students weren't the only ones reporting better results in the classroom. She says virtually all the teachers almost immediately noticed much more concentrated in the classroom, and there was definitely a more positive mood all around.\n\"Kids were happier to be there at 8:30 than they were at 8:00,\" she says. \"So our experience across the total spectrum was, universally, extremely positive and surprisingly so.\"\nHeadmaster Peterson says there was another unexpected area of change when the school changed its start time.\n\"We saw probably a greater than 30 percent increase in student attendance at breakfast, and of the food that they were eating. We ate more than doubled the amount of milk, eggs, fruit and cereal. So it was quality breakfast foods that the kids were eating. So they were better fueled as well as better rested.\"\nRoss and Peterson acknowledge that making schedule changes has been easier at a small, private boarding school than it might be for the larger U.S. public school system. But they are hopeful that others will find a way.\n\"In the end,\" says Peterson, \"schools ought to do what's the right thing for their students, first and foremost, and this element of the program is very clear--certain for us as a school--but I think as a general example to other schools, is pretty convincing, and so I would argue that it's worth doing.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high18853.txt", "source_text": "All you have is what you bring with you\nI've always felt a need to be prepared for whatever situation I've found myself in.\nMy mother once took me to a store when I was seven years old. She and I got to the checkout counter, and she realized she had forgotten a couple of things on her shopping list. She left me with the cart and ran off to get what she needed.\n\"I'll be right back.\" she said.\nShe was gone just a few minutes, but in that time, I had loaded all the things on the belt and everything was rung up. I was left staring at the cashier, who was staring at me.\" Do you have money for me, son?\" she said. \"I'll need to be paid.\" \nI didn't realize she was just trying to amuse herself. So I stood there, ashamed and embarrassed.\nBy the time my mom returned, I was angry. \"You left me here with no money! This lady asked me for the money, and I had nothing to give her!\"\nNow that I'm an adult, you'll never catch me with less than $200 in my wallet. I want to be prepared in case I need it.\nI've always admired people who are over-prepared. In college, I had a classmate named Norman. One day he was giving a presentation on an overhead projector   and in the middle of his talk, the light bulb on the projector blew out. We would have to wait ten minutes until someone found a new' projector.\n\"It's Okay.\" he announced. \"There's nothing to worry about.\"\nWe watched him walk over to his bag and pull something out. He had brought along a spare bulb for the Overhead projector. Who could even think of that?\nI often told my students, \"When you go into the wilderness, the only thing you can depend on is what you take with you.\" And essentially, the wilderness is anywhere but your home or office. So take money. Pack a light bulb. Be prepared.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "middle5222.txt", "source_text": "A 90-year-old tortoise   is going twice its usual speed after being equipped   with a set of wheels. The animal, called Mrs T, was facing a terrible future after losing her two front legs in a mouse attack while she was sleeping in winter, but her owners glued the wheels onto her shell  .\n\"She's going double the speed she used to,\" said the owner Jude Ryder, \"She uses her back legs to push herself along and seems quite happy.\"\nThe 58-year-old owner was surprised when she went to check on her loved pet last month and found her front legs had been eaten in the mouse attack. The local animal doctor tried his best to save Mrs T. But he was afraid that the tortoise would not survive without being mobile. After paying PS1,000 for the treatment, Mrs Ryder turned to her son Dale for help. Dale designed the front wheels and used resin   to add them to the front of the shell. Mrs Ryder said: \"She liked them immediately, but she must learn how to turn and stop. She can get a good speed up, much faster than before. Mrs T is still quite young for a tortoise. She could go on for another 50 years. All she needs is a new set of tyres   sometimes.\"\nWhen Mrs T was sixty years old, she was bought as a pet for Dale, an 8-year-old boy. It liked running happily in Mrs Ryder's garden in spring and summer. When winter came, Mrs T slept in the garden shelter. A mouse got in last month and chewed   off both her front legs. Mrs Ryder said: \"We were afraid she would be sure to die, but her new set of wheels have saved her life. She can run in the garden again and we can always find her because she leaves very strange footprints behind wherever she goes.\"\nMice attacking tortoises is not uncommon around us--in 2013 Britain's oldest tortoise died after a mouse attack. The tortoise called Thomas was 130 when he was bitten at his home in Guernsey. He spent five days on strong antibiotics  , but the wound became so infected   that his owner had no choice but to have him put to sleep.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high22648.txt", "source_text": "Wang Weiguo, an award-winning actor of the National Theatre Company of China, was wandering through Bejing's Panjiayuan Flea Market when he found a treasure, 20 exquisite   picture frames . He bought them all.\nInside the frames was a woman's life story. There were pictures of her as a baby and a growing child and pictures with her parents. Wang Weiguo was sure someone had lost them. He contacted the police and media. He showed them to friends and to people living outside China. No one recognized the people in the photographs.\nThat was 1999. Wang never gave up the search. In 2010 he told the story to a TV host, Zhang Zequn, who suggested he contact China Radio International. Within three months of the story's being posted on CRI, someone recognized Julie Ege in one of the photographs. The wonderful Norwegian actress and model was the mother of the child whose growing years the photos traced.\nThe child was Joanna Syson. She moved to Beijing in the 1990s to study Chinese. In 1999 she returned to Norway for six months, entrusting   all her belongings, including the photographs, to a friend. When she returned, the friend was gone. So were her belongings. She was heartbroken.\nMore than a decade passed. Then, thanks to the story posted on CRI and to a visitor to the website, the trail   finally led to Joanna Syson. She traveled to Bejing to meet Wang Weiguo, who had searched for her for 12 years, and to recover her treasured photographs.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high10616.txt", "source_text": "12-year-old Robert Looks Twice appears to be the typical all-American boy. He is the quarterback of his school's football team, student council president and one of the top students in his class.\nBut he hasn't forgotten his Lakota Sioux root. Unlike most children on the reservation  , he keeps his hair long, a symbol of strength, and he performs at powwows  , traditionally known as wacipis, where he is a champion of the traditional Lakota dance. Robert was inspired to start dancing by his grandfather, John Tail, who had a small role in the famous film about Indian Amercans, Dances with Wolves. Six years ago, John passed away, and Robert wears little wolves on his clothes in his memory.\nWe are told that his last name, \" Looks Twice\", came about because his ancestors were cautious and always took a second look.\nRobert lives in a trailer   with his grandmother, uncle and eight other cousins. When he gives us a tour, the trailer is falling apart. \" It is getting ready to cave in  ,\" says Robert about the kitchen floor. The family also put trash bags on the ceiling, because it's leaking. \" When it rains it gets all my shirts wet,\" he says of another leak in his bedroom. Often the electricity goes off and the family have to use the burners on the stove to heat the house.\nThis kind of poverty is typical of the reservation. The reservation is the third poorest county in America, and Robert's community, Manderson, is known for its high crime rate. But despite all the temptations   of drugs and alcohol around him, Robert remain focused on being the first person in his family to go to college and then a very big dream.\n\" I want to be the first Native American President,\" Robert said. \" I want to build better houses and clean up the reservation, because it's bad. Get people off the drugs and alcohol and spend that money on their children. Build a better school and playground. Try to get a mall down here to help people get work.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high23554.txt", "source_text": "If you do not use your arms or your legs some time, they become weak; when you start using them again, they slowly become strong again. Everybody knows this and nobody would think of questioning this fact. Yet there are many people who do not seem to know that memory works in the same way. When someone says that he has a good memory, he really means that he keeps his memory in practice by exercising it frequently either consciously  or unconsciously. When someone else says that his memory is poor, he really means that he doesn't give it enough chances to become strong. \nIf a friend complains that his arms and legs are weak, we know that it is his own fault. But if he tells us that he has a poor memory, many of us think his parents are to blame and that he is just unlucky, and few of us realize that it is just as much as his own fault as if it is his arms or legs that were weak.", "split": "train", "level": "", "topic": "Zero Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high23962.txt", "source_text": "\"Can I see my baby?\" asked the happy new mother. The bundle was placed in her arms and when she moved the fold of cloth to look upon his tiny face, she held her breath-the baby had been born without ears. Time, however, proved that the baby's hearing was perfect except his appearance.\nOne day when he rushed home from school and threw himself into his mother's arms,. he cried  out bitterly, \"A boy, a big boy ... called me-a f - freak. \" She sighed, knowing that his life was to be endless of heartbreaks.\nHe grew up, handsome for his misfortune. A favorite with his fellow students, he might have been class president but for that. He developed a gift for literature and music.\nThe boy's father had a talk with the family doctor. Could nothing be done? \"I believe we could transplant on a pair of outer ears, if they could be donated , \" the doctor decided. So the search began for a person who would' make such a sacrifice for a young man. Two years went by. Then,  \" You ' re going to the hospital, son. Mother and I have someone who will donate the ears you need. But it' s a secret.\" said the father.\nThe operation was brilliantly successful. His talents blossomed into genius. School and college became a series of successes. Later he married and entered the diplomatic   service. \"But I must know! \" he urged his father.   \"Who gave so much for me? I could never do enough for him. \"\n\"I do not believe you could,\" said the father,  \"but the agreement was that you are not to know .... not yet. \" The years kept the secret, but the day did come ... one of the darkest days that ever pass through a son. He stood with his father over his mother' s casket   . Slowly and tenderly, the father stretched forth a hand and raised the thick, reddish - brown hair to let out the secret.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "middle4713.txt", "source_text": "My grandfather is 70 years old this year. He is in good condition but he lost his hearing at the age of 65. Then it became difficult for me to communicate with him. My mother bought a hearing aid   for him, but he often forgot where he had put it. So my mother advised me to communicate with him by gesture. Good idea! And then I began to use gesture.\nWhen I wanted to have an apple, firstly, I pointed to my mouth; later I made my hands form a round shape. Then he gave me an apple. When I was hungry, I pointed to my stomach. He would go into the kitchen and cook for me. When I wanted to use, the computer, I pointed to it. If he nodded , I could play computer games from 8 pm to 10 pm; if he disagreed, he always touched my head and pointed to the desk -- that meant that I should do my homework first. It was an easy way for us to communicate with each other!", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle3705.txt", "source_text": "Paul is my pen friend.He is from Landon,England.He speaks good English.He is now in Shanghai with his parents,because they work in Shanghai.Paul can speak a little Chinese! There are five people in his family,his parents,his two sisters and he.His sisters aren't in China.They are in England now. He likes singing and dancing very much.His favorite subject is music.He likes going to the movies on weekends:He thinks it is fun.I think he is a nice boy.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high21150.txt", "source_text": "When you turn on the radio, you hear an advertisement. When you watch television, you hear and see \nan advertisement. If you turn the pages of a newspaper or magazine, again you find an advertisement. If \nyou walk down the street, you see one advertising board after another. All day, every day, people who \nwant to sell you something compete to catch your attention. As a result, advertisements are almost \neverywhere. \nIn the West, advertisements are the fuel that makes mass media work. Many TV stations, newspapers, magazines, radio stations are privately owned. The government does not give them money. So where does \nthe money come from? From advertisements. Without advertisements, there would not be these private \nbusinesses. \nHave you ever asked yourself what advertising is? Through the years, people have given different \nanswers to the question. For some time it was felt that advertising was a means of \"keeping your name \nbefore the public.\" And some people thought that advertising was \"truth well told.\" Now more and more \npeople describe it in this way: Advertising is the paid, non-personal, and usually persuasive description of \ngoods, services and ideas by identified sponsors  through various media. \nFirst, advertising is usually paid for. Various sponsors pay for the advertisements we see, read, and \nhear over the various media. Second, advertising is non-personal. It is not face to face communication. \nAlthough you may feel that a message in a certain advertisement is aimed directly at you, in reality, it is \ndirected at large groups of people. Third, advertising is usually persuasive. Directly or indirectly it tells \npeople to do something. All advertisements try to make people believe that the product, idea, or service \nadvertised can do good to them. Fourth, the sponsor of the advertisement must be identified. From the \nadvertisement, we can see if the sponsor is a company, or an organization, or an individual. Fifth, \nadvertising reaches us through traditional and nontraditional mass media. Included in the traditional \nmedia are newspapers, magazines, radio, television, and films. Nontraditional media include the mail, \nmatchbox covers, and billboards.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high22013.txt", "source_text": "There are about 34,000 different known species of spiders in the world, but only a dozen of them are harmful to humans. Four of the deadliest spiders in the world are the following. These spiders should undoubtedly be avoided.\nBrown Recluse Spider\nThe brown recluse spider is native to the United States. It prefers areas that are dark and quiet. They can be found both indoors and outside. Their characteristic marking is a dark violin shape on top. The brown recluse spider is not an aggressive spider, but will inject venom into its victims if it is pressed against the skin. In children, the elderly, and those with lowered immune systems, the venom will cause serious illness or death.\nBlack Widow Spider\n  The black widow can be found in the southeastern United States. Their characteristic marking is a red hourglass   shape on their black stomach. It is not an aggressive spider. The black widow injects a neurotoxin   into its victims. The neurotoxin can interfere with nerves to muscle tissue. In children and the elderly, the neurotoxin can be fatal.\nBrazilian Wandering Spider\n  The Brazilian wandering spider has a few names such as the banana spider and the armed spider. They can be found in the regions of Central and South America where the climate is warm. These are highly aggressive spiders and are extremely dangerous. They wander around the forest floor and are commonly found in people's homes. It injects a neurotoxin which can cause death.\nSydney Funnel-Web Spider\n  The Sydney funnel-web spider resides near Sydney, Australia. They can grow to 3 inches in length and have a dark and smooth body. They are extremely aggressive and are the most poisonous spiders. They will strike repeatedly, possibly causing death by injecting a neurotoxin into their victims.\nThese four species of spiders are not all aggressive, but all can cause painful bites and serious bad reactions. Keep your eyes open because the best way to deal with these dangerous creatures is to avoid them.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high19035.txt", "source_text": "With little rain, ancient Egyptians relied mostly on the Nile River to water their crops, so they could only grow certain kinds of food. They mainly grew wheat and barley  .\nThe Egyptians made the wheat into bread, soup and porridge, and they also added hops   to make the barley into beer. In fact, some people think that the Egyptians would not have begun growing grain if they hadn't liked beer so much. Many Egyptian models of beer jars have been found, which the Egyptians put into graves of dead people so that they would have beer in the next world.\nThe Egyptians also ate meat. They went to a butcher shop and bought meat there, just as people do today. But because it rarely rains in Egypt, they could have the meat outside in the yard of the store instead of inside. Click on the left and you will see a model of a butcher shop, which was also found in somebody's grave. Can you see the different cuts of meat all laid out? There is a whole leg of mutton at the very bottom. However, Egyptians thought pigs carried infectious disease. They ate beef, mutton, duck and goose. \nFor dessert, the Egyptians had a great interest in dates. Here is a picture of some real Egyptian dates which were put into people's graves for them to eat in the next world, and which were kept in the dry climate for three thousand years until archaeologists dug them up.\nArchaeologists have also found seeds which show that the Egyptians grew watermelon and other kinds of melon.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high22448.txt", "source_text": "Are you looking for a summer reading list for your child or teen? Keep your child reading all summer with this selection of 2012 summer reading lists.\nBooks for primary school students\nKenneth Cadow: Alfie Runs Away\n         When his mother wants to give away his favorite shoes just because they're too small, Alfie decides he's had enough.\nKate Feiffer: My Side of the Car\n         It might be raining on Dad's side of the car, but imaginative Sadie argues that it is not raining on her side, so their trip to the zoo doesn't need to be put off.\nBooks for high school students\nFlinn: Beastly\nA modern retelling of \"Beauty and the Beast\" from the point of view of the Beast, a proud Manhattan private school student who is turned into a monster and must find true love before he can return.\nLord: A Night to Remember\n         A description of the sinking of the \" Titanic\". a reputedly unsinkable ship that went down in the Atlantic on April 10, 1912 after hitting an iceberg, resulting in the deaths of over l, 500 people.\nBooks for high school students\nMark Twain: Huckleberry Finn\n         It's Mark Twain's classic story about a young man and his slave Jim. They travel upriver to escape slavery and in the process Huck discovers what it J11cans to be a man. It teaches us about the value of friendship and sacrifice.\nCharles Dickens: Great Expectations\n         It is about a young man named Pip who inherits ( ) a great deal of wealth from an unknown source.The money quickly moves him up the scale in London.however, at the same time it also teaches him about the dangers of ambition.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high8443.txt", "source_text": "Good news for middle and high school students. When it comes to sleeping a little longer, physicians are on your side.\nOn Monday, the American Academy Pediatrics  announced its recommendation that middle and high schools start at 8:30 a.m.or later. \"Doing so will match school schedules to the biological sleep patterns of adolescents,\" the AAP writes in a press release regarding its new policy statement called \"School Start Times for Adolescents\" .\n\"Chronic  sleep loss in adolescents is one of the most common public health issues in the U.S.today,\" according to Judith Owens, director of Sleep Medicine at Children's National Health System.\n\"The research is clear that adolescents who get enough sleep have a reduced risk of being overweight or suffering depression, are less likely to be involved in automobile accidents, and have better grades, higher standardized test scores and an overall better quality of life,\" Owens said in the press release. \"Studies have shown that delaying early school start times is one key factor that can help adolescents get the sleep they need to grow and learn.\"\nEven before the AAP's announcement, school districts across the country have been rethinking start times. Earlier this year The New York Times wrote about Dos Santos, a student at Rock Bridge High School. When Dos Santos learned that school officials were considering starting school 30 minutes earlier than the existing time, she became worried.The student gathered others to her cause. In the end, school officials decided against the earlier start time.\nOne of the organizations that Dos Santos reached out to for help was Start School Later, a nonprofit organization that focuses on getting public schools to set \"healthy school hours.\"\n\"It's going to take collective action, perhaps on a national scale, to get many districts to take on this issue,\" Terra Ziporyn Snider, PhD, director and co-founder of Start School Later, told Yahoo Health.\n\"The science is clear, the will to change isn't,\" she explained. \"The reason for that is that community life goes around school schedules, and any suggestion of change - earlier, later, whatever - brings powerful opposition from everyone who fears a change in routine.\"", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high15223.txt", "source_text": "Two years ago, the Funk family of suburban Chicago adopted a Chinese baby girl who had been abandoned on a sidewalk near a Yangzhou textile factory.\nLast year and halfway across the United States, the Ramirez family of suburban Miami adopted a girl who had been abandoned a week later on the same spot.\nBoth families named their daughters Mia. It turns out, a first name and Chinese heritage aren't the only things the three-year-olds have in common. The girls' mothers--Holly Funk and Diana Ramirez--met on a website for parents who had gone through international adoptions. After a flurry of e-mails comparing photographs and biographical details, DNA testing proved the families' suspicions: The girls are probably fraternal   twins.\n\"I was in shock,\" said Ramirez, who lives with her husband Carlos in Pembroke Pines, Florida. \"Well, now this is for real.\"\nThe Internet and Web groups revolving around international orphanages are increasingly being used to link adopted children with biological kin . The site that the Funks and Ramirezes used has a membership of 137 people, with 15 sets of twins and seven sets of siblings whose relationships have been confirmed.\nAt a reunion on Friday at Chicago's O'Hare International Airport, Mia Diamond Funk Mia Hanying Ramirez shyly surveyed each other, then reached for each other's hand.\nDNA tests established an 85 percent probability that the girls are at least half sisters. Scientists did not have a biological parent to test and reach a greater certainty, but given their ages and physical similarities, experts say it is likely they are fraternal twins.\nDouglas and Holly Funk hope to take Mia to Miami in October. Both sets of parents say they are committed to staying in touch and often let the twins talk to each other on the phone.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle2621.txt", "source_text": "My name is Lucy. I come from America. I am now in China.  I study in Hangzhou Shulan Middle School. There are many clubs in our school. They are an English club, an art club, a music club, a ball game club, a swimming club, a chess club and a computer club. There is a \"Show Yourselves !\" Festival in our school every year. On that day, students from different clubs show their talents in different ways. They can sing English songs, draw and paint beautiful pictures. They can play the guitar, the violin, the piano, and the trumpets. They can also play chess and show us their swimming skills. They like the festival very much.  I join the art club, and I paint the ads  for them . Giving  help makes me happy.", "split": "train", "level": "", "topic": "Preposition + V-ing", "topic_category": "gerunds_infinitives"}
{"id": "high6423.txt", "source_text": "Lately, Bolivia has outlawed (......) the use of animals in circus   performances, and officials in the South American nation aren't doing it in a silly way! They say all Bolivian circuses must stop using animals.\nSome people welcome the law. They say animals should not be forced to work and that circus creatures are caged in tight spaces when they travel. However, other people say that many of the four legged performers are cared for by animal experts. Plus, they point out, circus animals entertain millions of fans.\nShould animals perform in circuses? Student reporters Michael and Emily have done some work on the issue.\nYes, I think animals should be allowed in circus acts. Most circus trainers love and respect the animals they work with and treat them well. Certain rules and regulations also help to ensure that the animals are treated humanely, or with kindness. Millions of people love circus animals. They look forward to seeing elephants and tigers perform. Many of the animals are exotic  , so people might not get the chance to see them anywhere else. \"Circus animals shouldn't be banned,\" says Parker, a sixth grader from Oregon City, \"One of the main reasons people go to the circus is to see animals they don't see every day and to see them do cool tricks.\"\nAnimals should not perform in circuses. When animals are in circuses, they are forced to learn new behaviors in order to entertain humans. Those behaviors may go against their natural instincts  . For example, bears _ in the winter, but bears in a circus have to perform and can't hibernate as their bodies tell them to. Also, circus animals have to travel all the time in cages. All that traveling may cause them to become confused or upset because their environment keeps changing. \"When animals are removed from their habitat and held in cages ... it changes their behaviors,\" points out Anne Northam, a teacher from Friendswood, Texas.  \"They are no longer selfsufficient  .\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high19910.txt", "source_text": "Despite the anxiety that Jones' Host--said by some to be the first digital novel--caused in 1993, publishers weren't too concerned that e-books would one day replace printed books. However, that attitude was changed suddenly in 2007 when Amazon's Kindle came onto the market, which led to e-book sales jumping up to 1,260%. Since then, e-books' popularity has continued to rise steadily. The publishing industry seemed to have lost all possible ability to regain its position. Will printed books eventually become a thing of the past?\nAccording to Mike Shatzkin, founder and CEO of the Idea Logical Company, printed books just for plain old reading will, in 10 years from now, be unusual. \"Not so unusual that a kid will say, 'Mommy, what's that?' but unusual enough that on the train you'll see one or two people reading something printed, while everyone else is reading off of a tablet.\" And Shatzkin believes that the de mise of print is sure to happen, though such a day won't arrive for perhaps 50 to 100 or more years.\nRobert Stein, founder of the Institute for the Future of the Book, however, believes that books won't disappear entirely, at least not anytime soon. \"Print will exist, but it will be in a\ndifferent field and will appeal to a very limited audience, as poetry does today. Like woodblock printing, hand-processed film and folk weaving  , printed pages may assume an artistic\nvalue,\" he says. He imagines that future forms of books might be developed not by traditional publishers but by the gaming industry. He also predicts that the distinction between writer and reader will be made less obvious by a social reading experience in which authors and consumers can digitally interact with each other to discuss any passage, sentence or line.\nIs there anything we risk sacrificing, should print really disappear entirely? According to Maryanne Wolf, director of the Center for Reading and Language Research at Tufts University, electronic reading can negatively affect the way the brain responds to text, including reading comprehension, focus and the ability to maintain attention to details like plot and order of events. \"My worry is that we'll have a short-circuited reading brain, excellent for gathering information but not necessarily for forming critical, analytical deep reading skills,\" Wolf says.\n        The field, however, is in an early stage, and findings about the negative effects of e-reading are far from certain. In light of this, Wolf hopes that we continue to maintain a \"bi-literate\" society--one that values both the digital and printed word. \"A full reading brain circuit is a huge contribution to the intellectual development of our species. Anything that threatens it deserves our attention.\"", "split": "train", "level": "", "topic": "Future (going to)", "topic_category": "tenses_aspects"}
{"id": "high23058.txt", "source_text": "Architecture lovers in Washington do not have to travel far to see some of the world's most famous buildings. Architect Adam Reed Tucker has recreated fifteen of them using Lego bricks. The exhibit is called \"LEGO Architecture: Towering Ambition.\" It is at the National Building Museum in Washington until early September. Faith Lapidus has more.\nLego bricks are small, color1ful plastic blocks. They can be snapped together to make any number of objects. They are popular with children of all ages around the world.\nAdam Reed Tucker calls himself an \"architectural artist\". He was a professional architect for ten years. After the terrorist attacks against the United States in two thousand one he decided to do something different. He wanted to express his feelings for the form of the skyscraper while deepening his understanding of architecture, engineering and construction. He chose to use something that most people used as children.\nTucker does all his work by hand, using only pictures of the buildings. He does not use any computers or drawings to plan his buildings. While the exhibit is going on, Tucker will be working on his latest work, the White House where the American president lives. Visitors can watch him create the famous building brick by brick.\nAfter walking through Tucker's models, visitors can create their own works at the building station. They can make houses, office buildings, stores or factories. They can then place their models on a large map of a city. As more visitors come, the Lego city will grow.\nTo many people, Legos might seem like toys for kids. But Adam Reed Tucker proves that  _ . To watch another Lego artist at work, go to 51voa.com and click on Captioned Videos.\nLowry Baker came from McLean, Virginia, to see the exhibit. Baker said, \"When we saw the models, there were just amazing. As soon as my son got a look at all of the stations here, he wanted to start building. It's really a great set-up. It really encourages creativity on the kids' part.\"", "split": "train", "level": "", "topic": "V-ing vs to-V", "topic_category": "gerunds_infinitives"}
{"id": "high21312.txt", "source_text": "In my last essay,I wrote briefly about a bathtub in the classroom.What really was the use of that bathtub?\"Guys,i t is Reading Workshop time now.When I call your table,get your things,please!\"said Mrs.Toalson.She was holding a cup that had many sticks in it;on every stick was written each student's name and table number.\n    What does she mean? Probably books,I thought.Mrs.Toalson picked a stick out of the cup and said,\"Okay,Aniqa's table;Table Two,you may get your things.\"Then my four classmates ran for the cushions in the bathtub.Mrs.Toalson kept picking sticks and calling out different table numbers.On hearing their numbers,students would run to get cushions.Because there were not enough cushions for everyone,the last to be called had to go without.Those students sighed,\"Oh!They are the lucky ones.\"\n    Finally,Mrs.Toalson picked the last,stick;what is she going to do now?\n    \"Kate,you may use the bathtub.\"Mrs.Toalson said.Gosh!Use the bathtub?Is Kate going to take a bath,1 wondered.Kate is the girl who had pretty brown hair.She ran happily with her book to the bathtub and lay down in it.As she read,she hugged a teddy bear.I think it must be comfortable reading in a bathtub.\n    Except for lucky Kate,everybody had to read elsewhere.Some were sitting on the seats,some were lying down under the table,and everybody's reading pose was different.\n    Just then,my friend found me sitting at my table quietly,not doing anything.She said,\"Mary,let me find you a book.\"I nodded.Then she led me to a comer of the classroom where the bookshelf was and picked a picture book for me.\n    Regina thought that it would be more fun to read outside on the grass.What a great idea!The next day our whole class went to the park across the street from our schoo1.As we read,animals such as squirrels ran around us.It was amazing !", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high22837.txt", "source_text": "A French wine producer is spreading the wealth with his workers after they discovered nearly $ 1milion worth of gold coins stored in the building's ceiling, according to a French newspaper.\n  \"One of the workers was attacking the building's ceiling when gold coins started to rain down on him, followed by sacks of gold, \" Francois Lange, the head of a wine company in Les Riceys, France, told the reporter. It's not unusual to hear about treasure hunters searching the ocean for gold and other precious metals lost at sea, but finding $ 1million in your office ceiling is an uneasy thing and a valuable one too, given that demand for gold has reached a new height recently. In 2011, about 31 grams of gold was valued at $ 1,920.30.\nIn all, 497 gold coins were discovered, raining down upon the workers who were busy repairing the building. Made between 1851 and 1928, the coins have a face value marking of $ 20 each. However, together they are now worth nearly $ 1million, according to the newspaper. Lange says he will keep half of the money for himself, and the other half will be shared with the workers who made the discovery. No one knows for sure who placed the coins in the building, but the newspaper reports the building was owned by a wine producer in the 1930s.\nPeople haven't known much about these coins for now but don't be surprised if this \"buried\" treasure story still has another chapter to be told. After all, the $ 1 million of gold coins once belonged to somebody. Just look at the recent legal case being argued between Spain and people who found more than $500 million worth of gold coins in a sunken ship.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high17496.txt", "source_text": "A new semester has just started and a number of parents are registering to change their children's names, in the hope that it will change their temper or help their children drop bad habits, like addiction to the Internet.\n    One mother surnamed Shi renamed her son, a primary school student, Hengfu, which means eternal happiness in Chinese. She decided to change the boy's name because he always did poorly in study. She has had him tutored after school, but he always earns low marks in school. So Shi turned to a name-giving master. \"I hope the special recipe could bring him good luck,\" the mother said. Teachers in the city say a few students in every school, most nearing graduation, change their names at the start of every new semester.\n    A naming agency said it has found names for nearly 1,000 students since setting up the shop in 1998. The store said its professionals analyzed the defects   of a person's original name, and suggested a new one based on the person's birthday and other fortune-telling skills.\n    Buying a new name costs between 800 yuan and 10,000 yuan. Parents also have to register the name at the local police department for a small fee. This will legally change their child's name on all documents, including ID cards and passports.\nHu Jie, a university student who changed her name in her final year of high school, said the new name confused her. \"I always had no idea who my classmates were calling when they used my new name,\" Hu said, adding that she wished she had kept her old name.\nBut parents may be ignoring one thing: name changes might encourage kids to believe that fate is more important than their own efforts.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high11213.txt", "source_text": "Jones worked so hard that made the sparks fly from his hammer.The son of Mr.Smith, a rich neighbor, used to come to see the blacksmith and he would enjoy himself watching how the tradesman worked.\"Why don't you try your hand to learn to make shoe tacks?\" said the blacksmith.\"Who knows, one day, it may be of use to you.\" The lazy boy began to see what he could do.But after a little practice he found that he was becoming very skilled and soon he was making some of the finest tacks.\nOld Mr.Smith died and the son on account of the war lost all his goods.He had to leave home and was forced to take up residence in another country.It so happened that in this village there were numerous shoemakers who were spending a lot of money to buy tacks for their shoes and even at times when they paid high prices they were not always able to get what they wanted, because in that part of the country there was a high demand for soldiers' shoes.\nYoung Smith, who was finding it difficult to earn his daily bread, remembered that he had learned the art of making tacks and had the sudden idea of making a bargain with the shoemakers.He told them that he would make the tacks if they would help to get him settled in his workshop.The shoemakers were only too glad of the offer.\"How funny it seems,\" he used to say, \"even making tacks can bring a fortune.My trade is more useful to me than were all my former riches.\"", "split": "test", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high8228.txt", "source_text": "One is not born able to speak a language. One is born able to make a noise. I have heard babies cry in America and in China. I can't tell any difference. But when I hear someone from America speak English and hear someone speak Chinese, I can tell you there are a lot of differences.\nI believe a common problem with Chinese students' learning English is that they were not taught to think in English. They have an idea spoken in English and want to translate the idea into Chinese, then they think in Chinese of the proper reply and translate it into English. After a long period of speaking the language, one begins to think in the foreign language naturally. You will learn faster if you begin to think in English at the very beginning of your study.  Many students ask me: What can I do to improve my spoken English? My reply is : The more English you speak, the better English you will speak. There are many things you can do to improve your spoken English. Of course, the best way is to live where English is spoken as a language of the country.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high21832.txt", "source_text": "Successful people have developed habits leading to success. Those are the people you want to study and follow. Do what they do. Read what they read. If they are local, see if you can take them to lunch and ask questions. If not, get a hold of some of the things they have written about or listen to them. Most successful people enjoy the opportunity to coach people along and to help them become successful. It is their way of giving back. \nThe trouble is that most people won't ask. They come up with excuses. They say to themselves, \" I am not important enough for this person to talk to me.\" \nThe successful people understand that life is a learning experience and it doesn't stop in school. They always strive( ,) to reach the next level. Life will always give you the results of your actions. Ask yourself what actions are you taking? What are you creating? You create what you think about. Willie Hooks calls it our h. a. b. e.'s. Our habits, attitudes, beliefs and expectations. Before starting any new habit we have to know what we want. So how do we permanently  change our habits?\nStart your action plan. Put your plan together. What do I need to do first? Set my goals. Then next I would put a diet plan together. Then I would start an exercise program. You get the idea. Put a good solid plan together.\nSo there it is in a nutshell. We have the power to change any bad habit that we don't like. Will it be easy? Probably not, but it might not be as hard as we think either. The hard part is to get started. Remember that these habit have been a part of us for a long time so don't expect miracles at first. Use the process described above and you cam overcome and change any habit that you want to change.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle2464.txt", "source_text": "Jeff Keith has only one leg. When he was 12 years old, Jeff had cancer . Doctors had to cut off most of his right leg.\nEvery day Jeff puts on an artificial leg . With the plastic artificial leg Jeff can ride a bicycle, swim, and play soccer. He can also run.\nJeff made a plan with his friends who had plastic legs, too. They decided to run across America.\nWhen he was 22 years old, Jeff Keith ran across the United States from the east to the west. He started running in Boston. Seven months later, he stopped running in Los Angeles. He ran 3,200 miles. Jeff stopped in cities on the way to Los Angeles. In every city people gave Jeff money. The money was not for Jeff, but for the American Cancer Society.\nJeff is _ , but he can do many things. He is studying to be a lawyer . Jeff says, \"People can do anything they want to do. I want people to know that. I ran not only for disabled people. I ran for everybody.\"\n,.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high759.txt", "source_text": "Answering the Community Needs of Our City\nThe Silver City Council  recognizes that citizens have certain needs.  To better meet your needs, we have made several changes to community facilities  in 2004. This chart shows how we have tried to make your life better.\nTransport Three stations for the suburbs have been added to the western train service.20 new buses for the southern line were purchased in January. 50 percent of city bus-stops have been upgraded . Buses to the eastern suburbs will run every15 minutes.\nCommunication  Broadband cable  is now available  to all parts of the city. All of the new Government buildings are ' smart'-wired for better computer service!\nMedical Facilities The new state-of-the-art Nightingale Hospital was opened in June. To overcome a shortage of trained medical staff  at Dover Hospital, 10 doctors have been employed from overseas.Some facilities at Station Street Hospital have been upgraded.\nEducation  Textbooks will be free to all primary students in 2004 ! Rent for private schools has been reduced. Teachers report that the 'no hat - no play' rule has been successful.\nProtection and Security  Extra police now patrol ( ) the tourist areas. 50 new police officers graduated in July and have taken up duties in the city area.\nEntertainment / Recreation  The John Street basketball courts have been re-surfaced ! The new Central Community Building opened in May. 5,000 new fiction books were bought for the Silver City Library.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle5159.txt", "source_text": "Five-year-old Susie loved to listen to her older sister, Emma, play the piano. Susie wanted to play it, too. But every time Susie asked to play, her mother would tell her how much work it needed to learn to play the piano well. Susie was sure she could learn to play it. She decided to make her mother believe that she was ready to learn to play the piano, so Susie helped her mom do the dishes and clean the house.\n\"Mom, can I start taking the piano lesson?\" asked Susie.\n\"Susie, if you take the piano lesson, you must practice every day,\" said her mom.\nSusie was so excited. She could not wait to learn how to play her favorite songs!\nSusie was excited for her first piano lesson. When she was finally in class, she was surprised: her teacher had flashcards and a book for her. Susie didn't know there were so many other things to know about the piano first. During that first lesson, the teacher didn't let Susie play the piano.\nThe next day, after Susie got home from school, she ran outside.\n\"Where are you going?\" asked her mom.\n\"Outside to play volleyball,\" said Susie. \"Bye, Mom!\"\n\"You must study your piano flashcards,\" said her mom. \"Susie, this is what you wanted, now you have to do it.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle8209.txt", "source_text": "Tommy and his mother go shopping  today. Tommy's father likes apples very much. They buy some red apples for him. Tommy's mother likes yellow bananas, but the bananas are green. \"Look! The strawberries are very nice, Mom. Do you like them?\" Tommy says to his mother. \"Yes, I like strawberries very much.\" Tommy's mother buys some for herself  . The oranges are very nice. Tommy's mother buys some for Tommy. He likes oranges very much.\nThey need some vegetables. The vegetables in the supermarket are very good. They buy some tomatoes, cabbages and carrots. Tommy doesn't like carrots, but his parents like it. They like carrots very much. They buy lots of carrots.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high14157.txt", "source_text": "Contrary to popular belief, looking at someone's face alone is not enough to tell us whether they are roaring in celebration or screaming in frustration, researchers claimed.While people may believe they have the ability to read each other's faces, body language is the real clue that shows whether strong emotions someone is feeling are positive or negative.\nIn a study, groups of participants were shown a series of facial expressions such as tennis players photographed just after winning or losing a point.\nIn some cases the volunteers were able to see the player's full body, but in others they were only shown either their face or their body with the other removed.\nParticipants could clearly tell whether the players were winning or losing when they were shown the full picture or just the body, but their guesses were no better than chance when based on the face alone.\nThose who were allowed to see the full image were convinced they had made their judgment based on the players' facial expressions even though results from the two other groups suggested otherwise.\nThe researchers carried out a second study where participants were shown a wider range of faces showing emotions including joy, pleasure, victory, pain and defeat.\nUsing photoediting software, the researchers attached the faces to bodies expressing the opposite emotion, and asked participants to act out the emotions they saw in the photos.\nThe resulting poses were like the body poses in the photographs but not the facial expressions, demonstrating that people base their interpretation of strong emotions not on the face but the body.\nDr Aviezer, who led the study, said, \"These results show that when emotions become extremely intense, the difference between positive and negative facial expressions becomes unclear.The results may help researchers understand how our body interacts during emotional situations.For example, individuals may fail to recognize facial expressions, but if they are trained to process important body language, their performance may significantly improve.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high18590.txt", "source_text": "He leant down to the pickpocket The heaving and gasping had stopped, but he was still making a show of his breathlessness. \n\"That's better,\" Mallon said. \"Can you stand up? Try to stand up. Here.\" he said, and gripped the pickpocket's arm and forced him upright until he saw his face for the first time. As the pickpocket labored for breath, he gazed up at Mallon with his dark eyes. \"How could you?\" they asked. \nMallon might have said, \"Because you tried to steal from me.\" But he was still conscious of the flush of joy he'd felt when his blow struck home-when he knew he'd hurt the man. Where that joy came from he couldn't say, but he knew that its roots were deeper than some clumsy failed theft. \nFat drops of rain began to patter on the awning  . \n\"How are you?\" Mallon said. \"Can you walk?\" The pickpocket turned away and leant against the store window with both hands, and his head sank lower as his shoulders rose and fell. A gray-haired woman inside the store rapped on the glass and made a shooing motion. When the pickpocket ignored het she rapped harder and kept rapping. \n\"I have to go,\" Mallon said. \"I'm sorry.\" He looked up at the sky. \"I'm sorry,\" he said again, and stepped into the rain and walked quickly up the street. \nOne of the Bangladeshi umbrella sellers was working the comer, and Mallon had just paid seven euros when he heard a woman shouting. He didn't want to look back but did. It was the woman from the shop. pushing and batting the pickpocket away from the window while he bent down and covered his head like a boxer trying to get through the 1ast seconds of a round. Mallon slipped his wallet back into his jacket pocket and took the umbrella that the Bangladeshi had opened for him. \nThe pickpocket was out on the sidewalk now, in the rain. The woman stood just under the awning with her arms crossed over her chest.  \n\"Excuse me, madam,\" Mallon said, coming up to them. \"This man isn't well. He needs to rest a moment. ''\n\"I know these people.\" she said. \"Our Romans don't want them here.\"\nThe rain fell in sheets, ran down the pickpocket's shiny scalp and face, down his 1eather jacket. \n\"Here.\" Mallon said, and offered him the umbrella, but he only looked at Mallon with his hurt dark eyes and then lowered his head again Mallon bumped him in the shoulder with the handle of the umbrella \"Go on-take it!\" he said. And finally, with a beaten. unwilling look, the pickpocket did.\nAnd that was when he saw a taxi round the corner with a 1ight glowing on its roof. Mallon ran out waving his arm and the cab turned sharply to the pavement, sending a lot of water over his shoes. He opened the door but couldn't help looking back. The pickpocket had lowered the umbrella to the ground upside down and was 1caning on the shaft, head low, neck bared to the sky.\n\"Wait,'' Mallon said to the driver. He went back and grabbed the pickpocket's sleeve and pulled him to the cab. \"Get in,\" Mallon said, and took the umbrella and pushed him into the back seat. He leaned inside. \"O. K., where do you live?\"\n''No Gypsies!\" the driver said. He was twisted around, glaring at the pickpocket. \n\"Gypsy? Look, he's not well. I'll pay,\" Mallon added\nThe driver shook his head. \"No Gypsies. Get him out. \"\nMallon 1ooked at the driver's nameplate: Michele Kadare. \"It's the law,\" he said, \"If you don't take us. Signor Kadare. I'll report you and you'll lose your license. Believe me-I am quite serious. \nThe driver fastened those pale eyes on Mallon and turned and put his hands on the steering wheel. He raised his eyes to the rearview mirror and he and Mallon exchanged stares. \n\"O. K., Mr. American.\" he said. \"You pay. \"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high17451.txt", "source_text": "Mr. and Mrs. Martin live in New York. Mr. Martin is a doctor and his office is in New York. Mrs. Martin teaches music at a school in New York.\n    They have two sons. Their sons' names are Ted and Roy. Ted is twenty years old. He is now in Taiwan. He is studying Chinese. He went to Taiwan last month and is going to stay there for two years.\nRoy is thirteen years old. He goes to high school. He likes sports very much. He likes swimming best. He can swim faster than his father. He wants to be the best swimmer in his school.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle3920.txt", "source_text": "Jeff Keith has only one leg. When he was 12 years old, Jeff had cancer. Doctors had to cut off most of his right leg. Everyday Jeff puts on an _ leg. The leg is plastic. With the plastic leg Jeff can ski, ride a bicycle, swim, and play soccer. He can also run.\nIn the photo, Jeff is running with some young men. They have plastic legs, too. They are wearing special T-shirts. The T-shirts say, \"Run, Jeff, Run. Jeff Keith Run Across America.\"\nWhen he was 22 years old, Jeff Keith ran across the United State, from the East Coast to the West Coast. He started running in Boston. Seven months later, he stopped running in Los Angeles. He ran 3,200 miles, that's about 16 miles each day. Jeff wore out 36 pairs of running shoes and five plastic legs.\nJeff stopped in cities on the way to Los Angeles. In every city people gave Jeff money. The money was not for Jeff. It was for American Cancer Society. The American Cancer Society used the money to learn about cancer.\nOn the way to Los Angeles Jeff talked to people about cancer. He also talked about being disabled. Jeff is disabled, but he can do many things: he skis, swims, plays soccer, and runs. He finished college and is studying to be a lawyer. Jeff says, \"People can do anything they want to do. I want people to know that. I am not only for disabled people. I ran for everyone!\"\n,.", "split": "test", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high16133.txt", "source_text": "Sheffield\nLincoln College of English\nClasses for foreign students at all levels 3 months, 6 months, 9 months and one course open all year.\nSmall class (maximum 12 students), library, language lab and listening center,\naccommodations with selected families 25 minutes from London.\nCourse fees for English for one year are $1380 with reduction for shorter periods of study.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high20453.txt", "source_text": "When he was driving home one evening on a country road,he saw an old lady,stranded on the side of the road.He stopped in front of her car and got out.Even with the smile on his face,she was worried.He looked poor and hungry.He knew how she felt.He said,\"I am here to help you,madam.Why\ndon't you wait in the car where it's warm? By the way, my name is Joe.\"\nShe had a flat tire.Joe crawled under the car,changed the tire.But he got dirty and his hands hurt.She could not thank him enough and asked him how much she owed him.He told her that if she really wanted to pay him back,the next time she saw someone who needed help,she could give that person the  assistance they needed,and Joe added,\"And think of me.\"\nShe drove off.A few miles down the road the lady saw a small restaurant.She went in.The waitress had a sweet smile,and was nearly eight months pregnant .The old lady wondered how someone like her who seemed poor could be so kind to a stranger.Then she remembered Joe.After the lady finished her meal,the waitress went to get her change from a hundred--dollar bill.But she stepped right out the door.\nWhen the waitress came back,she noticed something written on a napkin,\"I am helping you because someone once helped me.If you really want to pay me back,here's what you do---Do not let the chain of love end with you.\"\nThat night when she got home,she was thinking about the money and what the lady had written.She and her husband needed money with the baby due next month.She knew how worried her husband was,and as he lay sleeping next to her,she whispered,\"Everything's going to be all right.I love you,Joe.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high20094.txt", "source_text": "Don't you find that it is getting increasingly darker every day when you wake up for school ? As winter comes ,days become shorter while the nights become longer ,In the past people slept more in winter ,but in modern times we just use more electric light instead of sunlight to continue our normal routines .\nBut scientific research is finding that manhandling of electric light is making us sick .\nElectric light is fooling the body's biological clock into releasing awaking hormones ( )at the wrong times ,scientists say .This might be leading to seasonal fatigue  and depression .\nMuch more than mental health is at stake ,Recent scientific studies have found that women who work at night ,have higher chances of getting breast-cancer .\n\"Electric lights are wonderful ,but as with a lot of other things ,we really mess ,things up \"said David Avery ,a psychiatrist  .\" Our ancestors evolved in a very regular light -dark cycle ,and our bodies just work better that way .\"\nResearchers have known for a long time that all living things have a biological clock that is linked to light ,Being of the natural day-night cycle can cause fatigue ,mood change and depression ,This is known as seasonal affective disorder ,or SAD.\nScientists disagree on the cause of SAD ,Some say it is caused by winter's late sunrises , others blame the early sunsets .\nHowever ,they all agree the perfect solution to SAD is to give up artificial light ,It will quickly bring someone into a cycle of long ,restful nights and easy awakenings at dawn .\nBut realistically most people need to use electric light in their everyday life . Ironically the next best solution is to use more bright lights to reset the body's biological clock .\nBy getting bright light first thing in the morning it simulates  an earlier dawn and shifts the body clock forward ,according to Alfred Lewy ,a psychiatrist at Oregon Health & Science University .\nA 2005 study done by the American Psychiatric Association showed that daily exposure to bright light was about as effective as medicine used to treat several forms of depression .", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "high16752.txt", "source_text": "Liu Qian, a magician from Taiwan, cast his spell over an audience of thousands on the CCTV Spring Festival Show. Die-hard fans are still trying to work out the secrets behind many of the tricks he performed.\nBut Liu, 32, when asked, laughed off the idea that there might be an \"answer\" to his magic. \"The most fascinating things about magic is the puzzling process. People enjoy how magicians make the impossible come true,\" said Liu.\nFew people today believe in the possibility of real magic. They also often fail to consider magicians' devotion to their art. It can take a magician years' of practice to perfect a trick before he performs it on stage.\nPart of Liu's star appeal is his astonishing skill. However, when he began in the industry, he was embarrassingly clumsy. \"I could practice thousands of times for one single act. It wasn't much fun,\" he said.\nNo magician's supernatural powers on stage extend to their life off stage. Liu says his life was no easier or funnier because he was a magician.\nHe developed an interest in magic at a young age, but didn't consider making a living out of it until he graduated from university. He had studied Japanese language and found himself unable to find a job. \"My parents never considered being a magician as a proper job. To begin with, I had little confidence I would be doing this in the long term,\" he said.\nYet Liu felt a powerful calling to become a magician. \"For many people, magic somehow means a miracle, which is something we all secretly wish for no matter how hard-bitten or cynical  we become,\" he said.\nLiu may be right. A popular modern dream is of the fairy godmother, who waves her magic wand   and makes our dreams come true. But according to Liu, we all have the power to create magic in our lives. As Liu puts it: it's not the magic that makes it work;it's the way we work that makes it magic.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle2980.txt", "source_text": "We always celebrated Dad's birthday on Thanksgiving Day, even after he entered a nursing home. When we knew it might be his last birthday, the whole family decided to get together for a huge birthday celebration at the nursing home.\nDad was a good storyteller and we were always his listeners. During a quiet moment, I announced it was now Dad's turn to listen to stories for a change. I wanted everyone to tell Dad what we loved about him. The room became quiet. Then one after another, people told stories from their hearts, while Dad listened with tears in eyes.\nEveryone seemed to have more than one story. Even the little grandchildren couldn't wait to tell Dad why they loved him. For a man who had been kind to so many hundreds of people in his life, here was our chance to tell him how much we love him. A few months later, at Dad's memorial service, we more fully realized what we had given to Dad that night. Those are the stories people normally tell at a funeral   after a loved one is no longer alive to hear the words. They tell stories, full of tears. But we had given those memories to Dad in his life, and we had told them through laughter, together with hugs and joy. He had them to hold and enjoyed them from time to time in his mind during his last days and months.\nWords do matter, and they are enough. We just need to say them or to speak them publicly the ones we love. That's the ways to give back love and that's our chance to celebrate a person in his or her life.", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high17582.txt", "source_text": "But that did not really surprise me much. I knew very well that in addition to the great planets-- such as the Earth, Jupiter, Mars, Venus-- to which we have given names, there are also hundreds of others, some of which are so small that one has a hard time seeing them through the telescope. When an astronomer discovers one of these he does not give it a name, but only a number. He might call it, for example, \"Asteroid 325.\" \nI have serious reason to believe that the planet from which the little prince came is the asteroid known as B-612. This asteroid has only once been seen through the telescope. That was by a Turkish astronomer, in 1909. On making his discovery, the astronomer had presented it to the International Astronomical Congress, in a great demonstration . But he was in Turkish costume, and so nobody would believe what he said.\nGrown-ups are like that... \nFortunately, however, for the reputation of Asteroid B-612, a Turkish dictator  made a law that his subjects  should change to European costume under pain of death  .So in 1920 the astronomer gave his demonstration all over again, dressed with impressive style and elegance. And this time everybody accepted his report. \nIf I have told you these details about the asteroid, and made a note of its number for you, it is for the grown-ups and their ways. When you tell them that you have made a new friend, they never ask you any questions about essential matters. They never say to you, \"What does his voice sound like? What games does he love best? Does he collect butterflies?\" Instead, they demand: \"How old is he? How many brothers has he? How much money does his father make?\" \nIf you were to say to the grown-ups: \"I saw a beautiful house made of rosy brick, with geraniums in the windows and doves on the roof,\" they would not be able to get any idea of that house at all. You would have to say to them: \"I saw a house that cost $20,000.\" Then they would cry out: \"Oh, what a pretty house that is!\" \n  _ , if you say to them: \"The proof that the little prince existed is that he was charming, that he laughed, and that he was looking for a sheep.\" And what good would it do to tell them that? They would shrug their shoulders, and treat you like a child. But if you said to them: \"The planet he came from is Asteroid B-612,\" then they would be convinced, and leave you free from their questions. \nThey are like that. One must not hold it against them. Children should always show great forbearance toward grown-up people. But certainly, for us who understand life, figures are a matter of indifference .", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high12368.txt", "source_text": "A controversial new study has claimed that men really are more intelligent than women.The study concluded that men's IQs are almost four points higher than women's.\nBritish-born researcher John Philippe Ruston says the finding could explain why so few women make it to the top in the workplace.\nHe claims the \"glass ceiling\" phenomenon is probably due to inferior intelligence,rather than lack of opportunity.\nThe University of Western Ontario psychologist reached his conclusion after _ the results of university ability tests taken by 1 00,000 students aged 17 and 18 of both sexes.\nA focus on the factors such as the ability to quickly grasp a complex concept,verbal reasoning skills and creativity-- some of the key factors of intelligence --showed the male teenagers had IQs that were an average of 3.63 points higher. The average person has an IQ around 100.The findings,which held true for all classes and levels of education, overturn 100 year opinion that men and women average the same in general mental ability. They also conflict with evidence that girls do better in school exams than boys.\nBut Professor Ruston argues that the faster maturing of girls leads to them outshining boy in the classroom.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle6051.txt", "source_text": "Everybody has a home. People have homes. Animals have homes, too. People live in different kinds of homes. Animals also have different kinds of homes.\nSome animals live in holes under the ground. The woodchuck   lives under the ground. Its home has two doors. If any enemy comes through one door, the woodchuck goes out of the other. Some animals live in holes in trees. Some squirrels  build nests high in trees. Some birds live in holes in trees. Most of the birds live in nests . Crows  build their nests high in trees. But hawks  build their nests high in the mountains. Some animals even carry their homes on their backs .", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high15564.txt", "source_text": "Everybody has had at least one experience from which he knows the meaning of life.This time, which took place several years ago, but seems as if it just happened.\nOn an afternoon several years ago, my brother-in-law opened the bottom drawer of my sister's dress and picked out a beautiful skirt.\"Jan bought this the first time we went to New York, at least 8 or 9 years ago.She never wore it.She was saving it for a special occasion.\" he said.I guess this was the occasion: it was the funeral   of my sister, after her unexpected death.\nHe took the shirt and put it on bed, with the other clothes we were taking to the funeral.Then he closed the drawer and turned to me, \"Don't ever save anything for a special occasion.Every day you're alive is a special occasion.\"\nI'm thinking about his words, and they've changed the way I live my life.I'm spending more time with my family and friends and less time in committee meetings.Whenever possible, life should be a kind of experience to enjoy, not to suffer.\"Someday\" and \"one of these days\" are losing their importance on my vocabulary.If it's worth seeing or hearing or doing,I want to see and hear and do it now.\nEver since that day, I have been trying very hard not to put off, hold hack or save anything that would add laughter and color to our lives.Every morning when I open my eyes.I tell myself that every day, every minute, every breath, truly is a gift.So\nevery day and find the true meaning of your life.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle285.txt", "source_text": "Amy: Excuse me, Jill.\nJill:  Yes, what can I do for you?\nAmy: Did you see two persons pass from here? I want to take photos with them.\nJill:  Can you describe what they look like?\nAmy: Yes, they are one boy and one girl. The girl is very beautiful. quite thin and has long hair. And that boy is also very tall. He is about 1.98 meters tall. He has big eyes and  short black hair.\nJill:  You mean Sun Yang, the famous swimming player? And he wears a pair of sunglasses?\nAmy: Quite right. He stays in Shaoxing these days for swimming. Did you see them?\nJill:  Yes, they passed here 10 minutes ago. If you go quickly, You can _ them. \nAmy: I will do that. Goodbye. Thanks a lot.\nJill:  Goodbye.", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "high16165.txt", "source_text": "I recently turned fifty, which is young for a tree, midlife for an elephant, and ancient for a sportsman. Fifty is a nice number for the states in the US or for a national speed limit but it is not a number that I was prepared to have hung on me. Fifty is supposed to be my father's age, but now I am stuck with this number and everything it means.\nA few days ago, a friend tried to cheer me up by saying, \" Fifty is what forty used to be.\" He had made an inspirational point, Am I over the hill?People keep telling me that the hill has been moved, and I keep telling them that he high-jump bar has dropped from the six feet I once easily cleared to the four feet that is impossible for me now.\n\" Your are not getting older, you are getting better.\" says Dr. Joyce Brothers. This, however, is the kind of doctor who inspires a second opinion.\nAnd so. as I approach the day when I cannot even jump over the tennis net. I am moves to share some thoughts on aging with you. I am moved to show how aging feels to me physically and mentally. Getting older. of course, is obviously a better change than the one that brings you eulogies . In fact, a poet named Robert Browning considered it the best change of all:\nGrow old along with me!\nThe best is yet to me.\nWhether or not Browning was right, most of my first fifty years have been golden ones, so I will settle for what is ahead being as good as what has gone by. I find myself moving toward what is ahead with a curious blend   of both fighting and accepting my aging, hoping that the philosopher   was right when he said.\" Old is always fifteen years from now.\"", "split": "test", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high4682.txt", "source_text": "Emilio and Michi spread the colorful tablecloth on the table. They made room for Drew, who was carrying a dish. \"Watch out,\" Drew warned. \"This is pretty hot.\"\nA moment later, Kent and Alyssa added another hot dish to the table. \"That smells so good!\" said Michi. \"Are most of the parents here yet? I'm hungry.\"\nKent looked through the doors that led into the hallway. \"I think Ms. Milano and Mr.Hasselbach just finished giving _ the garden touring. They should be heading into the cafeteria next.\"\nThe students of Jefferson Middle School in Saint Louis, US had spent all afternoon preparing for the evening meal. They did their best to transform the lunchroom into a beautiful dining area for their families.\nAs the families found their seats, Ms. Milano asked Drew, Emilio, and Michi to join her at the front of the room. She said, \"I just wanted to take a moment to congratulate Drew, Emilio and Michi for their wonderful idea. A year ago, they first came to me with the plan for starting a garden at Jefferson. I wondered whether it would work, but they had thought through everything. Any time I had a question about how we would make this work, they had an answer prepared. As you can see, they were absolutely correct. About three-quarters of the food you will be enjoying came from the school garden. The students prepared the entire meal themselves.\"\nMs. Milano handed Drew, Michi and Emilio a box each. They opened their box as Ms. Milano continued. \"As a thank-you to these students for their creative idea and hard work, they have each received a stepping stone for the garden. Their names and date appear on the stones.\"\nShe turned to them. \"Students for years to come will be enjoying the garden that you helped create,\" she said. \"We thought it would be appropriate for them to have a reminder of our garden's founders.\"\nThey held up their stepping stones and smiled as the crowd clapped. \"And now,\" said Ms Milano, \"please help yourself to some of the mouthwatering food our young chefs have prepared. Dinner is served!\"", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
