{"id": "high7211.txt", "source_text": "A recent study of ancient and modern elephants has come up with the unexpected conclusion that the African elephant is divided into two distinct  species.\nThe discovery was made by researchers at York and Harvard Universities when they were examining the genetic relationship between the ancient woolly mammoth and mastodon to modern elephants -- the Asian elephant, African forest elephant, and African savanna elephant.\nOnce they obtained DNA sequences  from two fossils , mammoths,and mastodons the team compared them with DNA from modern elephants. They found to their amazement that modern forest and savanna elephants are as distinct from each other as Asian elephants and mammoths.\nThe scientists used detailed genetic analysis to prove that the African savanna elephant and the African forest elephant have been distinct species for several million years. The divergence of the two species took place around the time of the divergence of Asian elephants and woolly mammoths. This result amazed all the scientists. There has long been debate in the scientific community that the two might be separate species, but this is the most convincing scientific evidence so far that they are indeed different species.\nPreviously, many naturalists believed that African savanna elephants and African forest elephants were two populations of the same species, despite the elephants' significant size differences. The savanna elephant has an average shoulder height of 3.5 metres while the forest elephant has an average shoulder height of 2.5 metres. The savanna elephant weighs between six and seven tons, roughly double the weight of the forest elephant. But the fact that they look so different does not necessarily mean they are different species. However the proof lay in the analysis of the DNA.\nAlfred Roca, assistant professor in the Department of Animal Sciences at the University of Illinois, said, \"We now have to treat the forest and savanna elephants as two different units for conservation purposes. Since 1950,all African elephants have been conserved as one species. Now that we know the forest and savanna elephants are two very distinctive animals, the forest elephant should become a bigger priority  for conservation purposes.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high20453.txt", "source_text": "When he was driving home one evening on a country road,he saw an old lady,stranded on the side of the road.He stopped in front of her car and got out.Even with the smile on his face,she was worried.He looked poor and hungry.He knew how she felt.He said,\"I am here to help you,madam.Why\ndon't you wait in the car where it's warm? By the way, my name is Joe.\"\nShe had a flat tire.Joe crawled under the car,changed the tire.But he got dirty and his hands hurt.She could not thank him enough and asked him how much she owed him.He told her that if she really wanted to pay him back,the next time she saw someone who needed help,she could give that person the  assistance they needed,and Joe added,\"And think of me.\"\nShe drove off.A few miles down the road the lady saw a small restaurant.She went in.The waitress had a sweet smile,and was nearly eight months pregnant .The old lady wondered how someone like her who seemed poor could be so kind to a stranger.Then she remembered Joe.After the lady finished her meal,the waitress went to get her change from a hundred--dollar bill.But she stepped right out the door.\nWhen the waitress came back,she noticed something written on a napkin,\"I am helping you because someone once helped me.If you really want to pay me back,here's what you do---Do not let the chain of love end with you.\"\nThat night when she got home,she was thinking about the money and what the lady had written.She and her husband needed money with the baby due next month.She knew how worried her husband was,and as he lay sleeping next to her,she whispered,\"Everything's going to be all right.I love you,Joe.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high16165.txt", "source_text": "I recently turned fifty, which is young for a tree, midlife for an elephant, and ancient for a sportsman. Fifty is a nice number for the states in the US or for a national speed limit but it is not a number that I was prepared to have hung on me. Fifty is supposed to be my father's age, but now I am stuck with this number and everything it means.\nA few days ago, a friend tried to cheer me up by saying, \" Fifty is what forty used to be.\" He had made an inspirational point, Am I over the hill?People keep telling me that the hill has been moved, and I keep telling them that he high-jump bar has dropped from the six feet I once easily cleared to the four feet that is impossible for me now.\n\" Your are not getting older, you are getting better.\" says Dr. Joyce Brothers. This, however, is the kind of doctor who inspires a second opinion.\nAnd so. as I approach the day when I cannot even jump over the tennis net. I am moves to share some thoughts on aging with you. I am moved to show how aging feels to me physically and mentally. Getting older. of course, is obviously a better change than the one that brings you eulogies . In fact, a poet named Robert Browning considered it the best change of all:\nGrow old along with me!\nThe best is yet to me.\nWhether or not Browning was right, most of my first fifty years have been golden ones, so I will settle for what is ahead being as good as what has gone by. I find myself moving toward what is ahead with a curious blend   of both fighting and accepting my aging, hoping that the philosopher   was right when he said.\" Old is always fifteen years from now.\"", "split": "test", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high17451.txt", "source_text": "Mr. and Mrs. Martin live in New York. Mr. Martin is a doctor and his office is in New York. Mrs. Martin teaches music at a school in New York.\n    They have two sons. Their sons' names are Ted and Roy. Ted is twenty years old. He is now in Taiwan. He is studying Chinese. He went to Taiwan last month and is going to stay there for two years.\nRoy is thirteen years old. He goes to high school. He likes sports very much. He likes swimming best. He can swim faster than his father. He wants to be the best swimmer in his school.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high16133.txt", "source_text": "Sheffield\nLincoln College of English\nClasses for foreign students at all levels 3 months, 6 months, 9 months and one course open all year.\nSmall class (maximum 12 students), library, language lab and listening center,\naccommodations with selected families 25 minutes from London.\nCourse fees for English for one year are $1380 with reduction for shorter periods of study.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle8209.txt", "source_text": "Tommy and his mother go shopping  today. Tommy's father likes apples very much. They buy some red apples for him. Tommy's mother likes yellow bananas, but the bananas are green. \"Look! The strawberries are very nice, Mom. Do you like them?\" Tommy says to his mother. \"Yes, I like strawberries very much.\" Tommy's mother buys some for herself  . The oranges are very nice. Tommy's mother buys some for Tommy. He likes oranges very much.\nThey need some vegetables. The vegetables in the supermarket are very good. They buy some tomatoes, cabbages and carrots. Tommy doesn't like carrots, but his parents like it. They like carrots very much. They buy lots of carrots.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high18853.txt", "source_text": "All you have is what you bring with you\nI've always felt a need to be prepared for whatever situation I've found myself in.\nMy mother once took me to a store when I was seven years old. She and I got to the checkout counter, and she realized she had forgotten a couple of things on her shopping list. She left me with the cart and ran off to get what she needed.\n\"I'll be right back.\" she said.\nShe was gone just a few minutes, but in that time, I had loaded all the things on the belt and everything was rung up. I was left staring at the cashier, who was staring at me.\" Do you have money for me, son?\" she said. \"I'll need to be paid.\" \nI didn't realize she was just trying to amuse herself. So I stood there, ashamed and embarrassed.\nBy the time my mom returned, I was angry. \"You left me here with no money! This lady asked me for the money, and I had nothing to give her!\"\nNow that I'm an adult, you'll never catch me with less than $200 in my wallet. I want to be prepared in case I need it.\nI've always admired people who are over-prepared. In college, I had a classmate named Norman. One day he was giving a presentation on an overhead projector   and in the middle of his talk, the light bulb on the projector blew out. We would have to wait ten minutes until someone found a new' projector.\n\"It's Okay.\" he announced. \"There's nothing to worry about.\"\nWe watched him walk over to his bag and pull something out. He had brought along a spare bulb for the Overhead projector. Who could even think of that?\nI often told my students, \"When you go into the wilderness, the only thing you can depend on is what you take with you.\" And essentially, the wilderness is anywhere but your home or office. So take money. Pack a light bulb. Be prepared.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high17496.txt", "source_text": "A new semester has just started and a number of parents are registering to change their children's names, in the hope that it will change their temper or help their children drop bad habits, like addiction to the Internet.\n    One mother surnamed Shi renamed her son, a primary school student, Hengfu, which means eternal happiness in Chinese. She decided to change the boy's name because he always did poorly in study. She has had him tutored after school, but he always earns low marks in school. So Shi turned to a name-giving master. \"I hope the special recipe could bring him good luck,\" the mother said. Teachers in the city say a few students in every school, most nearing graduation, change their names at the start of every new semester.\n    A naming agency said it has found names for nearly 1,000 students since setting up the shop in 1998. The store said its professionals analyzed the defects   of a person's original name, and suggested a new one based on the person's birthday and other fortune-telling skills.\n    Buying a new name costs between 800 yuan and 10,000 yuan. Parents also have to register the name at the local police department for a small fee. This will legally change their child's name on all documents, including ID cards and passports.\nHu Jie, a university student who changed her name in her final year of high school, said the new name confused her. \"I always had no idea who my classmates were calling when they used my new name,\" Hu said, adding that she wished she had kept her old name.\nBut parents may be ignoring one thing: name changes might encourage kids to believe that fate is more important than their own efforts.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "middle2893.txt", "source_text": "Once my father asked me to hold his hammer while he repaired something, so we could have some time to talk to each other.\nFor 22 years, after I left home for college, he called me every Sunday at 9 am. He was always interested in my life and how my family was doing, and I never once heard him complain about his own life.\nNine years ago when I bought my first house, my father, 67 years old, spent eight hours a day painting it for three days. He would not allow me to pay someone to have it done. All he asked for was a glass of iced tea and for me to hold a paint brush for him and talk to him. But I was too busy.\nFive years ago, at age 71, my father spent five hours putting together a swingset   for my daughter. Again, all he asked was that I get him a glass of iced tea and talk to him. But again, I was too busy.\nFour years ago, my father drove all the way from Denver to Topeka, with an eight-foot Colorado blue spruce   in his trunk, so that my husband and I could have a part of Colorado growing on our land. I was preparing for a trip that weekend and couldn't spend much time with him.\nThen, one day, my father telephoned me as usual, this time from my sister's home in Florida. We talked about the tree he had brought me, \"Fat Albert\", but that morning he called it \"Fat Oscar\", and he seemed to have forgotten some things. I had to get to church, so I cut the conversation short.\nThe call came at 4:40 pm that day: my father was in hospital in Florida with an aneurysm  . I got on a plane immediately, and on the way I thought of all the times I had not taken the time to talk to my father. I realized that I had no idea who he was or what his deepest thoughts were. I promised that when I arrived, I would make up for lost time.\nI arrived in Florida at 1 am. My father had passed away at 9:12 pm. This time it was he who did not have time to talk to me.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high11809.txt", "source_text": "I don't often lose things and I'm always careful with money, so I was quite surprised when I reached for my wallet and it wasn't there. At first, I thought it was possible that I could have left it at home. Then I remembered taking it out to pay the taxi, so I knew I had it with me just before I walked into the restaurant. I wondered if it was possible that it could have dropped out of my pocket while I was eating dinner. I turned and walked back to the table where I had been sitting. Unluckily, there were several people sitting at the table at that time, so I had the waiter go over to the table to see if my wallet was on the floor. While the waiter was looking for it, the head of the restaurant came up to me and asked me if anything was wrong. I told him what had happened. He asked me to report the missing wallet to the police. I told him I didn't want to do so; I was in a hurry because I had to reach my waiting room before two o'clock, where some people were waiting to see me. I also told him that my biggest worry at the moment was how I was going to pay for the meal. He told me not to worry about that. He asked me to write down my name and address, and he said he would send me a bill  .", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high4682.txt", "source_text": "Emilio and Michi spread the colorful tablecloth on the table. They made room for Drew, who was carrying a dish. \"Watch out,\" Drew warned. \"This is pretty hot.\"\nA moment later, Kent and Alyssa added another hot dish to the table. \"That smells so good!\" said Michi. \"Are most of the parents here yet? I'm hungry.\"\nKent looked through the doors that led into the hallway. \"I think Ms. Milano and Mr.Hasselbach just finished giving _ the garden touring. They should be heading into the cafeteria next.\"\nThe students of Jefferson Middle School in Saint Louis, US had spent all afternoon preparing for the evening meal. They did their best to transform the lunchroom into a beautiful dining area for their families.\nAs the families found their seats, Ms. Milano asked Drew, Emilio, and Michi to join her at the front of the room. She said, \"I just wanted to take a moment to congratulate Drew, Emilio and Michi for their wonderful idea. A year ago, they first came to me with the plan for starting a garden at Jefferson. I wondered whether it would work, but they had thought through everything. Any time I had a question about how we would make this work, they had an answer prepared. As you can see, they were absolutely correct. About three-quarters of the food you will be enjoying came from the school garden. The students prepared the entire meal themselves.\"\nMs. Milano handed Drew, Michi and Emilio a box each. They opened their box as Ms. Milano continued. \"As a thank-you to these students for their creative idea and hard work, they have each received a stepping stone for the garden. Their names and date appear on the stones.\"\nShe turned to them. \"Students for years to come will be enjoying the garden that you helped create,\" she said. \"We thought it would be appropriate for them to have a reminder of our garden's founders.\"\nThey held up their stepping stones and smiled as the crowd clapped. \"And now,\" said Ms Milano, \"please help yourself to some of the mouthwatering food our young chefs have prepared. Dinner is served!\"", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "middle470.txt", "source_text": "Mr. Evens works in Sydney. Last week he had a two weeks' holiday, but he didn't know where to go. He said to his friend Robert, \"I hate the hot weather here, but I can't find a cool place in Australia. How will I take my holiday?\"\n\"That's easy,\" said Robert. \"You'd better go to Moscow. Snow and ice are covering the ground now.\"\nMr. Evens agreed with his friend. He bought an air ticket and soon arrived in Moscow. He made a happy journey  there. But one day He got into trouble. After lunch he went to a park outside the city. He saw a dog following him while he was walking past a house. It was hungry and wished him to give it some food to eat. Bad luck! He had no piece of bread or cake in his pockets. He tried to send it away, but it began to bark at him. He wanted to look for a stick but couldn't find anything except snow and ice. Suddenly he saw a stone in the ground. He tried to pick it up but he failed.\n\"How strange Russians  are!\" Mr. Evens said to himself. \"They do not tie their dogs, but firmly  tie the ground!\"", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high12967.txt", "source_text": "On November 15th, 2014, children aged 8 to 12 got together in five cities around the world to participate in the first Global Children's Designation. The event that was organized by a Dutch company called Unexpect, challenged kids to come up with solutions for some of the world's most pressing problems in a day!\nThe day began with the kids listening to the various challenges that were related to their particular cities and towns. The teams were then asked to brainstorm about which problem they were going to handle and how. There were so many amazing ideas produced on that day.\nWhile some of the ideas were far from perfect, there were many that could be practical like the smart cars which can ease traffic pressure by telling traffic lights of its arrival and also guiding the drivers to the best possible route .\nEmer Beamer, the founder of Unexpect, says the purpose of the project is to introduce children to skills they probably never learn in class. She says that for most part, schools focus on teaching things that they will most likely never need to know again. She believes that for kids to be successful in the world, they should be learning how to be creative, handle new technologies and deal with unexpected situations.\nThough the first global design challenge was relatively small, involving only a few hundred of the two billion youngsters that are bursting with ideas, the next one will be much bigger. That's because in 2015, Unexpect plans to distribute free tool kits  to any school that is interested in hosting their own Children's Designation Challenge. We can't wait to see what ideas kids will come up with next.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high11670.txt", "source_text": "Many gardeners believe that \"talking\" to their plants helps them grow---it turns out that _ may not be crazy after all. According to the scientists from the University of Exeter, plants may keep communicating with each other through a secret \"unseen\" language.\nFor their experiment, the scientists picked a cabbage plant that is known to send out a gas when its surface is cut. In order to get video evidence of the communication, they changed the cabbage gene by adding the protein---luciderase , which is what makes fireflies  glow in the dark.\nWhen the changed cabbage plant was in full bloom, they cut a leaf off with a pair of scissors, and almost immediately, thanks to the luciderase, they could see the plant sending out \"methyl jasmonate \".\nWhile this was a known fact, what was surprising was the fact that the minute this gas began to give out, the nearby cabbage plants seemed to sense some kind of danger and started to send out a gas that they normally have to keep predators  like caterpillars  away.\nWhat the scientists are not sure is whether the plants are trying to warn the other leaves or the near plants about the danger---something that will require further research However, the team, which is led by Professor Nick Smirnoff, is quite excited about the findings because this is the first time it has been proved that plants do not live a passive life, but actually move, sense and even communicate with each other.\nHowever, before you get all concerned, they are quite sure that plants do not feel the pain when they are cut, since they do not have nerves---so go ahead and bite into that juicy carrot!", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high4557.txt", "source_text": "Dublin City Hall\nInside City Hall is an interesting exhibition about Dublin's history, with historical items from the old city and multimedia presentations. The building, which dates from 1779, once badly damaged, was recently _ . Guided tours are available. Open Monday to Saturday 10:00 a.m.~5:15 p.m., Sunday and holidays 2:00 p.m.~5:00 p.m. Admission is EUR6.50. Phone 672- 2204.\nDublin Castle\nThis is a joy for anyone interested in archaeology or history. Dublin Castle was built in the 13th century on top of the foundations of a Viking structure. The castle served as a military fortress, prison, court of law and the core   of British administration in Ireland until 1922. It's now used for state functions and government conferences. Guided tours are available. Open Monday to Friday 10:00 a.m.~4:50 p.m.; Saturday, Sunday and holidays 2:00 p.m.~4:50 p.m. Closed during state functions. Admission is EUR4.50. Phone 677- 7129 or 677- 7270.\nTrinity College\nThe sole college of the University of Dublin, Trinity was founded by Queen Elizabeth I in 1592. The reason most visitors venture to Trinity is to take a look at the Book of Kells, which is on display at the Old Library. The ticket price includes admission to the Long Room, a striking space that contains 200,000 of the college's oldest books. Open Monday to Saturday 9.30am~5pm, Sunday noon~4:30 p.m. (from 9:30 a.m. June to September). College Green. Phone 608 -1177.\nIrish Museum of Modern Art\nHoused in the beautifully restored   Royal Hospital Kilmainham (which was modelled   on Les Invalides in Paris), the museum exhibits contemporary art and has an impressive permanent collection that includes pieces representing the cutting edge of Irish and international art. Open Tuesday to Saturday 10:00 a.m.~5:30 p.m., Sunday and holidays noon~5:30 p.m. The museum has no admission charge. Military Road, Kilmainham. Phone 612- 9900.\nJames Joyce Centre\nJames Joyce is one of Dublin's most famous 20th century writers. Author of such works as Dubliners, Ulysses and his autobiographical novel A Portrait of the Artist as a Young Man, Joyce's name is forever linked to the city of Dublin. The James Joyce Centre is dedicated to promoting the life and works of James Joyce to novices and scholars alike. Open Tues.~Sat. 10:00 a.m.~5:00 p.m., Sun. 1: p.m.~5:00 p.m., admission costs EUR5.00 for adults. North Great George's Street. Phone 878- 8547.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "middle2980.txt", "source_text": "We always celebrated Dad's birthday on Thanksgiving Day, even after he entered a nursing home. When we knew it might be his last birthday, the whole family decided to get together for a huge birthday celebration at the nursing home.\nDad was a good storyteller and we were always his listeners. During a quiet moment, I announced it was now Dad's turn to listen to stories for a change. I wanted everyone to tell Dad what we loved about him. The room became quiet. Then one after another, people told stories from their hearts, while Dad listened with tears in eyes.\nEveryone seemed to have more than one story. Even the little grandchildren couldn't wait to tell Dad why they loved him. For a man who had been kind to so many hundreds of people in his life, here was our chance to tell him how much we love him. A few months later, at Dad's memorial service, we more fully realized what we had given to Dad that night. Those are the stories people normally tell at a funeral   after a loved one is no longer alive to hear the words. They tell stories, full of tears. But we had given those memories to Dad in his life, and we had told them through laughter, together with hugs and joy. He had them to hold and enjoyed them from time to time in his mind during his last days and months.\nWords do matter, and they are enough. We just need to say them or to speak them publicly the ones we love. That's the ways to give back love and that's our chance to celebrate a person in his or her life.", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high8443.txt", "source_text": "Good news for middle and high school students. When it comes to sleeping a little longer, physicians are on your side.\nOn Monday, the American Academy Pediatrics  announced its recommendation that middle and high schools start at 8:30 a.m.or later. \"Doing so will match school schedules to the biological sleep patterns of adolescents,\" the AAP writes in a press release regarding its new policy statement called \"School Start Times for Adolescents\" .\n\"Chronic  sleep loss in adolescents is one of the most common public health issues in the U.S.today,\" according to Judith Owens, director of Sleep Medicine at Children's National Health System.\n\"The research is clear that adolescents who get enough sleep have a reduced risk of being overweight or suffering depression, are less likely to be involved in automobile accidents, and have better grades, higher standardized test scores and an overall better quality of life,\" Owens said in the press release. \"Studies have shown that delaying early school start times is one key factor that can help adolescents get the sleep they need to grow and learn.\"\nEven before the AAP's announcement, school districts across the country have been rethinking start times. Earlier this year The New York Times wrote about Dos Santos, a student at Rock Bridge High School. When Dos Santos learned that school officials were considering starting school 30 minutes earlier than the existing time, she became worried.The student gathered others to her cause. In the end, school officials decided against the earlier start time.\nOne of the organizations that Dos Santos reached out to for help was Start School Later, a nonprofit organization that focuses on getting public schools to set \"healthy school hours.\"\n\"It's going to take collective action, perhaps on a national scale, to get many districts to take on this issue,\" Terra Ziporyn Snider, PhD, director and co-founder of Start School Later, told Yahoo Health.\n\"The science is clear, the will to change isn't,\" she explained. \"The reason for that is that community life goes around school schedules, and any suggestion of change - earlier, later, whatever - brings powerful opposition from everyone who fears a change in routine.\"", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high13041.txt", "source_text": "There is one holiday in the year which is completely American, Thanksgiving Day. It is the day when everyone goes back home to spend the day with his family, to have the traditional Thanksgiving dinner of roast turkey, to talk about old times.\nThis is a story of Thanksgiving Day and of one man's efforts, under rather special circumstances, to carry on these traditions.\nOld Pete took his seat this day on his usual bench in Union Square. Every Thanksgiving Day for nine years, Pete had taken this same seat exactly at one o'clock, and each time the same pleasant thing had happened. But this time Pete had come here more from habit than from hunger.\nCertainly today Pete was not hungry. He had just had a dinner so enormous that he could hardly breathe. The buttons on his ragged shirt and coat were about to burst. He was so full of soup, oysters, roast turkey, apple pie, ice cream, and a dozen other rich foods that the November breeze and the first light fall of snow felt cool and pleasant to his face.\nThe meal had been completely unexpected. He had been passing one of the large homes on Fifth Avenue, where there lived two rich old ladies. It seems that it was their custom each Thanksgiving to place a servant at the front entrance with orders to bring in the first hungry looking person that passed and then give him a Thanksgiving dinner of everything he could eat. On this particular Thanksgiving Day, Pete had passed, the servant had brought him in, and, before Pete knew it, he was being served like a king with more food than he could eat.\nPete sat on the bench now, hardly able to move. He happened to look to the left and there in the distance he saw the Old Gentleman coming toward him. He wanted to get up and run, but he was so full of food that he stayed right there. Every Thanksgiving Day for nine years, the Old Gentleman had come here, and found Pete on this same bench, and then taken him to a restaurant and bought him a Thanksgiving dinner. It was a kind of tradition which the Old Gentleman, who had no family and lived alone, had tried to continue. The old man was tall and thin and sixty years old. He was aristocratic looking and he always dressed in black. His hair was whiter and thinner than it had been the year before, and he leaned more heavily on his cane than he used to.\n\"How do you do!\" said the Old Gentleman. \"I am glad to see that the changes of another year have permitted you to move in health through this beautiful world.\"\nEach time the Old Gentleman had said exactly this same thing. It was part of the tradition. Old Pete, too, began to feel as though he himself was now a part of the tradition, and he therefore did not have the courage to tell the old man that he had already eaten. This dinner seemed to mean so much to the Old Gentleman.\n\"Thank you, sir,\" said Old Pete at last. \"I'll go with you gladly. I'm very hungry sir.\"\nTogether the Old Gentleman and Pete walked south to the same restaurant where each year Pete had his Thanksgiving dinner. They sat at the same table. The Old Gentleman seemed pleased and happy. When the waiter brought dish after dish of food to Pete, the Old Gentleman sat quietly and smiled. Under the circumstance, Pete had to eat. It was part of the tradition, and so he ate like a hero. Soup, oysters, roast turkey, pie, he ate everything, although when he entered the restaurant even the smell of more food almost made him sick. At last Pete leaned back with the battle won.\n\"Thank you sir,\" he said, with some effort, \" for a fine dinner.\"\nThey parted as they did each year at the door, the Old Gentleman going south, Pete north.\nAround the corner, Pete stopped for a moment, felt a terrible pain in his stomach, then fell to the sidewalk unconscious. A little later an ambulance came. In the hospital they discovered that he had had an attack of indigestion.\nAn hour later, another ambulance brought the Old Gentleman to the same hospital. At first they thought it was also indigestion but later one of the nurses said,\n\"That nice old gentleman over there-- you wouldn't think that it was a case of starvation. Proud old family, I suppose. He told me that he hadn't eaten a thing for three days.\"", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high1514.txt", "source_text": "Dear Cary,\nI'm writing because I've understood you've struggled with alcoholism  .I've been fighting mine ever since I went through 9-11.After that, _ .I've taken some medicine and it has helped somewhat.I can manage about a month without drinking, but after that I end up having a crazy stage where nothing matters except drinking.After a week or so of heavy drinking,! start having nightmares of people jumping.After that, it's a week of not being able to get out of bed.\nI was supposed to travel to a conference but didn't make it because I got so drunk at the airport that I fell down on my face and spent the rest of the day in the emergency room.I have been hiding from my family since then.Fortunately they won't be expecting me to come back for a week or so.Otherwise, they would notice the bump on my forehead and two black eyes.\nI don't really know what I'm asking you.Cary, I need a way out that doesn't involve causing pain to my family.I'm taking medicine, but' I still have these attacks every few months.If there's alcohol in the house, I can't stay away from it.It seems that this will never end.I'm afraid of what will happen if something bad happens, like a family member dying, or getting fired again.\nThanks for reading.\nYours T", "split": "train", "level": "", "topic": "Present Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high21080.txt", "source_text": "Newspapers in the United States earn most of their money from selling space for advertising. The rates they charge are tied to the number of readers. But the number of people who buy newspapers has been falling for years. And this traditional business model had not worked very well on the Internet, especially in a bad economy.\nMany newspaper companies have large debts from buying other papers. Some papers have recently closed or declared bankruptcy or reduced their operations. \nNewspapers are looking for new ways to reinvent themselves and new ways to earn money. That includes giving new consideration to an old idea-charging for at least some of the material that most papers now publish online for free.\nInternet access to newspapers means that more people may read the news, which is good for society. But good reporting costs money. The question is how much people are willing to pay for news that they have got used to receiving for free.\nThe look of American newspapers changed after USA Today arrived in 1982. Most of the stories were short. There was heavy use of color1 and images. People who compared it to television did not necessarily mean that as praise. But the new design succeeded and influenced many other papers.\nNow newspapers are looking to redesign themselves for an increasingly online world. Millions of people would rather read papers like USA Today and The New York Times for free on the Web than pay for a printed version. Publishers who chose that business plan might regret it now, but they might not have had much choice. Survival means changing as conditions change. Like any other business, newspapers have to balance their needs with the need of their customers.", "split": "train", "level": "", "topic": "Present Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high13768.txt", "source_text": "We feel it important to start reading to your child right from the start -the younger the better! With little ones(children from birth to 4)it is very important to read and reread books.Starting early makes the job of _ (for you will be teaching your child how to listen) easier,as it helps to develop an early love of the written and spoken word.\nWe believe that you should read aloud to your child at least once every day .Set a special reading time during the day or evening when you can settle down  and enjoy a book,without interruption.For most families,reading aloud at bedtime is a common practice.\nWe understand that it can be quite discouraging to read to a child who takes no interest .Take heart! Learning to listen takes experience .The more you read ,the more your child will learn to sit for a story .Children have a natural development of responses to your reading .By the time your child reaches6-7 months,she/he is attracted by the book in your hand ,and would like to test it out by using it as a chew toy.This is natural! By one year,your child is learning to listen and talk about the pages,often shouting out things she/he recognizes.Encourage this! And at the onset  of walking ,you have your biggest challenge yet.your child  is always on the go.you need to set your reading time for a time in the day when your child is preparing to settle down.This means bedtime.Remember,it is your right and duty to teach your child about the power of books.Of course ,it doesn't happen overnight,but the returns are great!", "split": "train", "level": "", "topic": "Present Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high5517.txt", "source_text": "If you're looking for the place that has everything, there's only one place to visit, and that is New York. It's a whole world in a city.\nThe World of Theatre: All of New York is a stage. And it begins with Broadway. Where else can you find so many hit shows in one place? Only in New York.\nThe World of Music: Spend an evening with Beethoven at Lincoln Centre. Swing to the great jazz of Greenwich Village. Or rock yourself silly at the hottest dance spots found anywhere.\nThe World of Art: From Rembrandt to Picasso. From Egyptian tombs to Indian teepees. Whatever kind of art you like, you will find it in New York.\nThe World of Fine Dining: Whether it's roast Beijing duck in Chinatown, lasagna in Little Italy, or the finest French coq au vin found anywhere, there is a world of great taste waiting for you in New York.\nThe World of Sights: What other city has a Statue of Liberty? A Rockefeller Centre? Or a Bronx Zoo?", "split": "train", "level": "", "topic": "a/an/the/zero", "topic_category": "articles_determiners"}
{"id": "middle4254.txt", "source_text": "This is a picture of Kate Green's family. In the picture we can see her grandparents, herparents, her brother Mike and her. Her grandparents are on the chair. Mr Green and Mrs  Greenare behind them. Mike is under the window.  Kate is on the floor. What's behind Kate? It's a cat. It's black and white.", "split": "train", "level": "", "topic": "a/an/the/zero", "topic_category": "articles_determiners"}
{"id": "middle2726.txt", "source_text": "Look at this. It's a blue bag. It is my bag. What's in it? Look, this is my English book. It's blue, too. My Chinese book is also in my bag. It is yellow. This is my pencil case. It's big and nice. I like English and Chinese. My bag is my good friend.\n.", "split": "train", "level": "", "topic": "a/an/the/zero", "topic_category": "articles_determiners"}
{"id": "middle7915.txt", "source_text": "Today is fine. The sky is blue, Now it's nine o'clock in the morning. There's a sports meeting in the forest on the big mountain. Look,a horse, a panda and a cat are running. Over there a dog and two tigers are jumping. Two monkeys are climbing the trees. Four birds are flying around and singing. There are some other animals there, too. The elephants are standing. A monkey is sitting on an old elephant. The monkey has a flag in his hand. Polly is sitting in the tree. A fox, a baby panda and some small animals are sitting under the tree. They are all watching.", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "middle285.txt", "source_text": "Amy: Excuse me, Jill.\nJill:  Yes, what can I do for you?\nAmy: Did you see two persons pass from here? I want to take photos with them.\nJill:  Can you describe what they look like?\nAmy: Yes, they are one boy and one girl. The girl is very beautiful. quite thin and has long hair. And that boy is also very tall. He is about 1.98 meters tall. He has big eyes and  short black hair.\nJill:  You mean Sun Yang, the famous swimming player? And he wears a pair of sunglasses?\nAmy: Quite right. He stays in Shaoxing these days for swimming. Did you see them?\nJill:  Yes, they passed here 10 minutes ago. If you go quickly, You can _ them. \nAmy: I will do that. Goodbye. Thanks a lot.\nJill:  Goodbye.", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "high20094.txt", "source_text": "Don't you find that it is getting increasingly darker every day when you wake up for school ? As winter comes ,days become shorter while the nights become longer ,In the past people slept more in winter ,but in modern times we just use more electric light instead of sunlight to continue our normal routines .\nBut scientific research is finding that manhandling of electric light is making us sick .\nElectric light is fooling the body's biological clock into releasing awaking hormones ( )at the wrong times ,scientists say .This might be leading to seasonal fatigue  and depression .\nMuch more than mental health is at stake ,Recent scientific studies have found that women who work at night ,have higher chances of getting breast-cancer .\n\"Electric lights are wonderful ,but as with a lot of other things ,we really mess ,things up \"said David Avery ,a psychiatrist  .\" Our ancestors evolved in a very regular light -dark cycle ,and our bodies just work better that way .\"\nResearchers have known for a long time that all living things have a biological clock that is linked to light ,Being of the natural day-night cycle can cause fatigue ,mood change and depression ,This is known as seasonal affective disorder ,or SAD.\nScientists disagree on the cause of SAD ,Some say it is caused by winter's late sunrises , others blame the early sunsets .\nHowever ,they all agree the perfect solution to SAD is to give up artificial light ,It will quickly bring someone into a cycle of long ,restful nights and easy awakenings at dawn .\nBut realistically most people need to use electric light in their everyday life . Ironically the next best solution is to use more bright lights to reset the body's biological clock .\nBy getting bright light first thing in the morning it simulates  an earlier dawn and shifts the body clock forward ,according to Alfred Lewy ,a psychiatrist at Oregon Health & Science University .\nA 2005 study done by the American Psychiatric Association showed that daily exposure to bright light was about as effective as medicine used to treat several forms of depression .", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "high8250.txt", "source_text": "If you see a group of kids hitting and abusing an animal, would you stop them? Would you at least call the police? Again people would walk away. Some people do not believe that animal abuse is a big issue.\nEvery day animals are abused in their homes or on the streets. It seems as if politicians do nothing to stop this issue. Everyone is worried about education and global warming. What about animals? We should not ignore them just because they cannot talk to us. Animals, like us humans, have rights. Every living being has the right to warm shelter and good food, but most importantly, they have the right to be wanted and loved. They have the right to be a special, much loved member of their own family.\nThere are many organizations that deal with abused animals or animals that have no home like ASPCA, PETA, the Humane Society and many more. There are organizations that deal with this issue, but that does not mean that we still shouldn't help. The biggest saying that bothers me is, \"I am only one person. I can't make a difference.\" If everyone thought like that, we wouldn't have the organizations and loving people who help the world every day. By helping one animal, you are making a difference.\nThere are many things you can do right now to help animals around your neighborhood. You can volunteer at your local animal shelter, raise money for animal shelters, inform your community about animal abuse or you can write to your representatives and tell them that animal abuse needs to be taken seriously.\nAs you walk down the street, try to help any animals you see walking around. You can easily buy a cheap box of dry cat or dog food to feed the animals. If we do not help our animals now, we may never have animals again. Always remember that with every step you take, you help save an animal's life and isn't that worth fighting for?", "split": "train", "level": "", "topic": "Second Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high22119.txt", "source_text": "\"I've changed my mind.I wanted to have a telescope,but now I want my daddy back .\" Lucien Lawrence's letter to Father Christmas written after his schoolteacher father had been knifed to death outside his school gate ,must have touched every heart.Lucien went on to say that without his father he couldn't see the stars in the sky.When those whom we love depart from us , we cannot see the stars for a while .\nBut Lucien , the stars are still there, and one day, when you are older and your tears have gone , you will see them again. And in a strange way, I expect that you will find your father is there too , in you mind and in your heart .I find that my parents , long dead now , still figure in many of my dreams and that I think of them perhaps more than I ever did when they were alive . I still live to please them and I'm still surprised by their reactions.I remember that when I became a professor, I was so proud,or rather so pleased with myself ,that I couldn't wait to cable my parents . The reply was a long time in coming , but when it did , all Mother said was\"I hope this means that now you will have more time for the children!\" I haven't forgotten .The values of my parents still live on .\nIt makes me pause and think about how I will live on in the hearts and minds of my children and of those for whom I care .Would I have been as ready as Philip Lawrence have been to face the aggressors  , and to lay down my life for those in my care ? How many people would want me back for Christmas ? It's a serious thought , one to give me pause .\nI pray silently , something , in the dead of night , that ancient cry of a poet \" _ ), and my darling form the power of the dog .\"Yet I know that death comes to us all , and sometimes comes suddenly. We must therefore plan not to live forever , but live as if we will die tomorrow. We live on, I'm sure, in the lives of those we loved , and therefore we ought to have to care for what they will remember and what they will treasure . If more parents knew this in their hearts to be true , there might be fewer knives on our streets today .", "split": "train", "level": "", "topic": "Second Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "middle4584.txt", "source_text": "If you won a lottery and had lots of money, what would you do? Most people would start by buying themselves things, such as a new car or a bigger TV. Some people even decide to move a bigger house.\nMany people who win lots of money may find that they have a lot of friends. The new friends they make may follow them for their money but they may also leave them when all money is spent. Sometimes people can't decide what they want to do with all the money they have won, so they try to think of what they want. In the end, most people usually decide to save the money.\nThere are some lottery winners who decide to give up their jobs, because they think they have enough money and don't need to work any longer. Some big lottery winners make even bigger changes--they end their marriages. They feel that they should be with a younger or more attractive man or woman but what they don't know is that their new money is just a bit of luck. _ can't change everything. Before you buy the next lottery ticket, think about what you want to do and what you don't want to do if you won.", "split": "validation", "level": "", "topic": "Second Conditional", "topic_category": "conditionals_hypothesis"}
