{"id": "high9792.txt", "source_text": "Lines around the eyes mean the aging process in the body. Though aging is considered as one of the most unavoidable occurrence in one's life, it is not entirely the thing. You just need to know that you can deal with it in your life. For example, if you are willing to spend a considerable amount of money to make yourself look young again, then you can try eye lifts. However, if you are more of the money-conscious type, then you should decide to go for eye creams which bring the same results but with lower prices.\nDespite of the advantages of using eye creams, however, there is a disadvantage in trying them. This is due to the hundreds of brands o eye creams being marketed at present. If you do not know how to choose the best eye cream in the countless brands available, then you might fall victim to eye creams that do not really fulfill their promised effects.\nWhat's good is that looking for the best eye cream does not involve too much effort. You just have to look for eye cream reviews to know how a product performs and if it lives up to its promises. If you have a dermatologist , then you can ask for advice. If you have none, however, then you can just browse on the net for the best cream for your needs.\nIn searching for eye cream reviews, look for those with reviews based on the results of product testing. Doing so can ensure you that you are not basing your decision on fake review sites that are only made to build up an image of a certain product. Follow these tips and guidelines and you are sure to finally spot the best eye cream that can solve your aging problem.", "split": "train", "level": "", "topic": "First Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high10449.txt", "source_text": "Young visitors to museums often complain about having museum feet,the\ntired feeling one gets after spending too much time in a museum.A case of museum feet\nmakes one feel like saying:\"This is boring.I could have done the painting myself.\nWhen can we sit down? What time is it?\nStudies of museum behavior show that the average visitor spends about four seconds looking at one object.For young visitors,the time call be even shorter.Children are more interested in smells,sounds,and the \"feel'' of a place than looking at a work of art.If they stay in a museum too long,they will feel tired and become impatient.\nTo avoid museum feet,try not to have children look at too many things in one visit.It is reported that young visitors get more out of a visit if they focus on no more than nine objects.One and a half hours is the ideal time to keep their eyes and minds sharp,and their feet happy.", "split": "validation", "level": "", "topic": "First Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high12967.txt", "source_text": "On November 15th, 2014, children aged 8 to 12 got together in five cities around the world to participate in the first Global Children's Designation. The event that was organized by a Dutch company called Unexpect, challenged kids to come up with solutions for some of the world's most pressing problems in a day!\nThe day began with the kids listening to the various challenges that were related to their particular cities and towns. The teams were then asked to brainstorm about which problem they were going to handle and how. There were so many amazing ideas produced on that day.\nWhile some of the ideas were far from perfect, there were many that could be practical like the smart cars which can ease traffic pressure by telling traffic lights of its arrival and also guiding the drivers to the best possible route .\nEmer Beamer, the founder of Unexpect, says the purpose of the project is to introduce children to skills they probably never learn in class. She says that for most part, schools focus on teaching things that they will most likely never need to know again. She believes that for kids to be successful in the world, they should be learning how to be creative, handle new technologies and deal with unexpected situations.\nThough the first global design challenge was relatively small, involving only a few hundred of the two billion youngsters that are bursting with ideas, the next one will be much bigger. That's because in 2015, Unexpect plans to distribute free tool kits  to any school that is interested in hosting their own Children's Designation Challenge. We can't wait to see what ideas kids will come up with next.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high11670.txt", "source_text": "Many gardeners believe that \"talking\" to their plants helps them grow---it turns out that _ may not be crazy after all. According to the scientists from the University of Exeter, plants may keep communicating with each other through a secret \"unseen\" language.\nFor their experiment, the scientists picked a cabbage plant that is known to send out a gas when its surface is cut. In order to get video evidence of the communication, they changed the cabbage gene by adding the protein---luciderase , which is what makes fireflies  glow in the dark.\nWhen the changed cabbage plant was in full bloom, they cut a leaf off with a pair of scissors, and almost immediately, thanks to the luciderase, they could see the plant sending out \"methyl jasmonate \".\nWhile this was a known fact, what was surprising was the fact that the minute this gas began to give out, the nearby cabbage plants seemed to sense some kind of danger and started to send out a gas that they normally have to keep predators  like caterpillars  away.\nWhat the scientists are not sure is whether the plants are trying to warn the other leaves or the near plants about the danger---something that will require further research However, the team, which is led by Professor Nick Smirnoff, is quite excited about the findings because this is the first time it has been proved that plants do not live a passive life, but actually move, sense and even communicate with each other.\nHowever, before you get all concerned, they are quite sure that plants do not feel the pain when they are cut, since they do not have nerves---so go ahead and bite into that juicy carrot!", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high7211.txt", "source_text": "A recent study of ancient and modern elephants has come up with the unexpected conclusion that the African elephant is divided into two distinct  species.\nThe discovery was made by researchers at York and Harvard Universities when they were examining the genetic relationship between the ancient woolly mammoth and mastodon to modern elephants -- the Asian elephant, African forest elephant, and African savanna elephant.\nOnce they obtained DNA sequences  from two fossils , mammoths,and mastodons the team compared them with DNA from modern elephants. They found to their amazement that modern forest and savanna elephants are as distinct from each other as Asian elephants and mammoths.\nThe scientists used detailed genetic analysis to prove that the African savanna elephant and the African forest elephant have been distinct species for several million years. The divergence of the two species took place around the time of the divergence of Asian elephants and woolly mammoths. This result amazed all the scientists. There has long been debate in the scientific community that the two might be separate species, but this is the most convincing scientific evidence so far that they are indeed different species.\nPreviously, many naturalists believed that African savanna elephants and African forest elephants were two populations of the same species, despite the elephants' significant size differences. The savanna elephant has an average shoulder height of 3.5 metres while the forest elephant has an average shoulder height of 2.5 metres. The savanna elephant weighs between six and seven tons, roughly double the weight of the forest elephant. But the fact that they look so different does not necessarily mean they are different species. However the proof lay in the analysis of the DNA.\nAlfred Roca, assistant professor in the Department of Animal Sciences at the University of Illinois, said, \"We now have to treat the forest and savanna elephants as two different units for conservation purposes. Since 1950,all African elephants have been conserved as one species. Now that we know the forest and savanna elephants are two very distinctive animals, the forest elephant should become a bigger priority  for conservation purposes.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high20453.txt", "source_text": "When he was driving home one evening on a country road,he saw an old lady,stranded on the side of the road.He stopped in front of her car and got out.Even with the smile on his face,she was worried.He looked poor and hungry.He knew how she felt.He said,\"I am here to help you,madam.Why\ndon't you wait in the car where it's warm? By the way, my name is Joe.\"\nShe had a flat tire.Joe crawled under the car,changed the tire.But he got dirty and his hands hurt.She could not thank him enough and asked him how much she owed him.He told her that if she really wanted to pay him back,the next time she saw someone who needed help,she could give that person the  assistance they needed,and Joe added,\"And think of me.\"\nShe drove off.A few miles down the road the lady saw a small restaurant.She went in.The waitress had a sweet smile,and was nearly eight months pregnant .The old lady wondered how someone like her who seemed poor could be so kind to a stranger.Then she remembered Joe.After the lady finished her meal,the waitress went to get her change from a hundred--dollar bill.But she stepped right out the door.\nWhen the waitress came back,she noticed something written on a napkin,\"I am helping you because someone once helped me.If you really want to pay me back,here's what you do---Do not let the chain of love end with you.\"\nThat night when she got home,she was thinking about the money and what the lady had written.She and her husband needed money with the baby due next month.She knew how worried her husband was,and as he lay sleeping next to her,she whispered,\"Everything's going to be all right.I love you,Joe.\"", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high1514.txt", "source_text": "Dear Cary,\nI'm writing because I've understood you've struggled with alcoholism  .I've been fighting mine ever since I went through 9-11.After that, _ .I've taken some medicine and it has helped somewhat.I can manage about a month without drinking, but after that I end up having a crazy stage where nothing matters except drinking.After a week or so of heavy drinking,! start having nightmares of people jumping.After that, it's a week of not being able to get out of bed.\nI was supposed to travel to a conference but didn't make it because I got so drunk at the airport that I fell down on my face and spent the rest of the day in the emergency room.I have been hiding from my family since then.Fortunately they won't be expecting me to come back for a week or so.Otherwise, they would notice the bump on my forehead and two black eyes.\nI don't really know what I'm asking you.Cary, I need a way out that doesn't involve causing pain to my family.I'm taking medicine, but' I still have these attacks every few months.If there's alcohol in the house, I can't stay away from it.It seems that this will never end.I'm afraid of what will happen if something bad happens, like a family member dying, or getting fired again.\nThanks for reading.\nYours T", "split": "train", "level": "", "topic": "Present Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high21080.txt", "source_text": "Newspapers in the United States earn most of their money from selling space for advertising. The rates they charge are tied to the number of readers. But the number of people who buy newspapers has been falling for years. And this traditional business model had not worked very well on the Internet, especially in a bad economy.\nMany newspaper companies have large debts from buying other papers. Some papers have recently closed or declared bankruptcy or reduced their operations. \nNewspapers are looking for new ways to reinvent themselves and new ways to earn money. That includes giving new consideration to an old idea-charging for at least some of the material that most papers now publish online for free.\nInternet access to newspapers means that more people may read the news, which is good for society. But good reporting costs money. The question is how much people are willing to pay for news that they have got used to receiving for free.\nThe look of American newspapers changed after USA Today arrived in 1982. Most of the stories were short. There was heavy use of color1 and images. People who compared it to television did not necessarily mean that as praise. But the new design succeeded and influenced many other papers.\nNow newspapers are looking to redesign themselves for an increasingly online world. Millions of people would rather read papers like USA Today and The New York Times for free on the Web than pay for a printed version. Publishers who chose that business plan might regret it now, but they might not have had much choice. Survival means changing as conditions change. Like any other business, newspapers have to balance their needs with the need of their customers.", "split": "train", "level": "", "topic": "Present Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high5151.txt", "source_text": "A new report says African governments are ill prepared to handle the growing number of people over age 65. The population in Africa  as in other parts of the world, is getting older. Currently, there are 36 million people on the continent 65 years and above. which is 3.6 percent of the population. up from 3.3 percent 10 years ago. That could rise to 4.5 percent by 2030 and 10 percent by 2050. The African development Bank is raising concerns over the shortage of health insurance and pensions  .\nThe African Development Bank says. \"Aging is highly linked with long-term physical and mental  disability and a number of long-term chronic   conditions.\"\n\"Africa is not well prepared to care for its aging population right now. And it needs to prepare for this fact.\" said Professor Mthuli Ncube. the African Development Bank's chief economist. African nations spend far less on healthcare than developed nations do _  about $26per person per year. Not so many countries have well developed medical aid plans for the elderly, whether they are privately provided plans or indeed government plans. If you look at the pension plans, you will find the pension industries are not well developed in some of the countries.\nProfessor Mthuli Ncube said African governments failed to take action on health insurance\nand pensions because they were busy with economic reforms.\nAnother challenge for Africa is the worsening of informal systems of social protection. That is cash and support from both the extended family and community sources.\n. The African Development Bank recommends governments help carry out health insurance and pension plans. Ncube said African governments didn't have to handle the health insurance burden alone. \"It is not only a must but also an opportunity for private companies to add their bit in this regard\", he said. The report also recommends that African governments consider providing ways of free health services. medications and long-term health care facilities for the elderly.", "split": "train", "level": "", "topic": "Reporting verbs", "topic_category": "reported_speech"}
{"id": "high5587.txt", "source_text": "New research suggests that speaking more than one language may delay different kinds of dementia , that is the loss of mental ability. In fact, researchers say, speaking two languages appears to be more important than the level of education in defending against dementias.\nA study in India examined the effect of knowing more than one language in delaying the first signs of several dementias. Researchers studied nearly 650 people whose average age was 66. 240 of those studied suffered from Alzheimer's, the most common form of mental decline . 391 of the _ spoke two or more languages. Researchers found the dementias began about four-and-a-half years later in those who spoke two languages compared to those who spoke only one language. The level of education had no effect on the age at the first sign of dementia.\nThomas Bak, from the Center of Cognitive Aging at the University of Edinburgh in Scotland, who helped to organize the study, suggests that individuals who speak more than one language train their brains by moving back and forth between different words and expressions. He also believes this effort improves what scientists called executive  functioning, which often weakens in people with dementias. He states that researchers found there was no extra gain in speaking more than two languages.\nMr Bak says it does not appear important whether you learn another language at a young age or later in life. It's not something that \"you missed the boat when you do not do it as a baby.\" It is something that is still quite useful and powerful when you do it as an adult.", "split": "train", "level": "", "topic": "Reporting verbs", "topic_category": "reported_speech"}
{"id": "high12630.txt", "source_text": "You surely want to take a good school yearbook photo, for you only get to do it once, and it's what people remember you by for the whole school year. Learn how to look good and look natural in your yearbook photo with these simple tips.\n1. Practice smiling in a mirror. It sounds crazy, but figuring out how to make a natural looking smile for the camera does need a little preparation. Don't be shy! Just imagine you are in front of a camera --hold your head high, look straight into the mirror and smile. Keep practicing until you find out your most attractive smiling face.\n2. Choose your color wisely. In yearbook photos, lots of people look good in darker colors because they draw attention to the face. Generally, white often isn't the best choice because it can make your skin look a bit gray, especially if you're pale. Besides, stay away from super -bright colors ( bright yellow, bright blue) unless you're really sure they make you look perfect.\n3. Avoid unnecessary details. Busy patterns draw attention to themselves in yearbook photos, not to your face and smile. Save them for your everyday fashion experiments. Besides, have your clothes prepared for the day when the yearbook photo is taken. The last thing you want to do is pick out the perfect thing to wear, only to find that it's in the laundry.\n4. Avoid big changes to your appearance. Big changes may not turn out the way you hope. Leave some time to do your hair, such as combing  it up right before the yearbook photo is taken. Don't overdo it, since you want your hair to stay in one place and your face to draw all the attention, but go for the \"less is more\" approach.", "split": "train", "level": "", "topic": "Verb patterns (advise sb to…, make/let + bare inf…)", "topic_category": "gerunds_infinitives"}
{"id": "high9119.txt", "source_text": "China has now mapped out plans for its next four launches in the Shenzhou program on the next flight. But one conclusion seems to have escaped most reports in the aerospace media. The flight of Shenzhou 7 could be timed to coincide with the Beijing Olympics. Plans for the 2008 Summer Olympics call for the events to be held between the 8th and 24th of August. It's reasonable to expect that China will use the event to promote its achievements before the world, and human spaceflight is China's most significant recent breakthrough.\nShenzhou 7, China's next manned space mission, was originally advertised for 2007. This fit into the pattern of staging a two-year gap between crewed Shenzhou missions, which have previously launched in 2003 and 2005. But Chinese media statements have recently _ this to 2008. Chinese media have reported that while the overall program is going well, more time is needed to work on the spacesuit that will be used on this flight to stage China's first spacewalk. It's possible that Chinese engineers want to make best preparations for this complex mission.\nChina could intend to carry out the mission of Shenzhou 7 just as media attention is focused on the lead-up to the Olympics. The crew of the flight, and possibly China's other flown astronauts, could then take part in the opening ceremony. China has previously feted her space travellers in great celebrations, such as the Hong Kong event that saw Yang Liwei singing with actor Jacky Chan.\nChina has also suggested that the activity will be carried out by a single astronaut, and has indicated that half an hour is a rough estimate of the planned time for the spacewalk. China is apparently following suit, probably for the same reasons of conservative mission planning and safety.", "split": "train", "level": "", "topic": "can/could", "topic_category": "modals"}
{"id": "high10899.txt", "source_text": "American farmers are raising five percent more goats for meat these days.\nGoat meat is high in protein and lower in unhealthy fat than many other meats.Even so,the industry is small compared to chicken,beef and pork. But immigration has brought more of a taste for goat to America from all over the world.\nExperts from the University of Illinois offer some questions for people to consider if they are thinking about raising goats.\nFirst of all,do you understand that there always has to be someone to care for the goats?\n*How much land do you have available? And how good is it? Poor ground may support two to four goats on half a hectare.Better grassland can support six to eight. If goats and cattle share the land,two goats can be added for each cow. The goats will eat weeds and other plants that cattle do not like.\n*Do you have buildings for the number of female goats you plan to keep during winter? An open,cold,dry barn is better than a closed,warm barn where the air is wet.\n*Do you have the equipment to clean barns  and to harvest hay  to feed your goats? Or will you get someone else to do it,or buy the hay?\nThe experts say a profitable business in goat meat may take three to five years to establish.And, of course, there are no guarantees .", "split": "train", "level": "", "topic": "Direct vs Indirect questions", "topic_category": "questions_special"}
{"id": "high23554.txt", "source_text": "If you do not use your arms or your legs some time, they become weak; when you start using them again, they slowly become strong again. Everybody knows this and nobody would think of questioning this fact. Yet there are many people who do not seem to know that memory works in the same way. When someone says that he has a good memory, he really means that he keeps his memory in practice by exercising it frequently either consciously  or unconsciously. When someone else says that his memory is poor, he really means that he doesn't give it enough chances to become strong. \nIf a friend complains that his arms and legs are weak, we know that it is his own fault. But if he tells us that he has a poor memory, many of us think his parents are to blame and that he is just unlucky, and few of us realize that it is just as much as his own fault as if it is his arms or legs that were weak.", "split": "train", "level": "", "topic": "Zero Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "middle2531.txt", "source_text": "Do you like dogs? Do you know the following things about dogs?\nThe first pet dog\nDogs are meat-eating animals. They belonged to the family of wolves   a long time ago. About 15,000 years ago, people started keeping wolves for hunting  . Over the time, the wolves began to look like dogs and they became people's pets.\nWhat a dog looks like\nDogs come in different sizes, colors and shapes, but they're the same in some ways. All kinds of dogs have a set of forty-two strong teeth for eating. They have sharp claws   at the end of their feet for digging up soil   and holding onto the ground when they walk. They have very good eyesight. They also have high ability   to hear and smell.\nHow a dog grows\nA mother dog gives birth to one to twelve babies at a time. New-born baby dogs cannot see or hear until they are two weeks old. The mother dog gives the baby dogs milk. When they are four weeks old, they start eating soft food. When they're eight weeks, the baby dogs have very strong legs and they can go for long walks.\nHow to read a dog's feelings\nDogs act differently when they have different feelings. When a dog is angry, it opens its mouth and shows its teeth. When a dog is frightened, it lowers its ears and holds its tail   between its legs. A happy dog always wags   its tail.\n,. (10)", "split": "train", "level": "", "topic": "Zero Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high6304.txt", "source_text": "On Oct4,2011 , I phone 4s made its international appearance at the press conference claimed by the Iphone cooperation . Ever since then , Iphone4s has become _ and even made a fashion around the globe. Meanwhile , many new expressions come about in relationship with this type of high-tech products. \"Jailbreak\" is one of them.\n\" Jailbreak\" means to unlock the operating system of a mobile phone or other device so that it can run software which it is not normally authorized to use because of restrictions imposed  by the device's manufacturer.\nIf someone jailbreaks a smartphone, tablet computer or other device , they use a special piece of software in order to remove the restrictions imposed by the manufacturer on the kind of applications that can be downloaded and run on the device. The concept of jailbreaking is most often associated with products from Apple Inc, such as the iPhone, iPod and iPad, which routinely restrict the user to applications licensed exclusively  by Apple and purchased via its App Store. As well as wanting to lift the restriction  on what kinds of applications they can purchase, those who jailbreak often do so as a reaction against what they consider as a form of censorship  imposed by Apple Inc in only allowing the use of their 'approved' apps.\nThe concept of jailbreaking dates back to July 2007, when it was applied to the iPhone within a month of the device's first release. This first occurrence related to the adding of custom ringtones , but the idea quickly developed as a means to lift the restriction and equip the phone with games and other applications not licensed by Apple Inc.", "split": "train", "level": "", "topic": "Reduced relative clauses", "topic_category": "relatives_participles"}
{"id": "high17451.txt", "source_text": "Mr. and Mrs. Martin live in New York. Mr. Martin is a doctor and his office is in New York. Mrs. Martin teaches music at a school in New York.\n    They have two sons. Their sons' names are Ted and Roy. Ted is twenty years old. He is now in Taiwan. He is studying Chinese. He went to Taiwan last month and is going to stay there for two years.\nRoy is thirteen years old. He goes to high school. He likes sports very much. He likes swimming best. He can swim faster than his father. He wants to be the best swimmer in his school.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high16133.txt", "source_text": "Sheffield\nLincoln College of English\nClasses for foreign students at all levels 3 months, 6 months, 9 months and one course open all year.\nSmall class (maximum 12 students), library, language lab and listening center,\naccommodations with selected families 25 minutes from London.\nCourse fees for English for one year are $1380 with reduction for shorter periods of study.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "middle7915.txt", "source_text": "Today is fine. The sky is blue, Now it's nine o'clock in the morning. There's a sports meeting in the forest on the big mountain. Look,a horse, a panda and a cat are running. Over there a dog and two tigers are jumping. Two monkeys are climbing the trees. Four birds are flying around and singing. There are some other animals there, too. The elephants are standing. A monkey is sitting on an old elephant. The monkey has a flag in his hand. Polly is sitting in the tree. A fox, a baby panda and some small animals are sitting under the tree. They are all watching.", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "middle285.txt", "source_text": "Amy: Excuse me, Jill.\nJill:  Yes, what can I do for you?\nAmy: Did you see two persons pass from here? I want to take photos with them.\nJill:  Can you describe what they look like?\nAmy: Yes, they are one boy and one girl. The girl is very beautiful. quite thin and has long hair. And that boy is also very tall. He is about 1.98 meters tall. He has big eyes and  short black hair.\nJill:  You mean Sun Yang, the famous swimming player? And he wears a pair of sunglasses?\nAmy: Quite right. He stays in Shaoxing these days for swimming. Did you see them?\nJill:  Yes, they passed here 10 minutes ago. If you go quickly, You can _ them. \nAmy: I will do that. Goodbye. Thanks a lot.\nJill:  Goodbye.", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "middle7326.txt", "source_text": "Alice: Good morning, Bob.\nBob: Good morning, Alice.\nAlice: Bob, this is Grace.\nBob: Hi, Grace.\nGrace: Hi, Bob.\nAlice: Oh, what is that?\nBob: It's my green key.\nAlice: What's this?\nBob: It is a ruler.\nAlice: Is it your   ruler?\nBob: No. My ruler is red. This ruler is blue.\nAlice: Grace, is it your ruler?\nGrace: Oh no. It is Frank's ruler.\nAlice:40 .", "split": "train", "level": "", "topic": "this/that/these/those", "topic_category": "articles_determiners"}
{"id": "high18853.txt", "source_text": "All you have is what you bring with you\nI've always felt a need to be prepared for whatever situation I've found myself in.\nMy mother once took me to a store when I was seven years old. She and I got to the checkout counter, and she realized she had forgotten a couple of things on her shopping list. She left me with the cart and ran off to get what she needed.\n\"I'll be right back.\" she said.\nShe was gone just a few minutes, but in that time, I had loaded all the things on the belt and everything was rung up. I was left staring at the cashier, who was staring at me.\" Do you have money for me, son?\" she said. \"I'll need to be paid.\" \nI didn't realize she was just trying to amuse herself. So I stood there, ashamed and embarrassed.\nBy the time my mom returned, I was angry. \"You left me here with no money! This lady asked me for the money, and I had nothing to give her!\"\nNow that I'm an adult, you'll never catch me with less than $200 in my wallet. I want to be prepared in case I need it.\nI've always admired people who are over-prepared. In college, I had a classmate named Norman. One day he was giving a presentation on an overhead projector   and in the middle of his talk, the light bulb on the projector blew out. We would have to wait ten minutes until someone found a new' projector.\n\"It's Okay.\" he announced. \"There's nothing to worry about.\"\nWe watched him walk over to his bag and pull something out. He had brought along a spare bulb for the Overhead projector. Who could even think of that?\nI often told my students, \"When you go into the wilderness, the only thing you can depend on is what you take with you.\" And essentially, the wilderness is anywhere but your home or office. So take money. Pack a light bulb. Be prepared.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high17496.txt", "source_text": "A new semester has just started and a number of parents are registering to change their children's names, in the hope that it will change their temper or help their children drop bad habits, like addiction to the Internet.\n    One mother surnamed Shi renamed her son, a primary school student, Hengfu, which means eternal happiness in Chinese. She decided to change the boy's name because he always did poorly in study. She has had him tutored after school, but he always earns low marks in school. So Shi turned to a name-giving master. \"I hope the special recipe could bring him good luck,\" the mother said. Teachers in the city say a few students in every school, most nearing graduation, change their names at the start of every new semester.\n    A naming agency said it has found names for nearly 1,000 students since setting up the shop in 1998. The store said its professionals analyzed the defects   of a person's original name, and suggested a new one based on the person's birthday and other fortune-telling skills.\n    Buying a new name costs between 800 yuan and 10,000 yuan. Parents also have to register the name at the local police department for a small fee. This will legally change their child's name on all documents, including ID cards and passports.\nHu Jie, a university student who changed her name in her final year of high school, said the new name confused her. \"I always had no idea who my classmates were calling when they used my new name,\" Hu said, adding that she wished she had kept her old name.\nBut parents may be ignoring one thing: name changes might encourage kids to believe that fate is more important than their own efforts.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high4296.txt", "source_text": "Loren Gladstone of Toronto is 58, but thinking over how to bequeath   his digital property . Doing the paperwork after his parents' death was a challenge. \"When my time comes, I wonder if my children will even know what paper is,\" he says. As a software developer, his virtual property is both valuable and vital to his business. That reflects a problem. Online lives have increasing economic and emotional value. But testamentary   laws offer confusing and incomplete ways of bequeathing and inheriting   them.\nDigital property may include software, websites, downloaded content, online gaming identities, social-media accounts and even e-mails. In Britain alone holdings of digital music may be worth over PS9 billion ($14 billion). A fifth of respondents to a Chinese local-newspaper survey said they had over 5,000 yuan($790) of digital property. And value does not lie only in money.\"Anyone with kids under 14 years old probably has two prints of them and the rest are in online galleries,\"says Nathan Lustig of Entrustet, a company that helps people manage digital property.\nService providers have different rules--and few state them clearly in their terms and conditions. Many give users a personal right to use an account, but nobody else, even after death. Facebook allows relatives to close an account or turn it into a memorial page. Gmail (run by Google) will provide copies of e-mails to an executor  . Music downloaded via iTunes is held under a license which can be abolished on death. Apple declined to comment on the record on this or other policies. All e-mail and data on its iCloud service are deleted on the death of the owner.\nThis has led to cases to court in America. In 2004 the family of Justin Ellsworth, an army man killed in Iraq, took Yahoo! to court in Michigan to get copies of his e-mails. This year, a court in Oregon ruled that another American mother whose son had died could use her dead son's password to enter his Facebook account for a short period. Now five American states have made laws giving executors control over the social-networking accounts of dead users.\nBut this raises the subject of privacy. Passing music on is one thing; not everyone may want their relatives to read their e-mails. Colin Pearson, a London-based lawyer, says access should come only with a clear provision in a will.\nBut laws, wills and password safes may be contrary to the providers' terms of service, especially when the executor is in one country and the data in another. Headaches for the living and lots of lovely work for lawyers.", "split": "train", "level": "", "topic": "Participle clauses (V-ing/V-ed)", "topic_category": "relatives_participles"}
{"id": "high2100.txt", "source_text": "Signs in Chinese will be set up in public areas such as airports, to benefit Chinese travelers, the Italian Government announced in late February. _ .\nDespite the different languages, travel across Europe has never been so simple. Just five years ago, if you wanted to visit Germany in the north and Spain in the south in one trip, you had to wait for weeks to apply for different visas from the two countries. You also needed a calculator because both countries had different money.\nToday, with a Schengen Visa issued by any member country, you can travel across 15 European countries without stopping. Since 2002, within most of the EU, there is now just one type of money called the Euro. The Euro was designed to be the only money in the EU, and already makes it easier to shop around. If you drive, your driving license and car insurance policy are valid in the other European countries. And you can use your mobile phone everywhere.\nAll the countries in the continent are melting into a united Europe under the EU. For Europeans and visitors, the result is that it is more convenient to travel back and forth between the different countries.", "split": "train", "level": "", "topic": "Used to", "topic_category": "tenses_aspects"}
{"id": "high16625.txt", "source_text": "One of the serious problems for today's society is who should be responsible for the old and how to improve their lives. It is not only a financial problem but also a question of the system we want for our society. I would like to suggest several possible solutions to this problem.\nFirst,employers should take the responsibility for their retired employees. To make this possible,a percentage of profits should be set aside for this purpose. But when a company must take lifelong responsibility for its employees,it may suffer from a commercial disadvantage due to higher employee costs.\nAnother way of solving the problem is to return the responsibility to the individual. This means each person must save during his working years to pay for his years of retirement. This does not seem a very fair model since some people have enough trouble paying for their daily life without trying to earn extra to cover their retirement years. This means the government might have to step in to care for the poor.\nIn addition,the government could take the responsibility for the care of the old. This could be financed through government taxes to increase the level of pensions. Furthermore,some institutions should be created for senior citizens,which can help provide a comfortable life for them. Unfortunately,as the present situation in our country shows,this is not a truly viable answer. The government can seldom afford to care for the old,particularly when it is busy trying to care for the young.\nOne further solution is that the government or social organizations establish some workplaces especially for the old where they are independent.\nTo sum up,all these options have advantages and disadvantages. Therefore,it is reasonable to expect that some combination of these options may be needed to provide the care we hope to give to the old generations.", "split": "train", "level": "", "topic": "should/ought to", "topic_category": "modals"}
{"id": "high8250.txt", "source_text": "If you see a group of kids hitting and abusing an animal, would you stop them? Would you at least call the police? Again people would walk away. Some people do not believe that animal abuse is a big issue.\nEvery day animals are abused in their homes or on the streets. It seems as if politicians do nothing to stop this issue. Everyone is worried about education and global warming. What about animals? We should not ignore them just because they cannot talk to us. Animals, like us humans, have rights. Every living being has the right to warm shelter and good food, but most importantly, they have the right to be wanted and loved. They have the right to be a special, much loved member of their own family.\nThere are many organizations that deal with abused animals or animals that have no home like ASPCA, PETA, the Humane Society and many more. There are organizations that deal with this issue, but that does not mean that we still shouldn't help. The biggest saying that bothers me is, \"I am only one person. I can't make a difference.\" If everyone thought like that, we wouldn't have the organizations and loving people who help the world every day. By helping one animal, you are making a difference.\nThere are many things you can do right now to help animals around your neighborhood. You can volunteer at your local animal shelter, raise money for animal shelters, inform your community about animal abuse or you can write to your representatives and tell them that animal abuse needs to be taken seriously.\nAs you walk down the street, try to help any animals you see walking around. You can easily buy a cheap box of dry cat or dog food to feed the animals. If we do not help our animals now, we may never have animals again. Always remember that with every step you take, you help save an animal's life and isn't that worth fighting for?", "split": "train", "level": "", "topic": "Second Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high22119.txt", "source_text": "\"I've changed my mind.I wanted to have a telescope,but now I want my daddy back .\" Lucien Lawrence's letter to Father Christmas written after his schoolteacher father had been knifed to death outside his school gate ,must have touched every heart.Lucien went on to say that without his father he couldn't see the stars in the sky.When those whom we love depart from us , we cannot see the stars for a while .\nBut Lucien , the stars are still there, and one day, when you are older and your tears have gone , you will see them again. And in a strange way, I expect that you will find your father is there too , in you mind and in your heart .I find that my parents , long dead now , still figure in many of my dreams and that I think of them perhaps more than I ever did when they were alive . I still live to please them and I'm still surprised by their reactions.I remember that when I became a professor, I was so proud,or rather so pleased with myself ,that I couldn't wait to cable my parents . The reply was a long time in coming , but when it did , all Mother said was\"I hope this means that now you will have more time for the children!\" I haven't forgotten .The values of my parents still live on .\nIt makes me pause and think about how I will live on in the hearts and minds of my children and of those for whom I care .Would I have been as ready as Philip Lawrence have been to face the aggressors  , and to lay down my life for those in my care ? How many people would want me back for Christmas ? It's a serious thought , one to give me pause .\nI pray silently , something , in the dead of night , that ancient cry of a poet \" _ ), and my darling form the power of the dog .\"Yet I know that death comes to us all , and sometimes comes suddenly. We must therefore plan not to live forever , but live as if we will die tomorrow. We live on, I'm sure, in the lives of those we loved , and therefore we ought to have to care for what they will remember and what they will treasure . If more parents knew this in their hearts to be true , there might be fewer knives on our streets today .", "split": "train", "level": "", "topic": "Second Conditional", "topic_category": "conditionals_hypothesis"}
{"id": "high12487.txt", "source_text": "Most schools forbid chewing gum, but in a few years they might consider changing that rule. Why? Scientists are finding evidence that gum chewing may be good for your health. It may even help improve your test scores.\nThis exciting research is just beginning. And in the meantime, companies are also experimenting with adding vitamins, minerals, medicines, and other substances that could give gum the power to cure headaches and fight everything from serious diseases to bad breath.\nOther researchers are finding that gum might work better than a pill to deliver medicines and other substances into the bloodstream. That's because the lining   of our cheeks can absorb certain substances more quickly than our stomachs and intestines   can.\nThat discovery could help other researchers develop medicine-containing gums that fight colds, ease headaches, battle nervousness, and more. Scientists might even create antimicrobial   gums that cure bad breath.\nThose projects may take years, but gum scientists have already had at least one recent success: They've created a gum that could help us stay awake.\nResearchers have produced a gum called Stay Alert. Each stick has as much caffeine as a cup of coffee. It can take an hour for the caffeine in coffee to have its full effect, but the caffeine in Stay Alert _ in just a few minutes.\nThe gum is easy to transport and it's stable in cold and hot climates. Unlike a pill, it doesn't require water to swallow. Those qualities make it easy for soldiers to use.\nFor now, Stay Alert is available only to the military  . The manufacturer may one day offer it for sale to the public. People who work at night, such as truck drivers and medical personnel who ride in ambulances, might benefit from a product like Stay Alert.", "split": "train", "level": "", "topic": "may/might", "topic_category": "modals"}
{"id": "high11809.txt", "source_text": "I don't often lose things and I'm always careful with money, so I was quite surprised when I reached for my wallet and it wasn't there. At first, I thought it was possible that I could have left it at home. Then I remembered taking it out to pay the taxi, so I knew I had it with me just before I walked into the restaurant. I wondered if it was possible that it could have dropped out of my pocket while I was eating dinner. I turned and walked back to the table where I had been sitting. Unluckily, there were several people sitting at the table at that time, so I had the waiter go over to the table to see if my wallet was on the floor. While the waiter was looking for it, the head of the restaurant came up to me and asked me if anything was wrong. I told him what had happened. He asked me to report the missing wallet to the police. I told him I didn't want to do so; I was in a hurry because I had to reach my waiting room before two o'clock, where some people were waiting to see me. I also told him that my biggest worry at the moment was how I was going to pay for the meal. He told me not to worry about that. He asked me to write down my name and address, and he said he would send me a bill  .", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high4682.txt", "source_text": "Emilio and Michi spread the colorful tablecloth on the table. They made room for Drew, who was carrying a dish. \"Watch out,\" Drew warned. \"This is pretty hot.\"\nA moment later, Kent and Alyssa added another hot dish to the table. \"That smells so good!\" said Michi. \"Are most of the parents here yet? I'm hungry.\"\nKent looked through the doors that led into the hallway. \"I think Ms. Milano and Mr.Hasselbach just finished giving _ the garden touring. They should be heading into the cafeteria next.\"\nThe students of Jefferson Middle School in Saint Louis, US had spent all afternoon preparing for the evening meal. They did their best to transform the lunchroom into a beautiful dining area for their families.\nAs the families found their seats, Ms. Milano asked Drew, Emilio, and Michi to join her at the front of the room. She said, \"I just wanted to take a moment to congratulate Drew, Emilio and Michi for their wonderful idea. A year ago, they first came to me with the plan for starting a garden at Jefferson. I wondered whether it would work, but they had thought through everything. Any time I had a question about how we would make this work, they had an answer prepared. As you can see, they were absolutely correct. About three-quarters of the food you will be enjoying came from the school garden. The students prepared the entire meal themselves.\"\nMs. Milano handed Drew, Michi and Emilio a box each. They opened their box as Ms. Milano continued. \"As a thank-you to these students for their creative idea and hard work, they have each received a stepping stone for the garden. Their names and date appear on the stones.\"\nShe turned to them. \"Students for years to come will be enjoying the garden that you helped create,\" she said. \"We thought it would be appropriate for them to have a reminder of our garden's founders.\"\nThey held up their stepping stones and smiled as the crowd clapped. \"And now,\" said Ms Milano, \"please help yourself to some of the mouthwatering food our young chefs have prepared. Dinner is served!\"", "split": "train", "level": "", "topic": "Backshifting tenses", "topic_category": "reported_speech"}
{"id": "high2508.txt", "source_text": "Going Zero Waste means more than dealing with the rubbish we create. It means reducing _ , too. People who go Zero Waste are careful about what they do. They never take more than they need, they reuse plastic bags, and they make good plans not to buy more than necessary before going shopping.\nKamikatsu, a Japanese village, has already gone Zero Waste. The 2,000 villagers recycle everything possible. There are 34 different boxes at the recycling center! The villagers sometimes just feel unhappy about what they have to do, but they also see the good side.\nLet's think about how to enjoy a Zero Waste Christmas. By sending recyclable cards, we can help our friends and family reduce  waste. And wouldn't it be better to enjoy the spirit of Christmas with a real tree that can be re-planted in spring?\nGoing Zero Waste requires us to think more about what happens before and after we act. It is not always easy. But just think how good it would be, both for ourselves and for the earth we live on, if we never had to waste anything.", "split": "train", "level": "", "topic": "V-ing vs to-V", "topic_category": "gerunds_infinitives"}
{"id": "high23058.txt", "source_text": "Architecture lovers in Washington do not have to travel far to see some of the world's most famous buildings. Architect Adam Reed Tucker has recreated fifteen of them using Lego bricks. The exhibit is called \"LEGO Architecture: Towering Ambition.\" It is at the National Building Museum in Washington until early September. Faith Lapidus has more.\nLego bricks are small, color1ful plastic blocks. They can be snapped together to make any number of objects. They are popular with children of all ages around the world.\nAdam Reed Tucker calls himself an \"architectural artist\". He was a professional architect for ten years. After the terrorist attacks against the United States in two thousand one he decided to do something different. He wanted to express his feelings for the form of the skyscraper while deepening his understanding of architecture, engineering and construction. He chose to use something that most people used as children.\nTucker does all his work by hand, using only pictures of the buildings. He does not use any computers or drawings to plan his buildings. While the exhibit is going on, Tucker will be working on his latest work, the White House where the American president lives. Visitors can watch him create the famous building brick by brick.\nAfter walking through Tucker's models, visitors can create their own works at the building station. They can make houses, office buildings, stores or factories. They can then place their models on a large map of a city. As more visitors come, the Lego city will grow.\nTo many people, Legos might seem like toys for kids. But Adam Reed Tucker proves that  _ . To watch another Lego artist at work, go to 51voa.com and click on Captioned Videos.\nLowry Baker came from McLean, Virginia, to see the exhibit. Baker said, \"When we saw the models, there were just amazing. As soon as my son got a look at all of the stations here, he wanted to start building. It's really a great set-up. It really encourages creativity on the kids' part.\"", "split": "train", "level": "", "topic": "V-ing vs to-V", "topic_category": "gerunds_infinitives"}
{"id": "high2311.txt", "source_text": "It gives me great pleasure today to say a few words in praise of a man we will all miss very much. To be honest, I can't imagine we will do without him when he's gone.\nBill Masters almost single-handed built up our sales force in the Houston area and developed the market position that we enjoy today. In only six years, he has brought the firm from a very low fifth position in the area sales to the point where we now outsell all but one of our competitors. Not only have we got 37 per cent of the market under Bill's leadership; we are increasing our share with each passing month.\nAs you know, the company has moved Bill to northern California to work his sales magic in one of this company's most competitive  areas. But we know that if anyone can do it, Bill Masters can, and I know you all join me in wishing him the best of luck in his new work.", "split": "train", "level": "", "topic": "Present Perfect", "topic_category": "tenses_aspects"}
{"id": "middle2980.txt", "source_text": "We always celebrated Dad's birthday on Thanksgiving Day, even after he entered a nursing home. When we knew it might be his last birthday, the whole family decided to get together for a huge birthday celebration at the nursing home.\nDad was a good storyteller and we were always his listeners. During a quiet moment, I announced it was now Dad's turn to listen to stories for a change. I wanted everyone to tell Dad what we loved about him. The room became quiet. Then one after another, people told stories from their hearts, while Dad listened with tears in eyes.\nEveryone seemed to have more than one story. Even the little grandchildren couldn't wait to tell Dad why they loved him. For a man who had been kind to so many hundreds of people in his life, here was our chance to tell him how much we love him. A few months later, at Dad's memorial service, we more fully realized what we had given to Dad that night. Those are the stories people normally tell at a funeral   after a loved one is no longer alive to hear the words. They tell stories, full of tears. But we had given those memories to Dad in his life, and we had told them through laughter, together with hugs and joy. He had them to hold and enjoyed them from time to time in his mind during his last days and months.\nWords do matter, and they are enough. We just need to say them or to speak them publicly the ones we love. That's the ways to give back love and that's our chance to celebrate a person in his or her life.", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "high8443.txt", "source_text": "Good news for middle and high school students. When it comes to sleeping a little longer, physicians are on your side.\nOn Monday, the American Academy Pediatrics  announced its recommendation that middle and high schools start at 8:30 a.m.or later. \"Doing so will match school schedules to the biological sleep patterns of adolescents,\" the AAP writes in a press release regarding its new policy statement called \"School Start Times for Adolescents\" .\n\"Chronic  sleep loss in adolescents is one of the most common public health issues in the U.S.today,\" according to Judith Owens, director of Sleep Medicine at Children's National Health System.\n\"The research is clear that adolescents who get enough sleep have a reduced risk of being overweight or suffering depression, are less likely to be involved in automobile accidents, and have better grades, higher standardized test scores and an overall better quality of life,\" Owens said in the press release. \"Studies have shown that delaying early school start times is one key factor that can help adolescents get the sleep they need to grow and learn.\"\nEven before the AAP's announcement, school districts across the country have been rethinking start times. Earlier this year The New York Times wrote about Dos Santos, a student at Rock Bridge High School. When Dos Santos learned that school officials were considering starting school 30 minutes earlier than the existing time, she became worried.The student gathered others to her cause. In the end, school officials decided against the earlier start time.\nOne of the organizations that Dos Santos reached out to for help was Start School Later, a nonprofit organization that focuses on getting public schools to set \"healthy school hours.\"\n\"It's going to take collective action, perhaps on a national scale, to get many districts to take on this issue,\" Terra Ziporyn Snider, PhD, director and co-founder of Start School Later, told Yahoo Health.\n\"The science is clear, the will to change isn't,\" she explained. \"The reason for that is that community life goes around school schedules, and any suggestion of change - earlier, later, whatever - brings powerful opposition from everyone who fears a change in routine.\"", "split": "train", "level": "", "topic": "Past Perfect Continuous", "topic_category": "tenses_aspects"}
{"id": "middle2621.txt", "source_text": "My name is Lucy. I come from America. I am now in China.  I study in Hangzhou Shulan Middle School. There are many clubs in our school. They are an English club, an art club, a music club, a ball game club, a swimming club, a chess club and a computer club. There is a \"Show Yourselves !\" Festival in our school every year. On that day, students from different clubs show their talents in different ways. They can sing English songs, draw and paint beautiful pictures. They can play the guitar, the violin, the piano, and the trumpets. They can also play chess and show us their swimming skills. They like the festival very much.  I join the art club, and I paint the ads  for them . Giving  help makes me happy.", "split": "train", "level": "", "topic": "Preposition + V-ing", "topic_category": "gerunds_infinitives"}
{"id": "high19910.txt", "source_text": "Despite the anxiety that Jones' Host--said by some to be the first digital novel--caused in 1993, publishers weren't too concerned that e-books would one day replace printed books. However, that attitude was changed suddenly in 2007 when Amazon's Kindle came onto the market, which led to e-book sales jumping up to 1,260%. Since then, e-books' popularity has continued to rise steadily. The publishing industry seemed to have lost all possible ability to regain its position. Will printed books eventually become a thing of the past?\nAccording to Mike Shatzkin, founder and CEO of the Idea Logical Company, printed books just for plain old reading will, in 10 years from now, be unusual. \"Not so unusual that a kid will say, 'Mommy, what's that?' but unusual enough that on the train you'll see one or two people reading something printed, while everyone else is reading off of a tablet.\" And Shatzkin believes that the de mise of print is sure to happen, though such a day won't arrive for perhaps 50 to 100 or more years.\nRobert Stein, founder of the Institute for the Future of the Book, however, believes that books won't disappear entirely, at least not anytime soon. \"Print will exist, but it will be in a\ndifferent field and will appeal to a very limited audience, as poetry does today. Like woodblock printing, hand-processed film and folk weaving  , printed pages may assume an artistic\nvalue,\" he says. He imagines that future forms of books might be developed not by traditional publishers but by the gaming industry. He also predicts that the distinction between writer and reader will be made less obvious by a social reading experience in which authors and consumers can digitally interact with each other to discuss any passage, sentence or line.\nIs there anything we risk sacrificing, should print really disappear entirely? According to Maryanne Wolf, director of the Center for Reading and Language Research at Tufts University, electronic reading can negatively affect the way the brain responds to text, including reading comprehension, focus and the ability to maintain attention to details like plot and order of events. \"My worry is that we'll have a short-circuited reading brain, excellent for gathering information but not necessarily for forming critical, analytical deep reading skills,\" Wolf says.\n        The field, however, is in an early stage, and findings about the negative effects of e-reading are far from certain. In light of this, Wolf hopes that we continue to maintain a \"bi-literate\" society--one that values both the digital and printed word. \"A full reading brain circuit is a huge contribution to the intellectual development of our species. Anything that threatens it deserves our attention.\"", "split": "train", "level": "", "topic": "Future (going to)", "topic_category": "tenses_aspects"}
{"id": "high16165.txt", "source_text": "I recently turned fifty, which is young for a tree, midlife for an elephant, and ancient for a sportsman. Fifty is a nice number for the states in the US or for a national speed limit but it is not a number that I was prepared to have hung on me. Fifty is supposed to be my father's age, but now I am stuck with this number and everything it means.\nA few days ago, a friend tried to cheer me up by saying, \" Fifty is what forty used to be.\" He had made an inspirational point, Am I over the hill?People keep telling me that the hill has been moved, and I keep telling them that he high-jump bar has dropped from the six feet I once easily cleared to the four feet that is impossible for me now.\n\" Your are not getting older, you are getting better.\" says Dr. Joyce Brothers. This, however, is the kind of doctor who inspires a second opinion.\nAnd so. as I approach the day when I cannot even jump over the tennis net. I am moves to share some thoughts on aging with you. I am moved to show how aging feels to me physically and mentally. Getting older. of course, is obviously a better change than the one that brings you eulogies . In fact, a poet named Robert Browning considered it the best change of all:\nGrow old along with me!\nThe best is yet to me.\nWhether or not Browning was right, most of my first fifty years have been golden ones, so I will settle for what is ahead being as good as what has gone by. I find myself moving toward what is ahead with a curious blend   of both fighting and accepting my aging, hoping that the philosopher   was right when he said.\" Old is always fifteen years from now.\"", "split": "test", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle8209.txt", "source_text": "Tommy and his mother go shopping  today. Tommy's father likes apples very much. They buy some red apples for him. Tommy's mother likes yellow bananas, but the bananas are green. \"Look! The strawberries are very nice, Mom. Do you like them?\" Tommy says to his mother. \"Yes, I like strawberries very much.\" Tommy's mother buys some for herself  . The oranges are very nice. Tommy's mother buys some for Tommy. He likes oranges very much.\nThey need some vegetables. The vegetables in the supermarket are very good. They buy some tomatoes, cabbages and carrots. Tommy doesn't like carrots, but his parents like it. They like carrots very much. They buy lots of carrots.", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high4557.txt", "source_text": "Dublin City Hall\nInside City Hall is an interesting exhibition about Dublin's history, with historical items from the old city and multimedia presentations. The building, which dates from 1779, once badly damaged, was recently _ . Guided tours are available. Open Monday to Saturday 10:00 a.m.~5:15 p.m., Sunday and holidays 2:00 p.m.~5:00 p.m. Admission is EUR6.50. Phone 672- 2204.\nDublin Castle\nThis is a joy for anyone interested in archaeology or history. Dublin Castle was built in the 13th century on top of the foundations of a Viking structure. The castle served as a military fortress, prison, court of law and the core   of British administration in Ireland until 1922. It's now used for state functions and government conferences. Guided tours are available. Open Monday to Friday 10:00 a.m.~4:50 p.m.; Saturday, Sunday and holidays 2:00 p.m.~4:50 p.m. Closed during state functions. Admission is EUR4.50. Phone 677- 7129 or 677- 7270.\nTrinity College\nThe sole college of the University of Dublin, Trinity was founded by Queen Elizabeth I in 1592. The reason most visitors venture to Trinity is to take a look at the Book of Kells, which is on display at the Old Library. The ticket price includes admission to the Long Room, a striking space that contains 200,000 of the college's oldest books. Open Monday to Saturday 9.30am~5pm, Sunday noon~4:30 p.m. (from 9:30 a.m. June to September). College Green. Phone 608 -1177.\nIrish Museum of Modern Art\nHoused in the beautifully restored   Royal Hospital Kilmainham (which was modelled   on Les Invalides in Paris), the museum exhibits contemporary art and has an impressive permanent collection that includes pieces representing the cutting edge of Irish and international art. Open Tuesday to Saturday 10:00 a.m.~5:30 p.m., Sunday and holidays noon~5:30 p.m. The museum has no admission charge. Military Road, Kilmainham. Phone 612- 9900.\nJames Joyce Centre\nJames Joyce is one of Dublin's most famous 20th century writers. Author of such works as Dubliners, Ulysses and his autobiographical novel A Portrait of the Artist as a Young Man, Joyce's name is forever linked to the city of Dublin. The James Joyce Centre is dedicated to promoting the life and works of James Joyce to novices and scholars alike. Open Tues.~Sat. 10:00 a.m.~5:00 p.m., Sun. 1: p.m.~5:00 p.m., admission costs EUR5.00 for adults. North Great George's Street. Phone 878- 8547.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "middle2893.txt", "source_text": "Once my father asked me to hold his hammer while he repaired something, so we could have some time to talk to each other.\nFor 22 years, after I left home for college, he called me every Sunday at 9 am. He was always interested in my life and how my family was doing, and I never once heard him complain about his own life.\nNine years ago when I bought my first house, my father, 67 years old, spent eight hours a day painting it for three days. He would not allow me to pay someone to have it done. All he asked for was a glass of iced tea and for me to hold a paint brush for him and talk to him. But I was too busy.\nFive years ago, at age 71, my father spent five hours putting together a swingset   for my daughter. Again, all he asked was that I get him a glass of iced tea and talk to him. But again, I was too busy.\nFour years ago, my father drove all the way from Denver to Topeka, with an eight-foot Colorado blue spruce   in his trunk, so that my husband and I could have a part of Colorado growing on our land. I was preparing for a trip that weekend and couldn't spend much time with him.\nThen, one day, my father telephoned me as usual, this time from my sister's home in Florida. We talked about the tree he had brought me, \"Fat Albert\", but that morning he called it \"Fat Oscar\", and he seemed to have forgotten some things. I had to get to church, so I cut the conversation short.\nThe call came at 4:40 pm that day: my father was in hospital in Florida with an aneurysm  . I got on a plane immediately, and on the way I thought of all the times I had not taken the time to talk to my father. I realized that I had no idea who he was or what his deepest thoughts were. I promised that when I arrived, I would make up for lost time.\nI arrived in Florida at 1 am. My father had passed away at 9:12 pm. This time it was he who did not have time to talk to me.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high20094.txt", "source_text": "Don't you find that it is getting increasingly darker every day when you wake up for school ? As winter comes ,days become shorter while the nights become longer ,In the past people slept more in winter ,but in modern times we just use more electric light instead of sunlight to continue our normal routines .\nBut scientific research is finding that manhandling of electric light is making us sick .\nElectric light is fooling the body's biological clock into releasing awaking hormones ( )at the wrong times ,scientists say .This might be leading to seasonal fatigue  and depression .\nMuch more than mental health is at stake ,Recent scientific studies have found that women who work at night ,have higher chances of getting breast-cancer .\n\"Electric lights are wonderful ,but as with a lot of other things ,we really mess ,things up \"said David Avery ,a psychiatrist  .\" Our ancestors evolved in a very regular light -dark cycle ,and our bodies just work better that way .\"\nResearchers have known for a long time that all living things have a biological clock that is linked to light ,Being of the natural day-night cycle can cause fatigue ,mood change and depression ,This is known as seasonal affective disorder ,or SAD.\nScientists disagree on the cause of SAD ,Some say it is caused by winter's late sunrises , others blame the early sunsets .\nHowever ,they all agree the perfect solution to SAD is to give up artificial light ,It will quickly bring someone into a cycle of long ,restful nights and easy awakenings at dawn .\nBut realistically most people need to use electric light in their everyday life . Ironically the next best solution is to use more bright lights to reset the body's biological clock .\nBy getting bright light first thing in the morning it simulates  an earlier dawn and shifts the body clock forward ,according to Alfred Lewy ,a psychiatrist at Oregon Health & Science University .\nA 2005 study done by the American Psychiatric Association showed that daily exposure to bright light was about as effective as medicine used to treat several forms of depression .", "split": "train", "level": "", "topic": "Present Continuous", "topic_category": "tenses_aspects"}
{"id": "high19035.txt", "source_text": "With little rain, ancient Egyptians relied mostly on the Nile River to water their crops, so they could only grow certain kinds of food. They mainly grew wheat and barley  .\nThe Egyptians made the wheat into bread, soup and porridge, and they also added hops   to make the barley into beer. In fact, some people think that the Egyptians would not have begun growing grain if they hadn't liked beer so much. Many Egyptian models of beer jars have been found, which the Egyptians put into graves of dead people so that they would have beer in the next world.\nThe Egyptians also ate meat. They went to a butcher shop and bought meat there, just as people do today. But because it rarely rains in Egypt, they could have the meat outside in the yard of the store instead of inside. Click on the left and you will see a model of a butcher shop, which was also found in somebody's grave. Can you see the different cuts of meat all laid out? There is a whole leg of mutton at the very bottom. However, Egyptians thought pigs carried infectious disease. They ate beef, mutton, duck and goose. \nFor dessert, the Egyptians had a great interest in dates. Here is a picture of some real Egyptian dates which were put into people's graves for them to eat in the next world, and which were kept in the dry climate for three thousand years until archaeologists dug them up.\nArchaeologists have also found seeds which show that the Egyptians grew watermelon and other kinds of melon.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "high827.txt", "source_text": "Have you ever wondered why the roots of the plants always know which way to grow--into the soil but not above it? Some British scientists have recently solved this mystery.\nIt turns out that roots have special hairs that tie them into the soil and help them grow their way past obstacles, a team at the John Inners Center in Norwich reports in the February 29 issue of Journal Science.\n\"The key is in the fuzzy coat of hairs on the roots of plants,\" says professor Liam Dolan. \"We have found a growth control system that enables these hairs to find their way and to become longer when their path is clear.\"\nRoot hairs explore the soil in much the same way a person would feel their way in the dark. If they come across an obstacle, they make their way around until they can continue growing in an opening. In the meantime, the plant is held in place as the hairs grip the soil.\nThe hairs are guided by a clever chemical trick. A protein  at the tip of the root hairs called RHD2 helps them to take calcium  from the soil. Calcium makes the hairs grow, and produce more RHD2, and take more calcium.\nBut when an obstacle blocks the hair's path, or the hair reaches the surface of the soil, the cycle is broken and growth starts in another direction.\nThis system gives plants the flexibility to explore a complex environment and to live in even the most unpromising soils, says Dolan.\nIn poor soils such as in parts of Australia and Africa, native plants have adapted by producing enormous numbers of root hairs. A better understanding of this adaptation will allow scientists to develop hairy rooted crops that can grow in unfriendly environments.\nAccording to Dolan, \"Research in the John Inners Center is taking a breeding approach to increase hair length in wheat but it will be some time before new cultivars  are developed.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high7274.txt", "source_text": "If you were walking around a supermarket and saw a woman with a shaved head, a ring through her nose, a tattoo design on her arm and she has a small child in her shopping _ , what would your opinion be? Do you think this kind of body decoration is attractive or ugly? Different people have different ideas. The following are some examples of body decoration from around the world.\nIn many parts of Africa, it is thought that an attractive girl should have really shinny skin.\nOn Bali, a little island in Indonesia, they believe that a beautiful woman or handsome man must have perfectly straight, flat teeth. The Balinese believe that teeth with pointed edges make you look like an ugly wild animal. So when a girl or boy becomes a teenager, he or she is taken to a special person in their village who will file off teeth points to make them smooth and flat. There is no anesthetic and this tooth filing is really painful. It is a kind of test. If you can stand it without screaming or crying too much, then you are thought ready to become an adult.\nIn Myanmar, there is a small group of people who are called the \"Papaung\". They believe that a woman can only be really beautiful if she has a long neck. I mean a VERY long neck. Now you might think that you are either born with a long or short neck and that there's nothing whatever you can do about it. But you would be wrong! At around the age of 5, a Papaung girl has heavy metal rings fitted around her neck, tightly between the chin and shoulders. Each year more rings are added and very, very slowly their weight pushes the shoulders down, in this way making the neck look longer. A Papaung woman will wear her neck rings all her life, never once taking them off.\nSo now I'm sure you will all agree that different people have different ideas about what is beautiful.", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
{"id": "high7972.txt", "source_text": "Unlike chemists and physicists, who usually do their experiments using machines, biologists and medical researchers have to use living things like rats. But there are three Nobel prize-winning scientists who actually chose to experiment on themselves - all in the name of science, reported The Telegraph.\n1. Werner Forssmann (Nobel prize winner in 1956)\nForssmann was a German scientist. He studied how to put a pipe inside the heart to measure the pressure inside and decide whether a patient needs surgery.\nExperiments had been done on horses before, so he wanted to try with human patients. But it was not permitted because the experiment was considered too dangerous.\nNot giving up, Forssmann decided to experiment on himself. He anaesthetized   his own arm and made a cut, putting the pipe 30 centimeters into his vein. He then climbed two floors to the X-ray room before pushing the pipe all the way into his heart.\n2. Barry Marshall (Nobel prize winner in 2005)\nMost doctors in the mid-20th century believed that _ was down to stress, spicy food or an unusually large amount of stomach acid. But in 1979 an Australian scientist named Robin Warren found that the disease might be related to a bacteria called Helicobacter pylori.\nSo he teamed up with his colleague, Barry Marshall, to continue the study. When their request to experiment on patients was denied, Marshall bravely drank some of the bacteria. Five days later, he lost his appetite and soon was vomiting each morning - he indeed had gastritis.\n3. Ralph Steinman (Nobel prize winner in 2011)\nThis Canadian scientist discovered a new type of immune system cell called the dendritic cell. He believed that it had the ability to fight against cancer.\nSteinman knew he couldn't yet use his method to treat patients. So in 2007, when doctors told him that he had cancer and that it was unlikely for him to live longer than a year, he saw an opportunity.\nWith the help of his colleagues, he gave himself three different vaccines based on his research and a total of eight experimental therapies. Even though Steinman eventually died from his cancer, he lived four and a half years, much longer than doctors had said he would.", "split": "train", "level": "", "topic": "Past Perfect", "topic_category": "tenses_aspects"}
{"id": "high18773.txt", "source_text": "There was a rich merchant who had 4 wives. He loved the 4th wife the most and adorned her with rich robes and treated her to delicacies. He took great care of her and gave her nothing but the best. \nHe also loved the 3rd wife very much. He's very proud of her and always wanted to show her off to his friends. However, the merchant is always in great fear that she might run away with some other men. \nHe too, loved his 2nd wife. She is a very considerate person, always patient and in fact is the merchant's confidante. When the merchant faced some problems, he always turned to his 2nd wife and she would always help him out and tide him through difficult times. \nNow, the merchant's 1st wife is a very loyal partner and has made great contributions in maintaining his wealth and business as well as taking care of the household. However, the merchant did not love the first wife and although she loved him deeply, he hardly took notice of her. \nOne day, the merchant fell ill. Before long, he knew that he was going to die soon. He thought of his luxurious life and told himself, \"Now I have 4 wives with me. But when I die, I'll be alone. How lonely I'll be!\" \nThus, he asked the 4th wife, \"I loved you most, endowed you with the finest clothing and showered great care over you. Now that I'm dying, will you follow me and keep me company?\" \n\"No way!\" replied the 4th wife and she turned away without another word. \nThe answer cut like a sharp knife right into the merchant's heart. The sad merchant then asked the 3rd wife, \"I have loved you so much for all my life. Now that I'm dying, will you follow me and keep me company?\"\n\"No!\" replied the 3rd wife. \"Life is so good over here! I'm going to remarry when you die!\" The merchant's heart sank and turned cold. \nHe then asked the 2nd wife, \"I've always turned to you for help and you've always helped me out. Now I need your help again. When I die, will you follow me and keep me company?\" \n\"I'm sorry, I can't help you out this time!\" replied the 2nd wife. \"At the very most, I can only send you to your grave.\" The answer came like a bolt of thunder and the merchant was devastated. \nThen a voice called out: \"I'll leave with you. I'll follow you no matter where you go.\" The merchant looked up and there was his first wife. She was so skinny, almost like she suffered from malnutrition. Greatly grieved, the merchant said, \"I should have taken much better care of you while I could have!\" \nActually, we all have 4 wives in our lives.\nThe 4th wife is our body. No matter how much time and effort we lavish in making it look good, it'll leave us when we die. \nOur 3rd wife is our possessions, status and wealth. When we die, they all go to others. \nThe 2nd wife is our family and friends. No matter how close they had been there for us when we're alive, the furthest they can stay by us is up to the grave. \nThe 1st wife is in fact our soul, often neglected in our pursuit of material, wealth and sensual pleasure. \nGuess what? It is actually the only thing that follows us wherever we go. Perhaps it's a good idea to cultivate and strengthen it now rather than to wait until we're on our deathbed to lament.", "split": "train", "level": "", "topic": "Past Simple", "topic_category": "tenses_aspects"}
{"id": "middle67.txt", "source_text": "Mike  and  his  father  are  sitting   at   the  table . They are having their lunch. \" I  don't  like  this  soup  .  I  don't  want  to  have  it\" ,  says  Mike .  After  lunch ,  Mike  and  his  father  work  on  the  farm .  They work hard. In  the  evening ,  Mike's  father  gives  him  a  bowl  of  soup . \"Oh, this soup is nice \", says Mike.  His mother says: \"It's the same soup.\"", "split": "train", "level": "", "topic": "Present Simple", "topic_category": "tenses_aspects"}
{"id": "high19743.txt", "source_text": "The advantages of an international language in the modern world are obvious. Thanks to modern methods of transport, we can travel everywhere more easily and more quickly than ever before, but the language problem still remains. Without a common language, there may be misunderstandings between people of different countries. There are two possible solutions to this problem: either we choose one of the main living languages of the world, or we make up an artificial  one. But neither solution is simple because no living language will be acceptable to everyone and because an artificial language, such as Esperanto, has no culture and would be thought boring by many learners.\nIt is often said that English is quickly becoming a world language. It is certainly the most widely used language in the world, and second only to Chinese in its number or native speakers, but there are certain worries of choosing English as an international language.\nFirst of all, for political reasons and national pride, English is not acceptable to everyone as a world language. Many dislike its influence. English words enter their language and this often threats their own language. In France, a new word \"frangla is\" has been invented to describe the results. Although English is being taught in more and more schools abroad, the process is not always popular. Not every nation is prepared to accept the leading position of English in their education system", "split": "train", "level": "", "topic": "Passive (all tenses)", "topic_category": "passive_causative"}
